[{"url":"https://api.github.com/repos/solomonxie/solomonxie.github.io/issues/comments/383297580","html_url":"https://github.com/solomonxie/solomonxie.github.io/issues/17#issuecomment-383297580","issue_url":"https://api.github.com/repos/solomonxie/solomonxie.github.io/issues/17","id":383297580,"user":{"login":"solomonxie","id":14041622,"avatar_url":"https://avatars2.githubusercontent.com/u/14041622?v=4","gravatar_id":"","url":"https://api.github.com/users/solomonxie","html_url":"https://github.com/solomonxie","followers_url":"https://api.github.com/users/solomonxie/followers","following_url":"https://api.github.com/users/solomonxie/following{/other_user}","gists_url":"https://api.github.com/users/solomonxie/gists{/gist_id}","starred_url":"https://api.github.com/users/solomonxie/starred{/owner}{/repo}","subscriptions_url":"https://api.github.com/users/solomonxie/subscriptions","organizations_url":"https://api.github.com/users/solomonxie/orgs","repos_url":"https://api.github.com/users/solomonxie/repos","events_url":"https://api.github.com/users/solomonxie/events{/privacy}","received_events_url":"https://api.github.com/users/solomonxie/received_events","type":"User","site_admin":false},"created_at":"2018-04-21T13:59:50Z","updated_at":"2018-04-21T14:01:33Z","author_association":"OWNER","body":"# 《读书系统的革命: 第六版》2013年\r\n——由图书产业链的结构重组引起的技术革命\r\n\r\n\r\n——由图书产业链的结构重组引起的技术革命\r\n\r\n目录\r\n（正文部分 第六版）\t2\r\n第一节 发布会\t2\r\n第二节 秘密\t5\r\n第三节 一篇报告\t9\r\n第四节 神秘礼品\t13\r\n第五节 线索\t18\r\n第六节 北京\t22\r\n第七节 扎克伯格与乔布斯\t27\r\n第八节 秘密协议\t30\r\n第九节 Project-L\t33\r\n第十节 麦肯锡\t38\r\n第十一节 命运的结合\t41\r\n第十二节 加州远征队\t43\r\n\r\n\f（正文部分 第六版）\r\n\r\n第一节 发布会\r\n2019年10月1日，位于美国加州库珀蒂诺市——苹果公司总部的Town Hall Auditorium礼堂中，正在举办一场新产品发布会。\r\n这次的发布会规模宏大，从总部的室外和礼堂的内部装潢上来看，似乎苹果为这次的发布会的准备做了不少工作。\r\n这里聚集了全球几乎所有知名媒体人以及资深业内人士。\r\n苹果公司在一个月前，给这些指定的媒体和同行统一发了一封邀请信，内容很简单，只是说这次新产品发布会将掀起一场风暴。\r\n时代周刊的资深记者Andy与实习生Sam在礼堂门口领取了一张参会牌挂在脖子上，同时挂在脖子上的还有几个厚重的摄影器材。两个人在人群中穿梭，终于占据了一个有利的拍摄地点。\r\n发布会还没开始，Sam放下了沉重的设备，“Andy,怎么回事啊，怎么会有这么多人？上次我和你去三星的发布会时可没有这么热闹呢。”\r\nAndy拍了几张会场的照片后，也放下了设备，回答说：“怎么你不知道吗，那封邮件。”\r\n“邮件？”Sam好奇地问。\r\n“对了，因为你才来没多久，所以没有告诉你，”Andy从小包里掏出了一个比手掌要大很多的三星手机，点了几下，“你看，这是一个月前苹果发给我们的邀请信。”\r\nSam看到手机上正显示着一封邮件，内容只有简单的一句话：“苹果公司邀请您参加2019年的新产品发布会，共同鉴证这次科技大革命。”\r\nAndy接着说：“你可能不知道，苹果这两年经营的很不好，股票连续下跌，”然后Andy指了指礼堂门口的一个挂立海报，“然后他们决定请那个人来管理公司。”\r\nSam顺着他的手看过去，然后惊讶的说到：“那个，不是扎克伯格（全球顶尖社交网站Facebook创始人）吗！怎么会让他来苹果公司了？”\r\n“Sam，”Andy说道，“记住，你是一个记者，这么重要的消息怎么能不关注呢？”\r\nSam羞愧的低下了头。\r\n“扎克伯格在年初的时候发表了声明，说他不愿意总是维护同一个产品，那太枯燥了——没有什么挑战性，”Andy说，“所以他辞去了Facebook网站的CEO职位，只保留原有股份，打算趁着年轻挑战一下。”\r\n“然后呢？”Sam问。\r\n“然后，没几天苹果公司就发表声明说将聘用扎克伯格做新一任CEO，希望用他的年轻勇敢和创新能力，带领苹果重返光荣。”\r\n“所以说，”Sam兴奋的说，“这次是要发布扎克伯格上任后第一个产品了？”\r\n“是的，”Andy答道。\r\nSam满怀憧憬地看着那篮球场般大小的演讲台，“真想知道十几年前的那个震惊了全世界的怪才，这次又能带来什么惊喜！”\r\n“是啊，在场的所有人都和你一样的想法。”\r\n\r\n在发布会正式开始前，请让我先介绍一下当时的背景。\r\n有心的读者也许还记得，在本世纪的前十年里，苹果的智能手机iphone和平板电脑ipad以绝对的优势占领了全球的市场。\r\n然而随着2011年苹果的灵魂人物乔布斯去世，苹果的优势直线下降——再也没能发布什么吸引人的产品。这个时候，同样是科技产品巨头的三星公司抓住了这个机会，投入了近10亿元的研发经费，发誓要取代苹果的地位。\r\n效果很快就显现出来了，之后的几年里，三星发布了一系列新产品，无论是硬件配置还是功能操作上，都领先了其他竞争对手很多，同时成本也要低很多，因此快速的占领了市场。\r\n到了2018年，三星更是发布了新型Note X平板电脑，不但完美的结合了手机和电脑的所有优点，甚至还创造了不需要插电话卡就可以让移动设备随时随地联网的技术，这项技术不但取消了电脑和手机的区别，还引领了当时所有科技设备厂商的潮流。\r\n更重要的是，他们将价格定在1999元——这简直是同类产品中不可想象的超低价格，三星就这样踢掉了所有的竞争对手，成为了市场第一。\r\n这个时候，无论是昔日软件巨人——微软、搜索巨匠——谷歌还是潮流先锋——苹果，发布的产品都无法与三星匹敌。他们的产品不是创新不足，就是价格太高，怎么追赶都总是慢一拍。\r\n而三星的这些竞争对手中受到打击最大的，就是苹果公司了。因为他的大部分利润都来自于屈指可数的几款手机和电脑，另外一部分销售软件的利润也被三星打败了。因为苹果的IOS系统是不开放的，而三星使用的安卓系统是完全开放的，这样一来就吸引了苹果无法比拟的大量自由开发者，创造出了无数免费而又好用的软件。\r\n一家著名的财经分析频道中出现了这样的一条消息：\r\n在连续12个月的销售额下降和股价下跌后，苹果公司终于按耐不住了，记者在采访董事长莱文森时了解到，苹果正准备动用一切资源来场大的改革，否则将会很难生存下去。\r\n几乎就在同时，苹果公司得到了扎克伯格辞职的消息，于是就有人提议，如果能请来那个曾经震惊了世界的天才的话，也许苹果还有的救。他不但胆子大敢于创新，又有足够的能力和精力，就像曾经的乔布斯一样。\r\n董事会当机立断，请来了扎克伯格商谈，扎克伯格马上就答应了。2019年1月7日苹果公司郑重其事地对媒体宣布，任命扎克伯格为新一任的苹果CEO。\r\n\r\n10个月过去了。\r\n大礼堂的灯光忽然暗了下来，只照亮了演讲台上的一角。这时出现了一个人，踩着滑板滑到了讲台。台下顿时掌声雷动——这就是扎克伯格。\r\nSam看到，这个穿着一个休闲短裤和灰色T恤并且踩着滑板的滑稽的男人，就是那个传说中的扎克伯格。\r\n这个出场真是让人眼睛一亮。\r\n扎克伯格敲了两下话筒，清了清喉咙：“大家好，我是扎克伯格，”他带着点调皮的表情说，“发布会结束了，你们可以回去了。”\r\n会场上顿时一片哗然。\r\nSam瞪着大眼睛问身旁的Andy：“怎么回事，发布会明明还没开始啊！”\r\nAndy哈哈大笑，说：“你太不了解扎克伯格了，他就是喜欢搞怪！”\r\n果然，扎克伯格大声地说：“嘿嘿，我是开玩笑的。但是我敢说，从某些方面来说发布会已经完成了，”他指了指脖子上挂着的那个像员工牌一样的卡片，“我想你们刚才在进礼堂的时候都领到了这张卡片，那么现在请你们把它举起来给我看看。”\r\n听众们不知道这是怎么一回事，但还是照着他说的做了，纷纷将已经取下的准入牌举起来。\r\n“然后请你们在空中摇一摇手。”听众们虽然觉得有种被耍的感觉，还是照着他说的摇了摇手。\r\n突然，他们听到一连串咔嚓咔嚓的声音，手中像银行卡片的东西突然亮了起来。Sam看到手中的卡片正发着亮光，并显现出了一个像手机一样的操作画面。\r\n所有人都惊呆了。“哇塞！”“好酷！”台下一片热闹，很多人甚至忍不住兴奋地叫了出来。\r\n扎克伯格解释说，在每个人进大厅时领取的并不是一张普通的参会卡，而是苹果团队研发的新式智能手机iphone card。\r\n它的屏幕并不是我们常见的液晶屏幕，而是采用了最新的电子纸材料，亚马逊公司的Kindle阅读器就是采用的电子纸方式。如果我们不仔细看的话，很难认出来它是一个屏幕。\r\n以往虽然有产品采用了电子纸，但是为了给其供电、照明、加键盘等，大大增加了厚度，并没有很好的发展。而扎克伯格首次将这种电子纸真的做到接近纸那么薄，而且还是可以触摸操作的界面。\r\n可以说在当时这已经是足够震撼的科技了，难怪会场上的人会那么惊讶。\r\nAndy一脸无奈的说，“果然是扎克伯格的风格，我们又被他耍了！”\r\n然而他却感到很兴奋，毕竟不是所有人都能够见证这样的科技产品发布的——还是以这种奇妙的方式。\r\n扎克伯格看着台下所有人惊讶的表情，暗自得意。他摇了摇自己的卡片，并在上面点了几下，突然所有人的卡片都响了一声。\r\n“这是我的名片，”扎克伯格说。\r\nSam低头看到手上的卡片变成了一张名片，上面只有短短的一行字——“混蛋，我是苹果CEO，你喜欢我的设计吗？”台下又是一阵哗然。\r\n只有少数几个了解他的人才知道，这是扎克伯格特有的名片。虽然被骂，但是人们都敬佩这种有才华的怪人，不会因为他的那些小小的搞怪就感到被冒犯。\r\n这时扎克伯格冷笑了一声。\r\n“我发现，你们的反应并没有我想象的那样好啊，”扎克伯格拼命忍住一脸的坏笑而假装严肃地说，“因为你们竟然现在还没有发现它的真面貌！”\r\nSam心头一紧，“真面貌？什么真面貌？”然后带着疑问的眼神看着经验丰富、见多识广的Andy，但他也只能耸耸肩表示毫不知情。\r\n扎克伯格接着说：“好吧，那我给一个提示——请你们看看，这张卡片的侧面是不是有一条切缝？”\r\n有些反应快的人立刻就叫了出来，“噢！噢！”\r\n这时人们发现，在自己手中的卡片，其实是可以展开的，就像展开一张叠过的纸一样。\r\nSam得意的看着手中2张卡片大小的屏幕，然后看看旁边Andy，惊讶的发现Andy手中的卡片竟然变成了一张报纸那么大！\r\n原来，这款iphone card全部展开时是16张信用卡大小。它像报纸一样薄，可以按照自己的需要进行折叠，最小可以折叠到1张信用卡大小，厚度也差不多。\r\n此时Sam与其他参会的人们一样，惊讶之余敬佩之心油然而生。Sam、Andy与其他记者，甚至都忘记了自己记录、拍摄的任务。\r\n扎克伯格满意的笑了起来，“好吧，说实话，其实它不叫iphone card，抱歉我对大家开了个玩笑。它正式的名字是ipaperⅠ。你可以把它看成是一个电脑，也可以看成是一个手机，当然它看起来更像是一张报纸。”\r\n只见他把ipaper小心的对折好，插到钱包的一个卡槽里，最后把钱包塞进裤兜。\r\n台下掌声雷动，记者们纷纷用专业相机记录下了扎克伯格这经典的一系列动作。\r\nSam有预感，这一连串具有划时代意义的动作将会被载入科技史册。就像十几年前，乔布斯在新品发布会上从信封里拿出一台笔记本电脑的那个瞬间一样，将被人们永远地记住。\r\n\r\n扎克伯格接着说：“那么下面，我将会请我的助手来给大家讲解一下ipaper的使用方法。在那之后我希望你们还没走，因为我想讲讲它的一个秘密。谢谢！”\r\n助手走上了台。与扎克伯格的风格截然不同，他的助手着装更加正式，更像是一个专业人士。他捧着一台展开的ipaper，借助身后的大屏幕，从它的硬件配置，到运作原理，再到基本操作，逐一地进行了讲解。\r\n人们了解到，这部ipaper的硬件配置并不高，但它不同于以往的任何一款手机或电脑，它采用的是“完全云技术”——也就是说，ipaper是一个超级显示屏幕，它的本身并没有任何存储数据的功能，而且只有很小的基础运算能力。\r\nipaper的一切功能都是通过互联网实现的。\r\n它的所有软件和数据等都存储在苹果公司分布于美国各地的大型服务器中。所有的运算工作、分析工作等等也都是由苹果公司布置在互联网上的超级计算机来负责。而这个超级显示屏幕需要做的就只有将用户的操作传送到苹果的计算机中，再通过互联网把计算机得到的结果显示出来而已。\r\n这种技术就是我们常常能听到的“云技术”。\r\n此前的云技术并不成熟，还多是单纯的“网络硬盘”形式或者如日历和阅读文字等小型软件，并没有做到完全的“云端”处理。\r\n而ipaper做到了“完全的云技术”，即“云技术”的最高阶段——将“一切”都放在网络上。\r\n正是因为这个特点，使得ipaper又轻又薄，功能强大，运行超快，并且有着对个人来说几乎无限制的存储空间。\r\n当人们了解到这一点时，已经打消了此前对扎克伯格的任何质疑，有些人互相交谈着，说这一次苹果肯定会打一场漂亮的翻身仗了。\r\n然而，在场的一些精通科学技术的人士，似乎隐隐的感到一些不同，似乎除了云技术外还隐藏着些什么更重要的内容是他们不知道的，也许这与扎克伯格所说的“秘密”有关系吧？\r\n\r\n第二节 秘密\r\n正当人们各自揣摩那个“秘密”到底是什么的时候，助手展示完了大屏幕上显示的最后一张幻灯片，然后说“好的，这款ipaper的基本介绍就先讲到这里。那么下面有请我们的CEO扎克伯格先生上台。”\r\n台下掌声响起，扎克伯格回到了台上。\r\n“那么，我来说点重要的事。你们在来之前也许都看到了我们在邀请函里的话——苹果将引领科技风暴。实际上，”扎克伯格一脸严肃地说，“你们目前为止所看到实在是微不足道的，而真正划时代的内容就隐藏在这款智能机中，刚才并没有演示给你们看。刚才我说它有一个大的秘密，就是指的它。所以，我想说的是，呃，那么，它，就，是——需要你们自己去找出来了！”\r\n“什么？”“这算什么？耍我们吗？”“混蛋！”\r\n人们各种的期望都破灭了，以为答案将会揭晓，结果却被耍了。参会的人终于忍不住了，甚至有人大骂各种脏话。\r\n“当然，可以给你们一个小提示——‘合作’。好的，谢谢！”扎克伯格说完这句话后，潇洒的转身就往台下走，根本不顾会场上闹哄哄的抗议声。\r\n这时他又好像意识到了些什么，返回了台上，对着话筒说：“噢抱歉，我忘了说，这款智能机的售价定为9998元。谢谢！”台下顿时又沸腾了，人们简直不相信自己的耳朵。\r\n扎克伯格一声不吭的走下台，脸上带着很满意的表情，似乎所有的一切都在他的计算中一样。然后从礼堂的侧门出去了。\r\n助手再次上台，说：“请大家安静一下。不好意思，扎克伯克先生希望我告诉大家，关于这款智能机的秘密，也就是它最与众不同的地方，找到正确答案并最先投稿到我们官方邮箱中的人，将会收到苹果公司特别赠送的一份豪华大礼。至于更具体的信息，我们将会在日后发布在官方网站上，请大家留意。那么，发布会到此结束，谢谢！”\r\n助手下台后，看到每个人的脸上都显示着沮丧。\r\n工作人员回收了每一部ipaper——当然，这么贵重的东西不可能免费的送给每个人。\r\n\r\n将摄影器材放置到汽车的后备箱里，Andy插进钥匙启动汽车，准备回公司准备新闻。\r\nSam正坐在副驾驶座位上垂头丧气，仿佛受到了很大的打击。“我真想不明白，扎克伯格怎么能这样做呢？这可是他上任后发布的第一个东西啊，难道他不怕这样耍人惹怒了大家吗？怎么说在场的也都是些有头有脸的人物嘛！为什么不能好好的说出来呢？还有为什么要定价那么贵呢？他不怕卖不出去吗？”\r\nAndy一声不吭的听Sam在那里抱怨，然后说：“好了Sam，如果不加上最后的那一段， 你认为这场发布会怎么样？”\r\nSam答道：“恩，如果不包括最后的那一节，可真是一场精妙绝伦、前所未有的发布会！我敢说那小子是个名副其实的天才！但是他后面的举动简直毁了它！”\r\nAndy说：“你错了，Sam，其实最后的那几句话，才是点睛之笔！那才是天才之作！”\r\n“怎么说？”\r\n“你动动脑子，你想想他为什么要这么做？”\r\n“呜，也许就像你说的，他就喜欢搞怪吧！”Sam说。\r\n“不是的。他不会做这种毫无意义的事，实际上那是一种策略。”\r\n\r\n回到报社后，两个人向主编详细的说明了整场发布会的经过。然后主编决定尽快将这个消息发布出去。\r\n忙完这项工作已经是深夜了，Sam回到家中，洗漱完毕后躺在床上，怎么也睡不着。\r\n他现在满脑袋想的都是那场发布会的事，整个过程太有趣了，跌宕起伏，仿佛刚刚亲身体验了一部奥斯卡冒险电影。他想起了发布会结束后，在汽车里Andy对他说的那些话。\r\n“那是扎克伯格的策略，”Andy把汽车钥匙拔下来，认真的对Sam说，“为什么他不直接告诉我们那个秘密，而是让我们自己去找呢？你好好想想。”\r\nSam毫不犹豫的说：“你说过的，他就是喜欢这样搞怪啊，那样让他很爽不是么！”\r\n“不对，你再好好想想。”\r\n“不对吗？那我再想想，”Sam低头想了一阵子，然后抬起头，恍然大悟般说，“啊！给大家一个悬念，让所有人都好奇的去找答案，这样就能扩大新产品的影响力和知名度了！”\r\nAndy微笑着说，“没错，不愧是常青藤的高材生。这下你又学到了一招吧！这就是利用了群众的好奇心理——这也是营销的技巧。”\r\nSam说：“那为什么他要定那么高的价格呢？一般的手机或平板电脑不会这么定价啊，而且现在市场上都在打低价牌，他这么做不是把客户都吓跑了吗？”\r\nAndy并没有马上回答，而是思考了一会儿，然后摇摇头，说：“这个我也很难确定，虽然市场上有靠提高价格来增强产品销量的例子，但是目前市场竞争这么激烈，三星更是推出超低价的Note x系列让这些厂商争的你死我活，拼命了要降低成本来打价格战。这个时候苹果做出了这样反常的举动，定出比同类产品高出几倍的价格，真是让人捉摸不透。”\r\nSam应声说，“是啊，到底怎么回事呢？”\r\nAndy说：“要说苹果愚蠢也不对，他们的营销策略一向都很厉害。也许这里还隐藏着什么故事呢？”\r\nSam说：“不会是和那个‘秘密’有关系吧？”\r\nAndy说：“恩，有道理，也许真的和那个‘秘密’有关系。”\r\n“那会是什么呢？”\r\n“他这个谜题太深奥了，我连一点想法都没有。”Andy回答道。\r\nSam头一次看到Andy被难住的情况，说：“呵呵，也许只有买一台来试试才能知道答案是什么了。”\r\nAndy说：“是啊，也只能这样了。嘿嘿，瞧，这不正是让你想买一台吗？”\r\nSam在床上辗转反侧，反复的想着那个“秘密”是什么。扎克伯格的提示是“合作”，什么合作？与谁合作？怎么也想不通。想着想着，就睡着了。\r\n\r\n第二天早上，Sam一到公司，就被总编叫到了办公室。他看到Andy也坐在那。\r\n总编说：“Sam，你才来公司没有多久。昨天是你参加的第一次新品发布会，说说你是怎么想的。”\r\nSam想了想，大致的说了一些当时惊讶的心理，然后说：“扎克伯格的这些行为看起来是搞怪，其实大有内容，”他说到这里眼神亮了起来，看着主编说，“我认为，如果我们能抢在别人前面把这些内容挖掘出来，那就是一个大新闻！”\r\n主编看着Sam因为激动而微微泛红的脸，沉默了一小会，然后点点头说：“恩，很好。那么这就作为你的第一个专题，我希望你能赶在别的媒体之前把它做出来，如果有什么问题可以问Andy。好了，你去准备准备吧。”\r\nSam走出了办公室，忍不住心情的激动，乐出了声——刚来几天就交给他这么大的任务，看来总编很看好他。一定要利用这个机会好好表现，如果能够做好它，就更能让主编刮目相看了。\r\n他没有回到自己的工位，而是走到了楼梯处的一个吸烟区——他需要吸一根烟好好想想。\r\n这时Andy走了过来，说：“恭喜你啊，Sam，一上来就有这么好的任务，看来主编很看好你！”\r\n“谢谢！”\r\n“这个机会很难得，做好了对你以后的晋升很有帮助，做不好以后也很难再有表现机会了。”Andy说。\r\n“恩知道了，谢谢你。”\r\n“好了我就说这些，有什么不懂的再来问我吧！”\r\nSam继续把剩下的半根烟抽完。\r\n回到座位上，他想，既然要买到一部ipaper才能够了解到这个秘密，他就要赶在别人前面买到一部ipaper。几天后，社会上已经沸沸扬扬的讨论ipaper了，当然人们更多感兴趣的是那个所谓的“秘密”到底是什么。当人们的好奇心到达极点时，苹果才宣布将在10月10日公开发售这款智能机。\r\n为了能够抢到ipaper，Sam决定10月9日的凌晨就去苹果零售店排队。当他披着一条薄毛毯来到零售店时，惊讶的发现这里竟然已经排了长长的队伍了！人们竟然有这么高的热情。\r\n看到这种情形，Sam没有直接走过去排队，而是先到旁边的24小时商店买了一些食物，再去排队。他回头时发现身后的人正在迅速增加，很快队伍已经看不到尾了。\r\n终于，在寒冷中坚持了近十个小后，他用公司批准的1万元顺利的在零售店里买到了一部ipaper。\r\n上午九点半左右，他满意的坐上了一辆出租车回到公司。在自己的座位上，拆开包装。\r\n这是一个类似扑克牌大小的精致白色纸盒子，上面没有太多的装饰，只有简单的苹果标志和IPAPERⅠ这几个字。打开盒子，里面放着扑克牌大小的ipaper智能机，一根白色的专用电子笔，还有一块常见的电子充电板。\r\n他取出了这部神奇的机器，激动的启动了它。即使已经在发布会上见识过一次，他看到这部机器启动还是感叹了一番。\r\n屏幕亮了以后，显示出一个界面，和传统的苹果手机或苹果电脑的桌面没有什么不同。上面整齐的摆列着一些传统的程序软件的图标，如ibook读书软件，ebay购物软件，safri网页浏览器，supernote笔记软件等，都是最常见的软件。\r\nSam心里想，这没有什么不同嘛，只不过是硬件变了而已，操作并没有什么太大的变化吧！毕竟扎克伯格不可能在短短的十个月里就造出一部里里外外全都不同的东西。\r\n他看到界面最下方，有一个黄色感叹号的图标，标志下写着“激活向导”。\r\nSam点击这个图标，然后界面上弹出了一个提示，写着“此激活向导将用最简单的步骤将您的ipaper变成一部超级机器，确认请点击下一步。”\r\n超级机器？Sam怀着强烈的好奇点击了下一步，界面上弹出了一个输入框，要求他输入自己的社保卡号码。\r\nSam输入了自己的社保卡号码，然后点击确认。\r\n不到1秒钟，界面上就弹出了一个画面，显示：“您好，Sam　Winchester先生。您的ipaperⅠ已经激活成功！谢谢！”然后画面就自动关闭了，桌面上的黄色感叹号图标也随即消失了。\r\nSam正在纳闷到底怎么回事，行政部的同事走到他身旁，说：“Sam，该开会了，记得带上纸笔。”\r\n编辑部每天早上十点钟都会开一个例行会议，大致上就是汇报当前的工作进度并进行之后的安排，是个很枯燥的会议。\r\nSam拿起笔和本子正要站起来，突然灵机一动——他决定今天的例会不带纸笔 ，而是试试用新买的ipaper来做会议记录。\r\n走到会议室，Sam坐下来，把这部ipaper展开到4张扑克牌的大小，拿出了电子笔，准备在这部智能机器上做会议记录，体验一下它的操作到底怎么样。\r\n主编依次询问了几个新闻专题的进展情况：\r\n美国教育专题，主要是针对当前美国教育的转型和接收亚洲大量留学生问题的调查。专题组长表示，由于工作量很大，又有人员突然病倒了，所以整理数据、调查、采访等都有可能赶不上进度。\r\n中国经济体制改革的专题，是针对中国近期宣布要进行大幅度的产业结构和相关经济体制的改革而进行的分析报道。组长表示，因为中国相关专家的信服力低下，美国又很难找到对中国这次经济有研究的专家，所以很难做出客观准确的报道。\r\n欧元区实体经济专题，由于欧元区国家经济危机不断，而他们意识到靠金融是解决不了他们的问题的，所以决定要从各成员国的实体经济下手，解决问题的根本。但是组长表示，由于这个问题已经积存已久，相关评论和分析数据太多，工作量庞大。\r\n最后是苹果公司新产品的专题组，由新人Sam任组长，Andy负责监督和协助。\r\nAndy代表这个调查组发表当前进展后，主编简短的分别安排了些事项。\r\n\r\nSam握着电子笔在supernote笔记软件上，依次记录了主编的所有安排。\r\n因为打开软件时选择的是“会议记录”，所以在Sam写字的同时，软件自动的录制了语音记录。\r\n软件对Sam飞快的书写记录识别率非常高，几乎每个歪七扭八的字母都能识别出来。这让他很满意。\r\n会议结束后，Sam点击软件右上方的保存键。\r\n这时，界面上弹出了一个窗口，显示“您好，Sam　Winchester先生，会议记录保存成功。由于您已经注册为超级用户，请问您希望体验苹果公司为您提供的智能分析功能吗？确认请点击下一步。”\r\n智能分析？\r\nSam呆呆地看着这几个字，大脑似乎一片空白——只是一个普通的会议记录罢了，这有什么分析可言呢？这时Andy走到他旁边，说：“Sam，会都开完了，你怎么还不走？”\r\n\r\n第三节 一篇报告\r\nSam回到自己的座位上。怀着强烈的好奇点击了界面上的下一步。他好像是一个在凡尔纳笔下初到神秘岛的探险者，他所见到的一切都会引起极大的好奇，而他要做的正是跟着那好奇心，一路走下去。\r\n过了2、3秒钟，界面变成了一篇类似报告的东西。为了看得更清楚，Sam把ipaper展开到最大——也就是16张扑克牌的像报纸一样的大小。他看到这篇报告后，睁大了眼睛——\r\n\r\n会议记录 智能分析报告\r\n2019年10月10日 上午10:43\r\n所在位置：美国 纽约市 第六大道 洛克菲勒中心 时代&生活大厦\r\n\r\n记录1：“美国教育专题组的进度，他们说目前已经采访了美国教育部长，和哈佛、耶鲁等大学的校长关于美国教育改革的意见，主编说下一步再采访一些主流的教育专家”\r\n建议结果：\r\n①\t我们分析认为您所提到的[美国教育]是泛指“美国教育制度、状况等”（如果不对请点击这里）\r\n②\t我们为您找到的[美国教育]相关的新闻专题有：\r\n《时代》往年关于[美国教育]的报道，（报道原文请点击这里显示）\r\n《华尔街日报》关于[美国教育]的深度专题报道，（报道原文请点击这里显示）\r\n亚洲媒体关于[美国教育]的报道，（报道原文请点击这里显示）\r\n③\t您的记录中提到了[美国教育部长]，我们为您找到的关于美国教育部长的信息包括：现任部长名称，简历，相关新闻报道等，（查看详细信息请点击这里）\r\n④\t您的记录中提到了[哈佛、耶鲁大学校长]，我们为您找到的关于哈佛校长、耶鲁校长的信息包括：哈佛信息，哈佛校长简历，哈佛校长著作，耶鲁信息，耶鲁校长简历，耶鲁校长著作等，（查看详细信息请点击这里）\r\n⑤\t您的记录中提到了[教育专家]，我们为您找到的教育专家有：\r\n美国教育专家：（点击这里显示），以及相关著作：（点击这里显示）\r\n其他国家教育专家：（点击这里显示）\r\n离您的位置最近的教育专家：（点击这里显示）\r\n\r\n记录2：“中国经济体制改革，主编说这个专题非常重要，这次体制改革如果成功，将对美国甚至全世界有非常大的影响。主编还说我们一定要抢在别的媒体之前对这个专题进行深刻的分析报道。目前专题组已经采访了一些美国经济专家以及中国的经济学者，主编要求下一步还要联系中国的相关高层人物，同时再联系些专门做中国经营环境分析的咨询公司，看看能不能要到一些数据。”\r\n建议结果：\r\n①\t我们认为您所提到的[中国经济体制改革]，是指的离当前时间最近的“2019年中国经济体制的改革”相关的信息。（如果不对请点击这里）\r\n②\t您的记录中提到[对美国甚至全世界有非常大的影响]，根据语义分析，我们认为您所指的是“2019年中国经济体制改革相关的影响”，以下是我们为您找到的与这些影响相关的报道：（点击这里显示）\r\n③\t您的记录中提到了[美国经济专家]，我们为您找到的美国经济专家以及相关著作有：（点击这里显示）\r\n④\t您的记录中提到了[中国经济学者]，我们为您找到的中国经济学者以及相关著作有：（点击这里显示）\r\n⑤\t您的记录中提到了[中国相关的高层]，根据语义分析，我们认为您指的是“中国关于经济体制改革的高层领导”，以下是我们为您找到的人：（点击这里显示）\r\n⑥\t您的记录中提到了[中国经营环境分析的咨询公司]，我们为您找到的公司及其信息：（点击这里显示）\r\n\r\n记录3：“欧元区实体经济问题，专题刚刚开始做，只是采访了一些证券分析师，对欧元区的实体经济问题有了初步了解。主编要求下一步还要采访欧元区各大银行的高层，最好把欧元区各国的意见都采集来。”\r\n建议结果：\r\n①\t您的记录中提到了[欧元区实体经济问题]，我们认为您指的是离当前时间最近的“2019年欧元区关于实体经济的问题”，我们为您找到了欧元区相关解释以及欧元区实体经济相关报道，（点击这里显示）\r\n②\t您的记录中提到了[证券分析师]，我们为您找到的证券分析师有：（点击这里显示）\r\n③\t您的记录中提到了[欧元区各大银行的高层]，我们认为您指的是“欧元区的银行的高层领导”，我们为您找到的相关领导有：（点击这里显示）\r\n④\t您的记录中提到了[欧元区各国的意见]，根据语义分析，我们认为您指的是“与2019年欧元区实体经济问题有关的欧元区各国相关的意见”，我们为您找到的信息有，（点击这里显示）\r\n\r\n记录4：“苹果新产品，主编夸我是个很有勇气很有潜力的小伙子，嘿嘿！主编说，一定要尽快挖掘苹果新产品的秘密，并且努力深度挖掘这个产品背后的故事，他说以他的直觉，这个产品不一般，也许真的要掀起一场风暴。最重要的是要快，而且要有深度，要做到别的媒体都做不到的，最好是独家新闻。”\r\n建议结果：\r\n①\t您的记录中提到了[苹果新产品]，我们认为您指的是离当前时间最近的“2019年苹果公司发布的ipaperⅠ智能机”，我们为您找到了它的介绍以及相关报道，（点击这里显示）\r\n②\t您的记录中提到了[苹果新产品的秘密]，我们为您找到了相关的报道以及互联网上所有网站上相关的讨论，（点击这里显示）\r\n\r\n报告看到这里，Sam已经目瞪口呆，一篇及其简单而且潦草的会议记录，竟然能被一个机器分析到这种地步。信息量极大而且都是非常相关的信息，没有一点多余的内容。\r\n这样的一篇智能报告，加上那些链接，就可以马上解决例会上各个专题组的问题了，至少能给大家减轻不少的工作负担。\r\n如果不是自己亲眼所见，他会以为这是哪个专业的分析公司所提供的价值上千的专业报告呢！\r\n在阅读的过程中，Sam不断的问自己：“它是怎么做到的？它是怎么做到的？”\r\n直到最后，他问自己都问到烦躁了，以至于他相信其实是有一个专业的分析师坐在电脑的另一端，在一个字一个字的敲击键盘，然后才把这篇详尽的分析报告提供给他的。\r\n但是Sam摇了摇头，他知道，从自己点击确定到报告出来，前后一共不过2、3秒钟而已，这是人类不可能做到的。\r\n他的大脑又变得一片空白，因为已经不知道自己该想些什么，该问些什么，只是觉得这一切都和自己所经历的时代太过于不同了。\r\n仿佛像电影中一样坐了时空机器去了未来的世界，面对未来人的生活而不知所措。\r\n他开始漫无目的的来回翻动这篇分析报告，看到每句话最后的那个“点击这里查看详细内容”，他就随便挑了一个点了一下。\r\n但就是这一下，让他回过神来了。\r\nSam点击的是关于“哈佛大学校长”的详细内容，这时界面上显示“您好，Sam　Winchester先生。您现在正在请求查看[哈佛大学校长]的简历、著作等相关内容，下载这些信息需要付1元。确定请点击下一步。如需帮助请点击文字上方的问号。”\r\n付费？\r\nSam回过神来就是因为这个词。\r\n原来这一切并没有那么简单，苹果公司提供的这种“超级服务”自然不能是完全免费的，毕竟那样的分析报告即使在市场上去卖也是值不少钱的。\r\n自己怎么没有想到这点呢？\r\nSam并没有直接点击下一步，而是先点击了上面的问号，看看它对此有什么样的解释。\r\n这时，界面上开始播放一段视频。\r\n视频在短暂的显示了苹果的标志后，出现一位漂亮的女人。然后她开始说话了：“您好，尊敬的ipaper客户，我是苹果公司的Lily，专门为您解决与这部智能机器相关的问题。根据使用记录，这是您第一次使用ipaper为您提供的超级服务，其中涉及到了智能分析以及付费下载等功能。下面我将为您进行简单的介绍。”\r\nLily接着说：“ipaper是一部划时代的产品，它为您提供了非凡的使用方式以及操作体验。在这里您将体验到功能强大而易于操作的特性。您当前所使用的supernote笔记软件，与目前市场上所有的笔记软件都不同。它不但拥有强大的记录功能，同时还具有智能分析的功能。\r\n“智能分析功能是由苹果公司集合众多语义分析专家、互联网技术专家以及众多的数据提供商一起为您提供的超级功能，它能够为您带来生活、工作上极大的便利。\r\n“同时为了保证这个功能的持续运行，您需要知道的是，它需要很大的成本。因此您的每一次使用都需要付出相应的费用。然而基于众多的考虑，苹果公司决定将它的使用价格降到所有人都能接受的地步。\r\n“在每次将要付费的时候，您都会看到相应的费用是多少而自愿选择是否支付。为了使您有一个大概的了解，以下将向您展示常用信息类型的收费。”\r\n画面中出现了一个表格，Sam看到表格中详细的列举了各种类型信息的收费标准，大多数付费信息都是以这个标准来定价的。比如书籍下载，0.1元10元；杂志下载，0.1元3元；新闻报道，10份以内不收费，超过10份的每10份收0.1元；互联网已有信息，免费。\r\nSam不禁感叹——“呵，扎克伯格已经做到这种地步了！他竟然已经做到这么详细的地步了！”\r\n然后他点击表格下面的“我已经阅读完了”。\r\n这时Lily又出现在了画面中。\r\n“我想您从上面的表格中已经了解到——使用我们提供的付费信息，并不会给您带来经济上的困扰。同时我将提醒您注意到另一个重要的问题就是——您的付费过程将是最简单而最安全的，”Lily接着说，“与传统的网络付费不同，为了使您更好的享受使用过程，苹果公司创造了一种非常简便的付费方式，无需每次付费都到网络银行输入密码、多重确认，您甚至可以不用做任何操作就完成了付费。”\r\nSam心里想：不需要密码就直接付款？那岂不是太不安全了？如果我的机器被别人使用了怎么办，那我的账户安全谁来保障呢？\r\nLily继续说：“但是您不用担心——虽然在操作过程中无需任何安全确认就可以付款，但是在后台我们已经做到了最安全的验证方式。\r\n“我们默认的验证方式是这样的，当然您可以根据自己需要的进行调整：款项低于1元的，可以直接付款，这将极大的方便您的操作，因为小额的付款将在使用中经常出现，如果每次都输入密码会很浪费时间；款项低于一百元的，需要输入银行密码；款项低于一千元的，在输入密码的同时需要回答您在网络银行预设的问题，只有回答正确了才能付款；款项低于一万元的，需要您输入密码、回答问题以及回复发到您手机上的验证短信中的验证码；款项高于一万元的，将启动最高验证模式，需要您在智能机上验证指纹、视网膜和声音。\r\n“当然，无论在哪种模式下，智能机都将拍摄使用者的头像，与您注册的头像进行对比，一旦对比结果不同，那么将对您进行电话确认。”\r\n听到这里，Sam对付费问题的疑虑已经荡然无存了——他仍然相信自己是在未来世界里，而那个世界的网络付费是那样的安全和方便。\r\n最后Lily说：“好的，关于supernote的智能分析与付费问题，已经向您解释完毕了，希望您在我们努力创造的新世界里拥有一个愉快的旅途，谢谢！”\r\n视频自动消失，并回到了分析报告的界面。\r\n这时Sam感到，就像在这一路的探险的中途走到了其中的一个休息站，可以暂时歇一歇，缓一缓，让大脑消化一下这从一开始就让人惊讶到现在的每一件细小而又神奇的每一样事物。然而他知道，在后面等待他的也许还有更多的惊喜。\r\n他看着那篇报告发了一会儿的呆，然后站起来，走到楼层的吸烟区，点上一根烟，看着窗外的天空吐出一团又一团的烟雾。\r\n这时Andy走了过来，也点上一根烟，说：“你怎么了？我看你的表情不太对啊。”\r\n“Andy，我想，扎克伯格真是一个天才！”Sam说。\r\n“看来你是发现了些什么吧？”\r\n“没错，andy，他简直是个天才！他也许真的创造了一个新世界，而我刚刚却只看到了这个世界的一角！”Sam激动的说。\r\n“那么你之前的判断是对的，扎克伯格这次发布的产品大有内容。加油吧Sam，一定要挖掘出它的故事，抓住它的核心，要记住，你是一个记者，而且是《时代》的记者！”\r\n“是的，谢谢你andy。”\r\n“那么，那个秘密你已经知道了吗？”\r\n“秘密，我还没开始…等等！”Sam似乎想到了些什么，“谢谢你andy！我好像知道些什么了！谢谢你！”\r\nSam赶忙把烟掐灭，然后一路小跑回自己的座位。再次拿起了那部神奇的机器。\r\n他关闭了分析报告，然后打开几个的程序软件，左点点右划划，同时还用笔写着些什么，偶尔还会连续打好几个电话。\r\n一直忙到中午休息的时候。旁边的同事催他去吃饭，Sam应道：“你先去吧，我还有好多事情要做，先不吃了！”同事无奈的自己去吃饭了。\r\n\r\n第四节 神秘礼品\r\n第二天，也就是周五早上的九点钟，苹果公司的官方网站上出现了一篇公告，瞬间被各大网站和媒体争相转载，网络上又掀起了一阵风波。\r\n公告的内容大致是：苹果公司已经得到了第一个回答出ipaper“秘密”的人。那个人的名字是Sam Winchester。\r\n为了奖励他，公司决定赠送他一个神秘礼品，并给他一个和苹果公司CEO扎克伯格共进午餐的机会。至于答案的具体内容以及神秘礼品是什么，都将在Sam Winchester领取奖品之后再公布。\r\n网络上人人都在猜测那个秘密的答案是什么，并且争先恐后的公布自己的解答。有的人猜ipaper最与众不同的地方就是它采用了基于云技术的系统，有的人猜ipaper能获得个人的信息，还有的人猜ipaper实行了网络实名制，甚至有人站出来说自己通过一些渠道获得了ipaper的内幕消息——它是美国中情局参与的能监控所有用户的智能机器。\r\n就像每年一届的奥斯卡开幕前夕，所有人都在猜测奖杯的得主是谁一样。\r\n受到网络热潮以及极大的好奇心的影响，苹果专卖店的销售比之前更加火热了，门口排的队伍也越来越长。有些地区甚至派出了警察队伍到专卖店的门口维护治安，还有一些交警来疏散附近拥堵的交通。\r\n不得不说，苹果公司的这一系列举动，引起了全民的热潮。\r\n而苹果似乎又什么都没做——他们没有在电视上、在网络上插播一条广告，没有任何宣传，甚至连产品的介绍都没有。毫无疑问的，这也是扎克伯格的一个非凡营销策略。\r\n也许用不了多久，学MBA的学生们就可以在自己的课本上看到这个经典的案例分析了。\r\n早上十点钟，位于纽约的《时代》的办公大楼中，主编正在开每天的例会。\r\n例会的焦点就集中在Sam将与扎克伯格共进午餐的这个主题上。\r\n在一番夸奖后，主编严肃的对Sam说，“Sam，这是一个非常重要的机会。就像你所知道的那样，我们也了解到了苹果的这部新产品确实是一部神奇的机器，这是跨时代的新闻，是将载入科技产品历史的事件，就像乔布斯发布iphone一样，就像扎克伯格的Facebook上线一样，都是引领时代的事件。所以你需要知道，这次共进午餐的机会很重要，”主编接着说，“你要抓住机会问他一些问题，最好是能获得独家采访的权利。当然，关于这些问题你的经验还少，在这方面Andy会给你很大帮助的。”\r\n“好的，主编，谢谢您对我的信任。我一定会努力利用好这次机会的”Sam充满信心的答道。\r\n“好吧，不要浪费时间，你和Andy去准备吧。”主编说。\r\n于是Sam和andy离开了会议室，主编则继续给其他专题组安排任务。\r\n\r\nSam在Andy的指导下经过了努力的准备，终于到了10月14日，也就是周一。\r\nSam如约到达了位于加州库珀蒂诺市的苹果总部。现场已经聚集了很多主流报刊杂志的记者，而Andy作为《时代》的记者也出现在了新闻发布会台下的坐席上。\r\n在这场小型的新闻发布会上，Sam成了主角。\r\n工作人员在简短的说了一些开场词后，高调的邀请一位漂亮的模特端着一个白色印有苹果标志的像钻戒盒子一样的东西来到了Sam面前，Sam恭敬的接过来。\r\n下面的记者这时紧忙唰唰唰的拍照。主持人邀请Sam拆开包装，看看这个神秘的礼品到底是什么。\r\nSam小心翼翼的拆开了包装，展现在眼前的东西又使他吃了一惊——那，是一块手表！\r\n这时主持人微笑着告诉大家，这不是一块普通的手表，而是一个配合ipaper使用的多功能辅助机器。\r\n大屏幕上开始播放这部iwatch的宣传片。\r\n大家了解到，由于ipaper的一切使用都是基于网络的，甚至可以说是完全基于美国的全境无线网络，而且必须依赖很高的网速才能够维持其运作。然而，一旦遇到偏远地区网速很慢或者没有网络，这部智能机就相当于一个废物。为了弥补这个问题，苹果公司开发了相应的硬件补充——iwatch。\r\niwatch外形是一个手表，内部却有极其精密的16.0GHZ超高速cpu运算器，32T容量超大额存储硬盘，无线网络发射器/接收器，数据传输插口，以及一个袖珍的投影机。\r\n将iwatch和ipaper进行无线网配对连接后，ipaper将如虎添翼，不但能够极大的加快运转速度，还能够在没有互联网的情况下使用一些常用软件，甚至能够将ipaper的内容投影至任何宽阔的墙面上观看。值得一说的是，iwatch的外形使得携带便捷，可以将它放在包里随身携带着——它能与附近一百米的ipaper进行连接使用。\r\niwatch的出现，使发布会现场再度沸腾起来。\r\n毫无疑问，无论是Sam体验到的软件方面的智能，还是ipaper、iwatch的硬件方面的尖端， 扎克伯格都将当时科技水平所允许的的都做到了极致——在场的所有人都无不感叹，扎克伯格已经领先了时代太多！\r\n主持人继续说明，iwatch将在随后公开发售，售价仅为1000元。\r\nSam想，这样的价格也许是为了应对三星等公司的价格战，毕竟iwatch在性能上是很容易被赶超的，它的竞争力远没有ipaper高，所以定这样的市场平均价格是一个平稳的策略。\r\n而此时在台下的记者Andy想的是，这次的新闻发布会原来亦是一个营销策略：看似只是一个“解谜”的小型新闻发布会，实则是承上启下来引出新产品的发布，这一步一步连接得毫无缝隙 ，真是令人敬佩。\r\n接下来到了记者提问环节。\r\n在回答了ipaper如何对个人信息保密、如何与iwatch配合使用等常见的问题后，有个记者站起来问大声的说：“现在，该公布那个‘秘密’的答案了吧！”\r\n台下又轰然乱成一片，大家都在喊“是的”“该公开了”“快说出来吧”“我们等的够久了”等等。\r\n的确，这些天来，几乎所有人都在猜测那个谜题，很多人都不惜花费大笔的钱去买下这台神奇的机器来破解这个谜题。\r\n主持人说：“好的，不过不是现在。我们会在晚上在官方网站上公布谜题的，这样对全球关注我们信息的人都很公平。谢谢。”\r\n然后主持人有礼貌的走下了台，并邀请Sam去苹果总部的员工餐厅与扎克伯格共进午餐。\r\nSam从记者们的长枪短炮中脱离出来，与主持人来到了餐厅。\r\n主持人领着他来到了餐厅的一个角落，说：“这是扎克伯格先生经常做的位置，请您在这里稍等一下，他马上就过来。”\r\n主持人走后不久，仍是穿着一身休闲服装的扎克伯格过来了，和Sam上一次在新品发布会时见到他一样——他就像在大学校园的一个学生，正悠闲的到学校食堂吃饭。\r\n扎克伯格微笑着的和Sam握了握手，然后直截了当地说：“嘿，我看了你发来的邮件，你的反应真的很快，而且说明很详尽，远远的超出了我的预期，”扎克伯格一边端详着这个年轻的记者一边说，“说说吧，你是怎么做到的？”\r\n“嘿嘿，呃，运气吧，运气！”Sam脸红了起来，这对一个大男孩来说也是很少见的。\r\n他很紧张，不知道该说什么，毕竟对面坐的是那个传奇的人物扎克伯格。\r\n扎克伯格看到他这样笑了笑，说：“不要紧张嘛，随便一点。你看，就像我这样，没什么大不了的，我们只是吃个饭而已。”\r\n说到这里，扎克伯格叫来服务员，点了两份餐厅最拿手的菜，然后接着说，“快说说吧，是怎么发现的？我很好奇。”\r\n看到扎克伯格这么平易近人，而且年龄看起来也相差不远，就像两个同龄的哥们一样，Sam不那么紧张了。\r\n他说：“那好吧，事情是这样的……”\r\n在他解释自己是如何点击各个软件的功能、打电话到相关的公司咨询、上网查询的时候，让我们来看一看他发的那封邮件吧：\r\n\r\n收件人：Mark_Elliot_Zuckerberg@apple.com\r\n发件人：Sam_Winchester@time.com\r\n标题：关于ipaper发布会上谜题的解答\r\n正文：\r\n尊敬的苹果公司CEO 扎克伯格先生 你好，\r\n我是《时代》的实习记者Sam　Winchester。我有幸在10月1日您举办的新品发布会上见到了您，并且见识到了您带领团队开发出来的ipaper——那部神奇的机器。为了体验这部您所说的划时代的产品，我在它公开发售的第一天就买到了手中。\r\n在体验了您创造的一些神奇的功能后，感到自己仿佛经历了一场伟大的冒险。然而我感到那只是我所看到的冰山一角——无论是它的硬件技术还是一些智能软件都只是它的一小部分而已。我发现到，这部机器的核心内容才是它划时代的特征，同时，它也正是您所说的那个“秘密”。\r\n经过不断的验证和尝试，我发现了这秘密，这也令我大吃一惊——那可真是个好东西——那个秘密就是，您所尝试创造的并不是一个一个的具体软件或硬件，而是创造一个能完美的将各种功能、各种企业、甚至各种行业融合在一起的平台！这个平台正是以我们最普通的用户的需求为最高追求的。要创造这样一个平台，就需要每一个具体软件的制作者的紧密合作——这就是您所提示的那个词“合作”。\r\n我不知道这样的回答能不能够使您满意。下面我将列出我对每款软件的想法以及猜测，希望能够对我刚刚所作出的解释有所帮助。\r\n①\t注册激活。在最开始将自己注册为超级用户的时候，我只输入了一个社保卡号码就完成了全部的注册。（这令我非常吃惊）我想到，您也许是通过我的社保卡号码与民政局的数据进行了连接，获取了我的名称、网络银行账号等相关的信息，而省得我再重复的输入所有的这些信息。不得不说，这太棒了！\r\n②\tSupernote智能分析。分析报告非常贴切我的需要，经过一些简单的调查和对比，我发现报告中为我提供的书籍都是由亚马逊公司提供的，词语解释都是由维基百科网站提供的，而下载的一些数据最下方都标记着谷歌数据的字样，所以我认为您是与这些公司在合作的——大家一起合作提供了这样精确的数据。\r\n③\t付费方式。很明显的，与银行的对接是这种奇妙的付费方式必不可少的。我认为您已经与一些银行（其中包括我的账户所在的银行）进行了深度合作，才能够得到这种既安全又方便的付费方式。\r\n④\t广告。在我进行一些相关信息浏览时，界面的空白处总会出现一些相关的——很多都是我需要的产品的广告，并附带有相应的购买链接等。经过调查，我发现这些广告都是由美国LMC旗下的传媒公司提供的。所以我认为您也与这家传媒公司进行了深度合作，在为我提供一些也许我会想要的产品的同时，也为众多广告公司做出了贡献。\r\n总之，您做到了其他任何竞争对手都没有做到的东西——合作 ——正是您在新品发布会上所说的那个关键词。就像您将最初的社交网站Facebook发展成一个集合人际交往、游戏、软件工具、新闻发布等合作平台一样。\r\n我和您一样认为，在这个时代真正强大的不是专注于自己的一隅，而是能够搭建一个舞台，允许任何人在上面展示自己，跳出一段段优美的舞蹈。也许这才是您所想要向世人表达的吧！\r\n希望我的答复能够令您满意，\r\n您忠诚的，\r\nSam　Winchester\r\n2019年10月10日 13:00\r\n\r\n扎克伯格眼中泛着光芒看着眼前的这个小伙子，这让他想到自己年轻的时候，心里感叹：年轻真好啊。\r\nSam解释完自己是怎样一步一步的发现这个秘密，并领先于别人将邮件发送到苹果公司的官方邮箱后，扎克伯格说：“非常不错，小伙子，我很喜欢你。”\r\n“夸奖了，扎克伯格先生。我真的只是幸运而已。”\r\n然后Sam想到自己并不是单纯的一个用户，而更重要的是作为一个记者来到这里的。\r\n于是他壮了壮胆子，认为时机差不多了，打算切入主题。\r\n“扎克伯格先生，我非常好奇，想问一下您是怎么想到要开发这么一部智能机器的呢？”Sam问道。\r\n扎克伯格回答：“这个嘛，是因为一时的灵感才想到要做的。说实话，这可真费了我不少的脑力呢。有一段时间我甚至长出了几根白头发呢。”\r\n“那么，”Sam似乎恢复了记者的姿态问，“那是个什么样的灵感呢？”\r\n扎克伯格并没有立刻回答，想了想然后说：“不好意思，这个我不方便告诉你。”\r\n“哦这样啊。那换一个问题，您真的能够在上任苹果公司ceo后的短短十个月之内就开发出这样一部划时代的机器吗？——那简直难以置信。还是说您来到苹果之前就有这样的打算了呢？”Sam问。\r\n这个问题又使扎克伯格停顿了几秒钟，看来Sam的这几天与andy一起的努力准备并没有白费——都问到了重点。\r\n然后扎克伯格笑了笑，说：“嘿嘿，问题很尖锐嘛！你还真是一个记者，吃饭都不忘记要做采访！”\r\nSam有些失望，因为到此为止还没有任何收获。他想到，来都来了，机会难得，再努把力吧！\r\n于是他又问：“扎克伯格先生，是这样的，时代周刊绝定为这个的新产品做一次深度的报道，所以希望对您进行一次正式的采访，这个任务很荣幸地交给了我。您看可以吗？”\r\n扎克伯格没有回答，本想直接的回避的，但是看了看眼前的这个眼睛里充满着期待的年轻记者，似乎突然间想到了些什么，沉思了一会，然后抬起头来看着Sam，露出了一丝微笑。\r\nSam没有明白这个微笑是什么意思，然后扎克伯格说：“哈哈，小伙子，我很看好你。这样吧，我再给你出一个谜题，如果你可以解决的话，我就答应接受你们的采访，也许还能告诉你很多背后的故事，你看怎么样？”\r\n“真的吗？！好的好的！您请说！”Sam激动地说。\r\n“很简单，”扎克伯格说道，“你刚才问到我的灵感是什么，我只能告诉你一个词，其他的东西就需要你自己去想了。那个词就是……”\r\n“什么？”Sam迫不及待地问。\r\n“中国的读书运动。”扎克伯格答道。\r\n“中国，读书运动？”\r\n“哈哈，我的提示就到这了，”扎克伯格站了起来，和Sam握了握手说，“今天很高兴和你一起吃饭。希望我们还能有机会见面。”\r\nSam也站起来，说：“谢谢您，扎克伯格先生，我也很高兴见到您。我们一定还会再见的！”\r\n然后Sam就离开了苹果公司的总部。\r\n由于Andy还有事就没有等Sam，提前回去了。于是Sam自己坐了最近的一班到纽约的飞机。\r\n坐在飞机上，Sam的思想正如一只无头苍蝇，到处乱飞，他控制不住自己。也说不上是高兴或是难过，总之脑袋里胡乱一片。\r\n说起来，也许这更像是失望。因为他没有完成好他身为一名记者的任务——他没有从扎克伯格那里获得足够的消息，挖掘他背后的故事。\r\n但是扎克伯格告诉了Sam一条线索——“中国的读书运动”。\r\nSam本以为自己赢得胜利了，还没到机场就急不可耐地用手中的ipaper上网搜索这个关键词。\r\n可是令他失望的是，无论怎么搜，都搜不到一条相关的信息。\r\n这时他产生了一种逃避的情绪——他希望这架飞机永远不要停下来，直到他想好怎么向主编交代为止。\r\n他让思绪胡乱的飞了一会儿，然后心里对自己说：“不，我不能这样下去，事情还没有完，我要好好想一想，也许还有机会！”\r\n于是Sam从包里拿出了一个mp3播放器，是微软开发的Zune一代硬盘级播放器，可以存储大量的歌曲，拿在手里就像一块小砖块——已经停产了十几年。那是他最喜欢的播放器，因为操作简单，没有任何多余功能。他戴上耳机，打开这个硬盘级别的播放器，选到了一部安静的指弹吉他专辑，点击播放。然后他戴上眼罩，双手合十放在两腿间，紧靠着座椅——这是他要开始思考时的习惯动作。\r\n他仔细的回忆与扎克伯格的每句对话，扎克伯格的每个动作，以及刚才新闻发布会的每个细节。他反复的思考着，就像在黑暗的房间中摸索那根开灯的灯绳一样。\r\n他的思绪却反复的围绕着他们最后的那几句对话中：“因为受到一个灵感的启发” “这个我不方便告诉你” “短短的十个月就做出这样的产品” “受到中国读书运动的启发” “商业机密”。他反复的琢磨着这几句话。\r\n那个读书运动史怎样启发扎克伯格去做这么一部ipaper的呢？这之间一定有什么重要的关联，如果能够抓住这两者的关联关系，我肯定能做出一篇很有深度的专题报道！也许这个专题能够给我们的科技产业带来同样大的启发呢！\r\n所以，这个线索无论如何也要查到，不管是在网络上查还是找人问都一定要找到！\r\nSam继续想着，感觉那根开灯的绳子就在不远了。他摘下眼罩，看着窗外的云彩，玻璃上他能看到自己闪着光芒的眼睛。\r\n下了飞机后，他马不停蹄的回到自己的工作岗位上，甚至没有向Andy和主编汇报情况，就开始了行动。\r\n\r\n第五节 线索\r\nSam首先想到，可以问一些在中国的朋友，也许他们会知道的。\r\n于是他打开了1张卡片大小的ipaper，点击通讯录，打开搜索功能，搜索出了所有在中国地区的朋友。\r\n搜索结果出来，界面上清晰地显示着他的几个中国朋友的名称、电话、职位、年龄、婚姻状况等信息，Sam想，这些信息是从哪里来的？他不记得自己输入过这些信息。\r\n界面上，几个他认识的朋友旁边，还用线条连着另外几个不认识的人，下面显示着他们是朋友的朋友。\r\n但是Sam现在没有心情去探索这些新鲜而匪夷所思的功能了，他急于去求证那个问题。于是拨通了几个中国朋友的电话。\r\n他第一个选的是何威，是他以前去中国玩时认识的一个作家朋友，名称下面显示着“中国科幻小说作家”。他按下了拨打键，电话接通了，他简单地和对方寒暄了几句。\r\n然后问起对方，中国发生的读书运动是怎么回事？\r\n而对方的答案让Sam很失望——从来都没有听过，中国什么时候有读书运动？身为一个中国作者的他竟然没听过这个事情。\r\n挂断电话后，Sam试着拨通了第二个中国朋友的电话。这个人叫郭明明，下面显示着“中国某传媒公司负责人”，是他在一些广告工作上联系过的合作方。\r\n她也表示从来没有听过这个事情，Sam又追问了几句，她还是说没有印象。\r\n“到底是怎么回事？你真的没有听说过吗？我的一个采访对象说的这个事不像是假的啊。”Sam说。\r\n“不好意思，我真的没有听说过。如果说中国有什么读书运动，那也只可能发生在春秋战国时代，最起码这几十年来从来没发生过这个事件。”郭明明说。\r\nSam很失望，这是他抓住的唯一线索，竟然是一个莫须有的东西。\r\n听出了Sam的失望，出于礼貌，郭明明接着说：“没关系，我回去帮你问问我的其他朋友，看看有没有这回事，也许是有的而我不知道呢。”\r\n“好的，那谢谢你了。再见。”Sam说。\r\n挂断电话后，Sam还是没有放弃。\r\n他又打了个电话给一个在中国的一个咖啡馆时认识的那里的老板成禹，他也表示没听说过这么一回事。\r\nSam失望极了，他想，这一路下来，除了得到一块“超级手表”外，他身为一名记者几乎一无所获。\r\n当Andy过来询问他事情进展的怎么样时，Sam无奈的耸了耸肩，说：“对不起，Andy，我没有得到什么重要的信息。”\r\nAndy并没有责骂他，而是说：“没关系，Sam，这在我们记者是常有的事，并不是什么信息都那么容易让你得到的，再说这是你第一次做深度报道，”Andy把手按在Sam的肩膀上，接着说，“但是你要记住，你还有机会的，只要你不放弃。”\r\nSam回过头来看着Andy，说：“我还有机会吗？”\r\n“当然！你看，虽然主编要求你一定要尽快赶在别的媒体之前作出这个报道，但是经过我这些天的关注，现在他们还只是停留在对这部机器的浅薄的理解上，而你已经比所有媒体都更接近真相了。所以你只要专心做好，我相信你一定不比别人慢的。”Andy耐心的说。\r\n“是吗？真的，谢谢你Andy！我现在好多了，看来我还有好多工作没有尝试呢，这时候放弃未免太让人瞧不起了吧，谢谢你！”Sam高兴的说。\r\n\r\n接下来的几天里，Sam一直在使用ipaper里面的各种功能，他试图再次从这里找些线索。\r\n他先想起的是那天使用的通讯录功能，因为他记得那天在通讯录里搜索中国地区出来的联系人，下面都标记着很多他并不知道的信息，如婚姻状况和朋友关系等。于是他又看了看美国的联系人，先点击了Andy的信息。ipaper界面上立刻显示出了Andy的公司、职位、婚姻、毕业大学、从业经历等。\r\n这激起了Sam的好奇心——他从来没有输入过这些信息啊，而且他从来都不知道Andy是不是已经结了婚。难道苹果公司用黑客调查了他的所有朋友？不不，这不太可能。\r\nSam百思不得其解，于是还是去找了Andy求证。Andy看到这些信息后也非常惊讶，他在想莫非是自己的信息都被人泄露了？\r\nAndy拿过来ipaper，看着它想了许久。突然好像有些什么思路，然后点开了网页浏览器，输入了一个地址，点击确定。画面出来后，Andy开心的笑了。\r\nSam好奇的看着Andy问：“怎么？有眉目了？快说啊”\r\nAndy答道：“哈哈，原来是这样！那我就放心了！你看看吧。”说着把ipaper递给Sam。\r\nSam看到后也乐出了声：“哈哈，原来是这样啊！苹果只是把你在Facebook上的信息同步到我的通讯录里了，这样你再Facebook上发布的所有信息在这里也就可以看到了。当然你不想让别人看到的，删除就可以了。”\r\nAndy说：“呵呵，没错，看来我们又不经意被扎克伯格那个小子摆了一道呢，原本还以为是信息泄露呢！”\r\nSam好像一个刚刚破解了谜题的侦探一样，高兴地回到座位上。继续探索这个神奇的通讯录。他发现，通讯录里面还隐藏着另一个功能，叫“族谱”。\r\n点开“族谱后”，界面上显示出了密密麻麻的线条，好像是一颗大树。Sam展开ipaper到最大的状态，看到这原来不是一棵普通的树，而是Sam自己的家族树。每个枝条都代表他家族里的一个人。他清楚的看到父母的两根枝条相交成一根，然后下面出现了一根新的枝条，标记着“Sam Winchester”的字样。同样在这棵树上还显示着诸如他的祖父、外祖父、表哥、堂哥等家庭的联系。\r\n毫无疑问，这也可能是Facebook通过他庞大的人类信息库提供的。\r\n\r\n退出通讯录后，Sam打开了“游戏”字样的图标，画面出现让他眼前一亮——这里简直有成千上万的游戏啊！而且完全不需要以往好几个小时的下载、安装、调试等步骤，所有游戏都分门别类的摆放在页面上，直接点击开就可以玩！\r\n他看到了《使命召唤15》，这应该是《使命召唤》游戏系列今年刚推出的游戏。这是Sam最喜欢玩的游戏系列，他非常清楚这款游戏是不能在苹果系统上玩的，这是怎么回事呢？\r\nSam放弃了对游戏的探索，因为上班时间是不可以玩游戏的。\r\n然后他想到，这样找下去不行，必须要从扎克伯格给的提示“中国读书运动”这条线索入手。\r\n读书？\r\n于是Sam打开了ipaper的读书软件ilibrary。Sam记得以前的苹果的读书软件叫ibook或者ireader之类，这次变成了ilibrary，从名字上就感到了巨大的差异——书和图书馆的差异。\r\n打开软件后，报纸大小的ipaper上铺满了各类各式的书，下面都标记了价格，有的是3元，有的只有0.5元。他想起了之前在使用supernote笔记本时Lily说过的价格表。\r\n在界面的菜单里有一项写着“Sam Winchester想要读的书”。Sam点进去后，显示出了他想要购买和阅读的所有书。这次他的反应很快，知道了这是他以前在Librarything网站登记的读书信息。\r\nSam在ilibrary里并没有找到能够给出答案的东西，搜索结果依然显示为无此信息。\r\n接下来，他又打开了ebay网络购物的软件——他每次心情不好的时候就想在网上买点东西来发泄。\r\n这次他看中了一件98元的衬衫，于是点击购买，点击确定，整个购买过程就完成了。甚至没有任何其他的信息输入。经常进行网络购物的读者们会明白，通常要在网上购买一件东西，需要依次输入收货地址、收货人、联系电话，然后再向自己的银行账户提交划款请求，输入一系列密码和验证码，再回到购物网站点击确定，并等待发货信息等众多步骤。\r\n这样一步就完成购买，在当时是不太可能的。但是这时Sam已经感不到奇怪了，因为他已经接受ipaper是一部来自未来的机器了。\r\n由于这件衬衫价格是低于100元的，所以无需输入任何密码，这样的简便让他多少有了些安慰。\r\n当天晚上他就在家里收到了这件衬衫，据他所知那件衬衫是从美国南部很远的一个城市发过来的，他很惊讶——美国的物流什么时候这么发达了？\r\n一般经过装货、中途转移、分配、发货等步骤，怎么也要在一天半以上才能够送到。据他了解，十几年来无论物流行业怎么努力，都无法超过这个时间极限，而这件位于遥远南方的衬衫是怎样像同城快递一样的不到十个小时就送到了呢？莫非这也是扎克伯格的功劳吗？\r\n事实上，Sam还忽略了一个重要的细节——他可能是还没有从失望中缓解过来吧——他甚至没有输入送货地址——它是怎么知道我要货物送到公司还是送到家里呢？直到中午吃饭的时候向同事炫耀那件衬衫的快递速度的时候，他才想起这个重要的细节。\r\n于是他决定再做一次网络购物。这次他想要买一本关于物流方面的书。他展开ipaper，打开了一个叫“图书搜索引擎”的软件。\r\n软件的界面很简单，只有一个像谷歌主页上一样的大大的搜索框和搜索按钮，不同的是上方还多了醒目的一句话：“请输入您的问题，而不是书的名字。”\r\n不是输入名字？“这句话到底什么意思？”Sam想。\r\n“扎克伯格真是个怪人，为什么每个东西都和我的认知相抵触呢，”Sam心里发着牢骚，“难道我真是来自于过去的人吗？”然后他又再次点击了界面右上角的问号标志，也许这次Lily还能够帮他解决疑问。\r\n果然，界面上又开始播放一段视频，而画面中出现的正是那个漂亮的Lily。\r\n“您好，尊敬的ipaper用户。您正在使用的这项功能是苹果公司精心为您研制的超级图书搜索引擎。不同于您以往查找图书的过程，在这里您不需要输入某本书的名字，也不需要按照某本书的分类而逐个的去查看，您需要做的全部就是告诉我们您想要知道些什么，或者您需要解决的什么问题。将您的问题输入到界面上的搜索框中，系统就会为您自动的提供一切能够解答您的问题的书籍。没错，一切都是这么简单。谢谢。”\r\nLily又随着视频画面自动消失了。\r\nSam想，如果这是真的话，那可真是个好东西！读了这么多年的书，一直困扰我的就是怎么找到我所需要的书——我想要学习的知识太多了，但我却不知道那些知识在哪！就打比方说吧，我想知道怎么治疗失眠，那么我应该看什么书呢？搜索书名叫做《治疗失眠》吗？还是到医学分类的几千本书里去一本一本的找呢？上大学的时候，我的数学一直跟不上老师的进度，快到了考试的时候，我总是想着如果能有一本教我在十天之内学会微积分的辅导资料就好啦。可是那本叫《5天自学微积分》的好书，直到我的数学挂科之后才偶然在书店里发现。但那一切都晚了——如果这个图书搜索真的有那么神奇的话，将会解决我多少的问题啊！\r\n在Sam看完Lily的介绍视频之后，闪现在脑海里的就是那些一连串的“找书”之痛。\r\n然后他定了定神，在搜索框中输入了一句相当于魔法咒语般的句子：“我想找到关于物流的历史以及物流行业当前的状况。”点击搜索键，不到1秒钟，界面上就显示出了一个图书列表。\r\n列表上方写着一段话：“根据您的问题，我们为您找到的关于[物流]的历史以及[物流行业]的当前状况的书籍如下。”\r\nSam看到列表里出现了几十本书，每本书的名字旁边都有书籍的封面，名字的下面有描述物流的历史或现状出现在书籍的哪些章节里。比如第一本叫《一个箱子的旅途》，封面上画的是一个放在飞机上的快递盒子，下面简介中说这本书写的是快递行业的现状，包括优点和缺点的分析。第二本叫《我的十八份工作》，讲的是一个人在十八份工作中所经历的事，其中一份工作是快递员，深刻体会到了物流行业的一些状况，并产生了很多的感想。第三本叫《网络购物的发展历史》，其中有一章是专门描述跟随网络购物兴起的物流行业的发展历史。第四本叫《物流学》，系统的介绍了有关物流的发展、现状、运作系统等相关知识。\r\n看到第四本，Sam的脑海中再一次产生了很多疑问。\r\n他想，ipaper是怎么做到的？明明前三本书里没有一本的名字有“物流”两个字，甚至整本书都不能算在与“物流”相关的分类里。但是书里出现的东西确实是自己希望知道的啊。第四本《物流学》虽然毫无疑问能够解答他的问题，但是那样以“学”结尾的书籍一般都过于严谨而难懂，这对于身为非物流专业的他未免有点吃力了。反倒是第二本小说更能让他快速的了解到这个行业的东西，毕竟讲故事是最容易让人接受的。\r\n最后，Sam选择了那本《我的十八份工作》，电子书版本的是0.3元，纸质书版本的是15元。为了再次体验一下物流情况，Sam选择了纸质书的购买。\r\n像上次一样，购买过程及其简单——点击了确定以后，付费就已经成功了。然后Sam马上在ipaper提供的查询银行账户的功能里，看到银行账户已经减少了15元。\r\n下班后，Sam回到了自己的公寓。他想到这几天的经历，又想到在做新闻调查过程中的失落，感到有些疲惫。于是他换了身休闲的衣服，从公寓出来走到附近的一个酒吧，喝一杯啤酒轻松一下。\r\n这时是晚上8点钟，酒吧的门口的风铃铃铃的响了一下，走进来一个身穿联邦快递制服的人，他径直朝Sam走了过来。\r\n“您好，Sam　Winchester先生。这是您的快递，请签收。”那个快递员说。\r\nSam这时正在喝一口酒，因为太突然，他把酒都呛了出来，然后很狼狈的看着快递员，说“你确定这是我的快递吗？”\r\n“是的，Sam　Winchester先生。我们系统中有您在下午三点二十分的订单，而且还有您的地址和头像信息，不会错的。”快递员说。\r\nSam目瞪口呆的看着这个联邦快递公司的快递员，愣了几秒后，他接过对方手中的包裹和笔，在单子上签好名字后，快递拿着单子走出了酒吧。\r\nSam看着手中的这本书，然后闷了一口啤酒，自言自语的说：“好家伙，扎克伯格！你一定是嫌我今天受到的刺激还不够吧！”\r\n当Sam正在百思不得其解物流公司是怎样操作的时候，手机响了。\r\n他从牛仔裤兜里拿出卡片大小的ipaper，看到是那个中国的朋友郭明明打来的电话。\r\n“嗨Sam，你前几天让我给那些校长发的邮件，有人回复我了，不知道是不是你想要的那个？”\r\n原来，前几天Sam想到了一个主意，就又给这个中国朋友打了一个电话，拜托她帮忙给中国的一些校长和相关学术界的人发邮件，看看有没有什么线索。\r\n“喔，真的吗，”Sam兴奋地说，“太谢谢你了，郭明明。请赶快告诉我吧，我正等得着急呢！”\r\n“那是一个匿名的人给我回复的邮件。里面说到，也许你提到的‘中国读书运动’不是已经发生的事，而只是一个还处于理论阶段的概念。”郭明明说。\r\n“还没有发生的事？”\r\n“是的。邮件里还说，即使是这个理论，也没几个人知道。而他只是偶然间看到过这个论文，但是具体内容记不太清楚了，只记得个大概。”\r\n“好的，那太好了！那么快告诉我这篇论文讲的是什么吧，我有预感它一定是我想要的，嘿嘿！”Sam像个小孩子一样兴奋的说。\r\n“哦那好吧，先别高兴的太早。邮件里提到，论文的标题应该是《读书系统的革命》，里面主要是分析了图书相关的一整条产业链的情况，并研究了未来可能的趋势，然后作者设计了一套系统，打算利用互联网技术，重组整个图书产业的盈利链条，如果真的能付诸实践的话将会是一场大范围的读书运动，这场运动将…”\r\n“就是它！”Sam还没有等郭明明说完就打断了她，“肯定就是它，没错！那个，作者叫什么？”\r\n“这个，邮件里说不知道，能记住得也就是这么多了。”\r\n“那好吧，这样吧郭明明，”Sam说，“麻烦你再帮我一个忙，既然有了这篇论文的名字，就再向中国的校长们查一查有没有这篇论文的档案。”\r\n“好的，包在我身上了，哈哈！”\r\n结束通话后，Sam抑制不住内心中的兴奋，又点了一瓶啤酒后猛的干了下去，心里念着：“感谢上帝！”\r\n然后他想，如果这正是他要的东西，那么扎克伯格所说的灵感，不是一场已经发生了的运动，而是中国作者所预示的一个即将发生的运动，而这个运动最终由扎克伯格付诸实践。\r\n想到这里，Sam已经不能自已了——他太高兴了，甚至在走出酒吧的时候撞到了门。\r\n\r\n又过了两天，Sam接到了郭明明的电话。\r\n对方说，已经查到这篇论文是某学生的毕业论文，论文本身没有存档，只是在学生档案里写了论文摘要，和那封匿名信提供的信息是一致的。\r\n“那么，作者叫什么名字？”Sam迫不及待地问。\r\n“他叫谢小波。由于时间太长了，所以现在在哪里还不知道。”\r\n“谢小波。好的，我记住了，剩下的我自己就可以解决了，谢谢！”\r\nSam又走到了吸烟区，舒缓了一下心情。然后找到了Andy，两人交换了一下意见，就一起来到了主编的办公室。\r\n\r\n第六节 北京\r\nAndy对主编说：“我想Sam这次的收获真不小，你看，他不但解答了扎克伯格希望让人探索的秘密，还抓住了秘密背后的故事。Sam，你对主编说说吧，把你知道的都说出来。”\r\n于是Sam将这几天他所了解的事都一五一十的告诉了主编。\r\nSam说完后，看到主编双指交叉，低头似乎在思索什么，眼中泛着异样的光芒。\r\n“听着，Sam，”主编严肃地看着Sam说，“你知道吗，你发现了一个了不得的事情。这部产品的确不是传统意义的一个智能机，它代表的是打破过去一切传统的产业结构的银色子弹！Andy你也听好，抓住这种引领时代的事件，正是我们《时代》从创刊以来核心的宗旨。明白吗？”\r\nSam和Andy两人纷纷点头。\r\n主编接着说：“我们不要着急发布，一定要把专题的质量放到第一位。以目前的形势来看，别的媒体所掌握的信息还远不如我们。下一步，Andy，你带着Sam一起去一趟中国，”主编指着后背墙上的世界地图说，“去会一会他，我想你们还能够从他那里获得更多的信息。明白我的意思吗？”\r\n“明白！”两人一起说。\r\n“好了，抓紧时间，不管用什么方法，赶快联系到他。订票和出差费用的事你们直接和行政部沟通，手续我会替你们办好的。快去吧。”\r\n两人离开了办公室。\r\nSam的心情非常激动，在这之前也许只是自己的胡思乱想，而这次主编竟然能认可他的想法，并重视到如此程度。再加上有经验丰富的Andy陪同，他感到信心倍增。\r\n这个旅途对他而言，对《时代》而言，都是意义非凡的。\r\n\r\nAndy联系到了《时代》在中国分部的同事，简单的说明了情况，并表达了主编的意思。\r\n那边很快的通过公安系统的朋友查到那个作者的联系方式以及住址。Andy又拜托中国当地的行政部联系一下作者，安排好他们的会面。\r\n这前前后后仅有不超过十几分钟而已，Andy表现出了一个经验丰富的记者应有的姿态，让Sam感到非常敬佩，他想，自己也一定要努力，争取成为像Andy一样的专业的记者。\r\nAndy与Sam一起来到了行政部，在填写了一些必要的文件后又来到了财务部，领取了主编签字划拨的差旅费用。然后对Sam说：“我们有两个小时的准备时间，你现在就回家准备东西，两个小时候我们回到这里集合。”\r\n“好的！”\r\nSam没想到公司的办事效率这么高，还没来得及反应过来，就已经安排好了行程。\r\n这与做记者之前的自己所过的拖拖拉拉的生活完全不同，“的确，我也该打起精神了，别忘了我可是《时代》的记者！”Sam想。\r\n两个小时后，Sam和Andy回到了公司，每个人都拖着一个旅行箱。\r\n这时行政部的人走过来，把已经订好的两张机票递给了他们。起飞的时间是当天晚上6:30。时间已经不早，于是Andy和Sam就在机场附近简单的吃了一顿快餐，按时登上了去往北京的飞机。\r\n\r\n坐上飞机后，两个人一开始并没有交谈，而是各自在考虑一些事情。Andy在想接下来应该怎么样和那个神秘的作者谈话，才能得到想要的信息；而Sam想的是，这一连串的事似乎来得太快了：本以为解答出那个“秘密”时就已经结束了，但实际上那只是非常浅薄的一层含义，别人也可以很快解答出来，然后被媒体纷纷报道。这次两人去北京，却是抢在任何人之前挖掘“合作”背后更深层的故事。\r\n想到这里，Sam的心跳不禁加快了起来，他不知道这次等待着他的又是什么。\r\n这时Andy打断了Sam的思路，他把已经有的一些采访的构思和Sam交换了一下意见。\r\n很快，飞机就到达了北京。\r\n他们住进了北京分公司安排的酒店后，得知与作者会见的时间定在了第二天的早晨，地点位于美国大使馆附近繁华地区的雷雨咖啡——在当地有点名气，经常有一些美国人喜欢到那里去。\r\n北京的同事还告诉他们，作者说明不需要翻译陪同，因为他自己可以进行正常的英文交流。这也给北京分公司减少了不少负担。\r\n\r\n第二天，也就是10月19日星期六的早上九点半钟，Andy与Sam如约来到了雷雨咖啡。\r\n走进了这家具有浓厚美国本土气息的雷雨咖啡，两人很快就找到了作者谢小波——他们的北京同事给他们发送了这个人的照片。\r\n他正坐在靠着窗户一个位置，两人走过去很热情的和作者打了招呼。\r\nSam仔细的打量着眼前的这个人，他不敢想象，这就是一天那个启发扎克伯格的神秘作者，而现在这个人就在他的眼前。\r\nSam看到，这位作者年龄并不大——至少与他想象的满头白发的历经沧桑的形象要有很大差别——大概也就是三十岁不到的样子。他穿着整洁干净的浅蓝色条纹的衬衫，深蓝色牛仔裤，黑色的短发，和年轻的面容。使人印象最深刻的是，他的眼神很深邃，仿佛在那双眼睛的后面正藏着极大的智慧。\r\n作者很有礼貌的叫来了咖啡馆老板，Sam看到这个人正是自己多年前来中国游玩时认识的那位咖啡馆老板成禹。\r\n老板很快的认出了Sam，然后热情的说：“真没想到你来中国了，怎么提前没打招呼啊。对了，上次你问我的那个事，我又问了一些朋友，还是没有人知道，真是抱歉！”\r\nSam略微尴尬的说：“没关系，我已经解决了，非常谢谢你！而且我要找的人坐在我的对面。”\r\n老板看了看坐在Sam对面的作者，两人互相点了点头，然后说：“既然你们来了中国，而且到了我的咖啡馆，那就是我的客人，你们这桌我请客了，你们等一下，我去安排。”\r\nSam不好意思拒绝老板的热情，只能连说谢谢。\r\n在简单的自我介绍后，Andy向作者说明了他们来采访他的目的因为他在2013年写的那篇《读书系统的革命》，所以想当面向他请教一些问题。\r\n“是的，昨天你们的同事已经告诉我了。真没想到，这么多年过去了还有人提起我的那篇东西，”作者说，“而且还是特地从美国过来的时代周刊的作者，我真是受宠若惊了！”\r\n“谢先生，您的这篇论文在我们编辑部引起了非常大的重视，不过有一点小问题，”Andy说，“我们只是看到了您的这篇论文的摘要而已，所以这次来还想看一下它的全文。”\r\n“什么？”作者惊讶的看着Andy，“你是说，你们只是看到了摘要就从美国来找我？”\r\nSam刚想说些什么，被Andy用眼神阻止了，然后Andy说，“嘿嘿，真不好意思，这个还有一些缘由，我想一会儿再和您详谈。”\r\n作者沉默了一会，表现出一些戒备的样子。\r\nSam见状急忙说，“谢先生，千万别误会，我们不是美国特工，我们是真的很看好您的文章，绝对没有什么不好的目的！”\r\n作者看到Sam的样子，才放松下来，笑了笑，说：“哈哈，我看你们也不像。好吧，其实里面也没写什么大不了的东西。那篇论文存在我的邮箱里，怎么给你们？”\r\n这时Sam拿出ipaper，交给作者，说：“请您就下载到这上面吧。”\r\n作者看到ipaper，挡不住惊讶地叫了出来：“ipaper！这就是那个神器！”\r\n咖啡馆的老板见状也凑了过来，新奇地观察着这部到处闹得沸沸扬扬的智能机。\r\n作者很快就熟悉了它的操作，这点点那划划，马上就把论文下载下来了，然后交给了Sam。\r\nSam看到作者这么熟练的操作，就好像他才是这部机器的主人一样。\r\nSam将ipaper展开，又引起了作者和咖啡馆老板的惊呼，同时还吸引了咖啡馆里其他人来围观。\r\n打开论文后，Andy和Sam一起读这篇论文。作者安静地、好像很享受地观察对面这两人不断变化的表情——Andy聚精会神、眉头紧锁，Sam瞳孔时不时放大，偶尔还会伴随着“噢”一声的感叹或惊呼。\r\n\r\nSam已经完全看入了神，他不知道旁人是怎样的，只知道自己好像被吸引进了另一个世界。\r\n展现在他眼前的论文，首先是那个占据了整个页面的一个大标题——“读书系统的革命”，第二行副标题“针对中国图书产业链的结构重组”，第三行写着“作者：谢小波”。\r\n这一页最下方标记着的论文完成时间是2013年3月。\r\nSam立时想到，距离现在已经有6年多了。如果扎克伯格是受到这篇文章的启发的话，那么他也许最早在2013年就已经形成了ipaper的想法。\r\n如果是这样的话，那可真是一个非常值得报道的内容。\r\nSam决心一定要仔细的分析这篇论文，抓住扎克伯格创造的这个划时代的机器的背后的故事。\r\n他相信这无疑是个非常棒的主意——如果能够解析扎克伯格的这部神起机器ipaper是怎么来的，它的运作后台的内在逻辑与运作基础等等秘密都挖掘出来，那么做出来的报道专题一定会深受广大的使用者、行业研究者、业内人士与竞争对手的追捧的。\r\n从目录可以看出，全文分为六章。\r\n\r\n第一章是引论，开篇是这样写的：\r\n“在高度竞争的现代化社会中，掌握充足的知识成为了人们竞争的主要砝码，而读书作为人们最主要的充实自己的手段，却走进了一个颇为尴尬的境地。\r\n“一方面，由于工业、信息业、交通业的高速发展，图书的产量呈几何级数爆炸式增长，读书的方式也不断的增加。虽极大的方便了读者，但太多的选择反而使人不知所措，在有限的时间里，读者不知道应该怎样读书、也不知道读什么书。另一方面，由于书籍产业的高度竞争，也使相关的出版社、图书商、电购平台面临一个销售窘境。\r\n“实际上，大量的书商销量不佳，并不是因为读书的人少，而是因为没有找到一个满足读者真正需求的方式。换言之，是上层结构拖累了全体的进步。由此我设想，如果能够推翻原有读书系统的结构，按照符合时代发展的新需要重新构建一个更加先进的读书系统，掀起一场知识的改革，将会大大的解决这个的矛盾。\r\n“将客户的需求与企业的产品设计统一起来，以最广泛的需求为产品的开发目标，是永恒不变的高盈利模式。因此，本文的中心目的就是寻求一个需求与设计的合理的结合模式。”\r\n\r\n“说的好！”Sam想。的确就之前他所知的那些与图书、出版相关的公司，这些年来经营的都很艰难。新闻上不断报道着这样那样的图书销商、出版社在纷纷倒闭。虽然这几段还看不出和ipaper有什么关联，但他还是接着往下看。\r\n\r\n“所谓“读书系统”，指的是于读书相关的所有环节，包括出版环节、销售环节、阅读环节、检索环节等等。它既包括了图书的产业链条，也包括了读者的体验过程。\r\n“之所以进行这种设定，是因为在当前这个科技、思想、经济都大发展的时代，读书系统已不是以往那种单纯的“出版社出书-读者买书”的结构了，而又融入了更多元的因素，例如互联网。\r\n“它使整个链条都复杂了起来，所以为了适应新时代的变化、达到进步，我们有必要对所有这些传统环节、新兴环节重新整理，并构造出一个更合理的、更进步的系统。”\r\n\r\nSam不禁想：“这个中国作者到底是要做多大的一个项目啊？别人都只是专注于自己的公司经营的好不好，而他却试图改变所有公司的命运！”还没有进入正文，Sam就不禁佩服起了作者的勇气。\r\n\r\n然后就进入了第二章，即现状、未来趋势和分析。\r\n这一章先提供了一系列数据，然后论证了为什么电子书会完全代替纸质书。为了节省篇幅，在此我们就不将原文全部摆上来了。\r\n作者又写到，既然确定了纸质书和电子书的关系和发展趋势，那么基于这个论点就可以先设计出一套完善的产业盈利结构，然后再探讨如何从传统的产业结构向新结构过渡。\r\nSam想，这个口气听起来并不像是一个图书产业的事情，那更像是一个国家的产业革命。作者正是像要掀起这样一场革命似的。\r\n\r\n第三章，是针对当前主要问题的对策。作者在这章花费了大量的篇幅，从两大方面进行了讨论。一方面是图书产业经营者方面的问题，一方面是读者需求方面的问题。由于以后还会讲到，这里也让我们先跳过吧。\r\n来看第四章，读书系统的总设计。\r\n这章就到了全文最重要的地方了，Sam更打起了精神，像在大学期间学习知识一样的认真起来，把自己想象成一个专业的研究者，只有从专业的角度去研究这篇论文，才能够发现扎克伯格的核心秘密。\r\n作者写到：\r\n“简单的说，本文所提出的[读书系统革命]，也可以看做是利用高度发达的互联网来做一次全产业一体化的合作方案，即推翻旧的系统，形成一套崭新的读书系统。\r\n这个方案的核心就在于——合作。”\r\n\r\n“合作！”Sam惊讶的看到这个当初扎克伯格在发布会上提示的关键词。这个解开ipaper秘密的咒语，又一次出现在了这篇神秘的论文里。\r\n\r\n“而合作的基础就是参与方共赢——只有你、我、大家都盈利了，才会有人同意合作。\r\n“所以在本章的系统设计中，我将着重探讨每一个环节的盈利点。只有将每一方的盈利说清楚，才能够在此基础上进行更细致的实施方案设计。”\r\n然后在文中的漫长篇幅中，作者设计了每一个环节的经营者如何从合作中盈利，使每个人都从中获得比系统成立之前更多的利益，达到多方共赢的状态。\r\n作者甚至为每个环节都设计了非常详细的合作方案，Sam此时已经对作者感到无比的钦佩。他想，也不知道这个作者是何方神圣，为什么从来也没有听说过呢？为什么这么好的文章却从来没人提起过呢？\r\n然后他又想到，扎克伯格不正是将这个多方共赢的合作系统应用到现实中的人吗？不得不说，他可真是个厉害的角色，发现了这样文章，并且还将它付诸了实践。可是这明明是6年前的文章啊，为什么我到现在才知道呢？\r\n怀着复杂的心情，Sam继续看下去。\r\n第五章，由旧系统向新系统的过渡策略。文中先对传统图书结构做出了一些描述，并强调传统的图书盈利链条仍然是占绝大部分的。因此要撼动这么坚固的结构并不是一朝一夕的事情。因此如果要实现新系统，就必须做好长期的准备。\r\n然后，作者提到，他在研究经济学与社会学的过程中，发现了一个时间模型。\r\n如果要做长期“战斗”的准备，就需要知道这个长期到底是多少年。他的这个模型就是一个数学公式，公式非常复杂，简单理解就是：一个东西越复杂，人们就需要用更长的时间才能接受它。\r\n“历史上无数伟大的科学家，在自己的那个时代被人称作是疯子，就是因为他们所提出的事物超越他们所处的那个时代太多，如果他们能够明白这个道理而晚些年再提出的话，就不是那样的境况了。”\r\n作者利用这个公式算出来，他所设计的这个新的读书系统，让全中国普遍接受的时间在15年左右，而在技术最发达、经济环境最自由的美国，是6年左右，误差不超过2年。\r\n读到“6年”时，Sam的眼睛已经瞪得不能再大了——“我知道了，我知道了！原来扎克伯格早就知道了这个结果，所以他才会选择在2019年发布这个产品的！”Sam激动的想。\r\nSam此时已经忘记了周围还有人在看着自己，忘记了自己还有采访的任务，只是单纯的陷于对作者一系列设想的钦佩上。\r\n\r\n到了最后一章，作者重申了合作的重要性，并对系统做出了一个美好的期望。然后写到：\r\n“这篇论文并不是给一般读者看的，而是希望位于读书系统的高层人物，或是有意为新型读书系统进行努力的人从这里得到一些启发或参考，来一同推进时代的进步。（全文完）”\r\n\r\nSam呆呆的倚在自己的座位上，不知道该做些什么，剩下的只是无尽的感叹。Andy虽然是身经百战，此时也是不知道该说什么。\r\n两个人都低头看着屏幕，陷入了沉思之中。\r\n如果单纯是这篇论文，也许并不足以让一个常青藤的MBA高材生和一个经验丰富的记者惊讶，顶多只能让人觉得作者想象力不错而已。\r\n但正是因为有人实现了它，并且在这两人所在的国家引起了不同凡响的影响，才更让人对这个始作俑者表现出如此的惊叹。\r\n\r\n这时作者打断了他们的思路，如果这时没人说话，他们还会继续沉思下去。\r\n作者微笑着说：“现在，该告诉我你们的故事了吧？”\r\n\r\n第七节 扎克伯格与乔布斯\r\n这时两个人才回过神来。\r\nAndy示意了一下，Sam按照两个人在飞机上商量好的，简单地把从发布会开始到解谜，再到扎克伯格的提醒，以及得知论文的事都告诉了作者。\r\n“谢先生，我们本来只是抱着了解一些情况的心态来的，”Sam说，“没想到看到这样一篇厉害的文章，我是真的被您的想象力和分析力震惊了！”\r\n“哈哈，您太夸奖了。从来没有人在我面前这么认真的读我写的文章，光是这一点，我已经非常感谢你们了！”作者谦虚地说。\r\n“不过，听你们这么一说，我有一些疑问，”作者接着说，“扎克伯格是怎么知道我的这篇论文的？”\r\n“什么？不是您给他的吗？”Sam好奇的问。\r\n“当然不是了，”作者说，“这是我的大学时候的毕业论文。当时我的导师说虽然写的不错，但是太异想天开了，根本不可能实现。为此我还郁闷了好一段时间呢。”\r\n“不可能实现！苹果可是在您这个想法的基础上完美的实现了啊！”Sam激动的说。\r\n“的确，我也很惊讶，原来真的有人能实现。不过我还是很好奇，它是怎么会到扎克伯格的手上的。”作者说。\r\n\r\n其实，在场的所有人都不知道。在6年前，也就是2013年作者把论文提交到学校。学校将所有论文的摘要记录在档案里，给出一定的成绩后，就把所有毕业生的论文原件都丢到了垃圾桶里。\r\n这时一个有心人在周围没人时从垃圾桶里回收了这些论文。当他看到作者的这篇论文时，也是眼睛一亮。正好当时Facebook网站正在举行奖金丰厚的创意大赛，这个有心人就用翻译工具把这篇论文翻译成英文，发到Facebook公司的邮箱。但是它在比赛上并没有拿奖，事情也就这么告了一段落。而扎克伯格是如何发现这篇论文的，后面我们还会讲到。\r\n\r\n“谢先生，”Andy说到，“我们希望您能够帮我们一个忙。”\r\n“您说。”作者答道。\r\n“希望您能和我们一起去美国加州，见一见扎克伯格先生。因为就像刚才Sam所说，如果扎克伯格能够见到您，就会答应我们的采访。”\r\n作者并没有回答，而是陷入了沉思中。\r\nAndy马上说到：“关于费用的事情您完全不用担心，这个会由我们时代周刊全部提供。而且，如果您能答应的话，我们还会有额外的一笔奖励金。希望您一定要答应！”\r\n作者还是没有说话。两个记者此时都没有意识到作者考虑的完全是别的问题。\r\n又过了几分钟，作者终于开口了。\r\n“好吧，我答应你们，正好去美国玩一玩，哈哈！”\r\nSam和Andy如释重负，开心地和作者握手。\r\n\r\n采访还在继续，把几个主要问题说清后，气氛明显轻松了起来。三个人开始随意的聊了聊天。\r\n“哈哈，告诉你们一个好玩的事吧，”作者说，“你们不觉得扎克伯格和乔布斯的命运有什么关联吗？”\r\n对面的两人呆呆地看着作者。\r\n“我也是觉得很巧，所以你们就当听笑话吧。”作者说。\r\n两人点点头。\r\n“比如说他们都是20岁就开始创业；\r\n“乔布斯在车库里创办了苹果公司，扎克伯格在大学宿舍里创办了Facebook；\r\n“他们都是玩技术的怪才，乔布斯玩电子，扎克伯格玩编程，他们在高中时期对技术的狂热爱好远远超出了同龄人，很早就开始发明东西；\r\n“他们都从大学辍学；\r\n“他们的性格都很古怪。”\r\n作者看到Sam和andy听得正出身，很得意的接着说，“最重要的是，他们的理念都一样：为了创造伟大的发明，引领时代的进步，而不是为了赚钱！”\r\nSam点点头。\r\n作者接着说，“这些你们可能都知道，但有趣的来了。我查了他们两人的一些经历，如果把它们联系起来，就很好玩，哈哈！”\r\n“快说吧！”这时站在旁边等着听故事的咖啡店老板说。\r\n“你们看，”作者饶有兴致的说，“1946年，世界上第一台计算机出现在了美国吧。但是经过了十年还是那么笨重，有什么办法呢？于是乔布斯出生了。哈哈”\r\n“这个笑话就有点太冷了。”咖啡店老板说。\r\n“别急嘛，反正是瞎说的，”作者说，“如果说存在命运的话，那么叫命运的那个家伙也等不及把那些笨重的计算机给弄一弄了，所以还没等乔布斯毕业就叫他退学了。在乔布斯成立苹果公司之后，1984年弄出了第一台微型个人电脑。\r\n“这是跨时代的产品了吧。但这还不够，光有硬件不行，软件还得跟上啊，这时候扎克伯格出生了。哈哈，1985年。\r\n“然后命运的急性子又犯了，扎克伯格刚到十岁就给了他一台电脑。同一年，乔布斯也成立了一个动画公司，制作第一步3D动画《玩具总动员》——两个人都开始了一段新事业。\r\n“后来的几年里，乔布斯大绽光彩，而扎克伯格也正在初中学校里展现他惊人的编程天赋；\r\n“2000年，乔布斯重新登上苹果CEO的宝座，扎克伯格也在高中学校里编出一些新鲜的软件；\r\n“2003年，乔布斯年龄也不小了，该给年轻人让让路了，于是10月份，乔布斯在医院检查到了自己身上的胰脏肿瘤，同一个月，命运让扎克伯格受到了感情的刺激，突然一个灵感启发他在大学宿舍里创建了Facebook的前身Facemash；\r\n“2004年，乔布斯被确诊为胰腺癌，几乎面临死亡，他一心只想着培养苹果的接班人，怎样才能找到替代他继续引领苹果、引领科技进步的人，这时扎克伯格闪亮登场了——Facebook正式上线了！难道这不是命运的巧妙安排吗？！”\r\n说到这里，作者看到Sam和andy都听得正出神，很难说挂在他们脸上的表情是相信还是怀疑，也许各占一半吧。\r\n作者接着说下去：“这个时候，Facebook顺利运行后，命运放心多了，于是就看着这两个人怎样为时代进步而努力。\r\n“2005年，乔布斯重返到第一线工作，重点开发当时的高度机密项目——iphone一代，那个开天辟地的智能手机，此时扎克伯格的facebook也如日中天的侵占着各个国家的网络；\r\n“2007年，乔布斯发布了那部划时代的尖端手机iphone一代，同时扎克伯格的Facebook成为世界上最大的社交网络。\r\n“因此命运让乔布斯关注到了扎克伯格这个人，并且直觉上就很喜欢这个小伙子，扎克伯格也说自己是乔布斯的信徒，《乔布斯传》的作者说，他们两个人之间似乎存在着一种‘奇怪的亲密关系’；\r\n“2010年，命运想，时机差不多了，也该新老交替了，乔布斯的身体到达了极限，癌症在全身快速扩散，而扎克伯格却走上了巅峰，他获得《时代》的年度人物称号，Facebook在这一年超越谷歌成为了全世界点击率第一的网站。”\r\n这时作者停顿了一下，看到Sam和andy的表情已经僵住了，仿佛他们是在听一个恐怖的鬼故事一样。\r\n作者慢慢悠悠的喝了口水，咖啡厅老板再次提示他快讲下去。\r\n作者继续说：“这里才是关键。2011年，9月份扎克伯格召开了当时大型的Facebook第一届开发者大会，并在会上做了著名的演讲，提出了划时代的‘开放平台’概念，乔布斯得知以后非常满意，他知道自己后继有人了，同时他也知道自己再也扛不住癌症的痛苦了。\r\n“然后，你们知道的，乔布斯在第二个月发布了iphone4s，完成了他人生最后的一个引领时代的任务，第二天就去世了。”\r\n作者低头闭目，双手合十默哀了几秒钟，两个记者也跟着一起默哀——毕竟，那个时代过来的人，没有人不为乔布斯的去世而感到遗憾。\r\n作者接着说：“故事就到这里了，你们看，怎么样？”\r\nSam还没有从那奇妙的命运故事中愣过神来，缓了一会儿，然后说：“棒，太棒了！真的是这样吗？如果命运真的这么有趣，放在我们的报道专题里，肯定会有很大的反响！”andy也表示同意。\r\n作者笑了笑，说：“好吧，这个故事是你们的了。反正从我嘴巴里说出去，也没有什么影响力。既然觉得有趣，你们就拿去写吧！”\r\n\r\n然后双方又简单的聊了几句，这次的会面就结束了。回到酒店的路上，Sam向Andy提议将乔布斯与扎克伯格之间的奇妙命运也写进专题，Andy表示同意，如果可以的话再进行一些调查，润色一下再发表。\r\n到酒店放下了采访的设备，Sam联系了那个给他帮了大忙的郭明明，约在了附近 的一间西餐厅，希望能够当面感谢她，毕竟能够找到那个作者完全是她的功劳。\r\n见到郭明明后，简单的寒暄了几句，然后向她说明了苹果的那个产品的大概情况。Sam说，这个产品在广告投放上也有非同小可的进步，到时也许可以和郭明明所在的传媒公司合作。郭明明表示非常感兴趣，并要求在Sam的报道专题完成后一定第一时间通知她。\r\n\r\n第二天，两个记者坐上了飞回纽约的飞机。\r\n他们感到信心满满——这次来北京果然收获真不小（主编果然有预见性）：得知了扎克伯格实施的产品战略的核心思想，乔布斯与扎克伯格的命运，最重要的是，不但解答了扎克伯格出的谜题——他的灵感来源是哪里，还超额完成了任务——把原作者都带了过去！\r\nSam一想到这里，心情就无与伦比的高兴。\r\n\r\n回到办公室后，两个人直接来到了主编办公室。Andy将这次的采访的向主编做了详细的汇报。主编拍着桌子大声叫好，并在之后的会议上大大地表扬了两个人。\r\n又过了几天，Sam接到了作者的电话，说已经动身前往美国。Sam向公司申请了专人接待以及相关的费用后，迫不及待地等着他的到来。\r\n10月26日周六的清晨，Sam来到肯尼迪机场接机。两人寒暄几句后，Sam带作者来到了时代周刊总部所在的大楼。\r\n在员工餐厅吃过早餐后，作者被带到总编办公室，一路上知情的员工都向他做了友好的问候，这让作者感到很高兴。\r\n主编表示热烈的欢迎后，再次向作者提出了一起见面扎克伯格的请求，作者很有礼貌的答应了。\r\n然后在行政部联系了苹果公司，并说明了大概的情况后，约定了会面在当天的下午三点点半。主编感到很惊讶，因为一般情况下像苹果公司CEO这样的大人物，时间肯定是安排得非常满的，能这么快的会见他们，说明对此异常重视。\r\n主编在做了一系列安排后，就叫Sam和作者两个人尽快动身前往。由于性质特殊，这次并没有让Andy随同。\r\n\r\n第八节 秘密协议\r\n10月26日下午3:30，Sam和作者准时出现在了位于加州库帕提诺的苹果总部。这次会面的地方是扎克伯格的办公室。\r\n办公室设计的很简单，摆放着很多个人物品和人物贴画，包括一张床，说起来，更像是一个男孩的卧室。\r\n扎克伯格热情的和作者握手。\r\n坐下来后，Sam简单的叙述了一下找到作者的经过，扎克伯格非常高兴地再次表示了感谢。\r\n三个年龄都相差不远的年轻人，聊得很投机。\r\n扎克伯格问：“谢先生，你是怎么想到写这么一篇论文的呢？我非常好奇。”\r\n作者笑着答道：“其实是我一开始写着玩的东西，后来马上毕业要交毕业论文了，来不及再写一个，就那么交了上去，哈哈。”\r\n“写着玩的？”扎克伯格惊讶的问到。\r\n“对啊，那个时候我成天都在胡思乱想，每时每刻都会产生无数的灵感，”作者说，“我有把灵感随时随地记录下来的习惯。那时我列出了二十多个感兴趣的论题，读书系统的革命只是我动手写的第一篇。”\r\n“我想问一下，你大学期间学的是什么专业？”扎克伯格问。\r\n“学的是金融专业，不过我还自学过几年软件编程，业余的时候喜欢研究社会学，总之我的爱好很广泛。”作者答道。\r\n“那么，你怎么会想起写关于图书业的文章呢？”\r\n“是这样的，我一开始想自己做一个读书检索的网站，但是因为那太费时间，所以就想把这个主意写出来给一些已经存在的读书论坛看，”作者喝了一口咖啡说，“可是呢，越写越有灵感，就索性把图书购买问题也写了进去，然后又加上了阅读方式的问题，到了最后不得不重新写一遍——因为我觉得把整个产业都写进去才有意思，嘿嘿！\r\n“当时我的经济学老师夸我的思维很活跃，还建议我把一些想象的东西写成专业性质的论文，这样有利于提高我的研究水平。我觉得整个研究过程有趣极了！”\r\nSam听着作者在说自己当年的想法时，感到坐在对面的就像一个活蹦乱跳的小孩子正在说着自己玩的各种玩具一样——这与他最初在没看到对方之前所想象的完全不一样，他不敢相信那种思维缜密、逻辑清晰、颇有预见性的文章，是出于这个喜欢幻想的大学生人之手。\r\n“那么谢先生，你写的这篇文章，后来被中国的企业采纳了吗？”扎克伯格接着问。\r\n“唉，很遗憾，”作者摇摇头说，“我给很多企业都发了邮件，甚至还给一些媒体也发了。但是得到的回应很少，即使有回应，也只是说我的想法太难实现。”\r\n他露出很失望的表情，接着说：“直到现在，还没有人采纳这篇文章，它就像石沉大海一样，”然后他又小声的说，“后来我知道了为什么——我的想法并没有错，问题是在中国的经营环境里，不是企业之间勾心斗角，就是政府管制太多。所以现在我自己也觉得那几乎是不可能的事！”\r\n然后他抬起头来看着Sam和扎克伯格，眼中泛着光芒，说：“但是美国就不一样了，你们是个自由的国家，如果这个东西在你们那里实行起来效果就不一样，”作者微笑着继续说道，“你们看，这不果然就在美国实现了吗！”\r\n扎克伯格看着眼前的这个年轻人，不知不觉从内心中升起了一种同情的心，他想，如果这个人是生在美国就好了，否则的话也不会这样被埋没掉。\r\n然后扎克伯格又了解了一下Sam的情况，发现这个年轻人不但是个高材生，而且也是个远大理想的人。正是因此，三个对未来抱有激情和梦想的人，能聊得很开心。\r\n时间很快就过去了，到了晚餐的时间，三个人来到了苹果公司的餐厅。\r\n作者赞赏了餐厅的伙食后，他们结束了这一次的会面。\r\n扎克伯格向Sam表示，他会如当初约定一样接受时代周刊的采访，同时又向作者表示，让他今晚就住在苹果安排的酒店里，第二天还有些事要谈。\r\n这样一来，Sam就一个人回纽约了。\r\n\r\n晚上，住在豪华的大酒店里，作者泡在浴缸里，回想着这高兴的一天。然而，他知道，事实也许并不像表面上那么简单。\r\n为什么他能接受这么高的待遇？为什么苹果公司的CEO会这么热情的对待他这么一个小人物？\r\n如果只是因为一篇论文的话，扎克伯格只要一封感谢信，或者一些奖金就能打发他了啊，完全没必要做到这样，这是为什么呢？\r\n\r\n第二天早晨，作者如约再次来到了扎克伯格的办公室，这次只有他们两个人。\r\n扎克伯格简单地询问了作者昨天的睡眠情况后，直接切入主题。\r\n“谢先生，首先我先要向你表示道歉，”扎克伯格说，“因为ipaper是基于你的设想开发出来的。虽然已经比你最初设计的读书系统多出了很多东西，但你仍然是功不可没啊。之前一直就像向你表示感谢，但是一直都找不到你，所以非常抱歉！”\r\n这时作者本来想说他所做出的贡献实在太少，本来读书系统只占了ipaper的极小一部分而已。但是他没有说出来，似乎想到了些什么，所以他选择了沉默。\r\n扎克伯格接着说：“都到了这个地步，所以我就直说了。”\r\n作者点点头。\r\n“我们想和你签一份合同，就是你许可您那篇论文里的所有创意都正式转交给苹果公司。条件由你出，你看怎么样？”扎克伯格严肃的说。\r\n作者没有马上回答。他瞬间想到了在中国发生过的种种商业纠纷。闹得最大的是几年前，中国的王老吉凉茶公司，由于没有获得那个凉茶秘方的创始人授权，而在商业大获成功后被告上了法庭，不但赔了几百万的罚款，还不得不把整个王老吉的商标拱手让出，直接损失甚至达到数亿元。\r\n这次扎克伯格向他提出创意转让的要求，明显也是出于这点考虑。如果自己过于谦虚的话，反而相当于放弃了一笔巨大的利益。\r\n就在作者沉思的这个时间里，扎克伯格也在想着自己的事情。\r\n其实从ipaper项目启动以来，他就一直在考虑着找到作者的问题，因为投入了巨大的资金，如果到时因为这个创意所有权的问题被告上了法庭，损失将会不可量计。但是直到ipaper发布后也没有找到，这让他很头疼。\r\n这时Sam的出现让他眼前一亮。一方面，扎克伯格本来就有计划要在ipaper发布后，搞一次大的正式的宣传，时代周刊正是一个最好的媒介；另一方面，又看到Sam恳求采访的态度，就干脆利用他来找到那个作者，这样一来一箭双雕。\r\n他没想到的是，Sam竟然这么快就找到了原作者。\r\n当他想到这里时，作者说话了。\r\n“既然您这么说了，那我就提一个条件，”作者同样严肃的说，“如果您能够答应，我愿意立刻就签写这份合同。”\r\n“你说。”\r\n“我希望移民美国，由苹果公司提供移民所需要的所有资金和办理手续，你看这样可以吗？”\r\n“完全可以！”扎克伯格只思索了一秒就痛快的答应了。毕竟移民所需费用与正常的专利、商标甚至互联网域名的转让费比起来要便宜太多了。\r\n“哈哈，”作者说，“那我们就这么说定了！”\r\n扎克伯格也高兴的与他握手。这样一来，作者得到了他想要的，扎克伯格也卸下了一直以来的包袱。\r\n扎克伯格当时就起草了一份合同，然后递给作者。作者详细的阅读，合同很简单，条款也不算多，所以出现漏洞的风险也少很多。\r\n作者还看到，合同最后一条指明，双方都有保密的义务，不能以任何名义将此合同告诉任何第三方。\r\n作者很爽快的签下了名字。然后扎克伯格派人订购了机票，并叫司机送作者回国。\r\n这是10月27日周日的下午。\r\n\r\n这段解谜就告了一段落。也许有好奇心重的读者，已经等不及的想听下一个解谜了——那就是当初扎克伯格答应Sam的，告诉他ipaper的开发全过程。\r\n\r\n第九节 Project-L\r\n2019年11月2日周六早晨9:00，Sam受邀再次来到的加州库帕提诺的苹果总部，开始了约定的对扎克伯格进行为期两天的采访。由于新产品发布后有很多的事物，所以扎克伯格只能选择在周末接受采访。\r\n扎克伯格带着Sam来到了停车场的一辆红色跑车前。\r\n“我的新车怎么样？”扎克伯格问到。\r\n“丰田86的2019版！”Sam激动的叫到。\r\n“哈哈，你还很识货嘛！”扎克伯格说到。\r\n丰田86虽然是一款只有40万元的平民跑车，很配不上扎克伯格这种级别。但它却是在跑车界很有名的漂移神车。出于年轻人对汽车的狂热，Sam自然知道它。\r\n扎克伯格指了指它，说：“走，今天就开我这辆新车带你去一个地方。”\r\n于是两人上车，开往了位于加州库帕提诺市南部的一个森林公园，距离苹果总部只有5公里的路程。\r\n进入森林公园的有多个S弯的道路后，扎克伯格露出一丝狡黠的笑容，示意Sam系好安全带——Sam本能地意识到，扎克伯格要开始漂移了！\r\n果然，扎克伯格连续挂档，速度越来越快，然后他高速地冲向一个急弯，右脚在油门和刹车之间快速地来回切换。\r\n车子好像失重般，在几乎要撞上护栏时甩了过去。Sam心脏似乎要停止了跳动，脑袋一阵眩晕。\r\n之后又是几个连续的弯道，扎克伯格就像电影里演的飞车一样甩过每一个弯道。\r\n几分钟后，车停了下来。\r\n打开车门，Sam腿一软，不由自主地跪在了地上。\r\n扎克伯格哈哈大笑，然后递给了Sam一瓶热咖啡，缓一缓神。\r\nSam喝了一口热咖啡，索性坐在了地上，点了一根烟。\r\n这时，他看到眼前的建筑物——一栋十几层高的破旧的建筑物，没有牌子，但看样子好像是一家酒店。周围被树叶已经掉光的大树环绕着，给人一种很是凄凉的感觉。\r\nSam想，一个酒店开在这种地方，会有生意吗？\r\n这时扎克伯格示意Sam起来，Sam掐灭了烟，随着扎克伯格一起走进了这栋建筑物。建筑物上所有的窗户玻璃都贴了暗色的贴膜，从外面几乎看不到里面是什么。\r\n打开陈旧的大门，Sam感到，这肯定是一家酒店，走进去正对着的是一个吧台，吧台正中坐着一个漂亮的女人，看上去有些眼熟。\r\n漂亮女人看到他们俩，热情的向扎克伯格打了招呼，但是对于Sam的出现却表现出了一丝惊讶的样子。\r\n然后扎克伯格领Sam来到了大厅一个角落，这里有两排相对的沙发，中间一个茶几，就像常见的咖啡厅布局一样。\r\n两人坐了下来，扎克伯格示意吧台的漂亮女人端来了两杯咖啡，然后说：“Lily，你先去忙别的事吧，这里有我呢。”\r\n于是那个女人就微笑着离开了。\r\nSam刚刚想要说些什么，扎克伯格就打断了他：“Sam，今天的采访就从这里开始吧，我看这一楼很安静，我就从头给你讲起吧。”\r\nSam点点头，然后从包里拿出三脚架和摄像机，镜头对着扎克伯格，试了几个角度后确定下来。因为此前扎克伯格提出了只邀请Sam一个人来，所以Sam不能带专职的摄像师来参加这次的采访，只能独自完成这一系列的任务了。主编对于扎克伯格这种怪异的要求已经见怪不怪了，所以就答应了。\r\n“那么，可以开始了吗？”扎克伯格问。\r\n“完全可以，您开始说吧，我非常期待您的故事！”Sam说到。\r\n“那就从六年前说起吧，”扎克伯格平静地说，“也就是2013年。”\r\n“果然是六年前！”Sam想。\r\n\r\n现在，让我们随着扎克伯格的讲述，一同回到六年前的那个时候吧。\r\n2013年3月，此前我们已经提到过，当作者谢小波提交了大学毕业论文之后，被一个有心人从垃圾箱里捡起，然后将论文翻译成英文匿名地提交给了Facebook创办的创意大赛。但是由于实现起来非常难，所以被评委小组完全否决了。\r\n需要我们知道的是，这个时期的扎克伯格，实际上处于一个人生最低落的阶段——他完全不知道自己的人生到底是为了什么才继续下去的？\r\n扎克伯格在大学还没毕业就创建了Facebook网站，那个将人类联结起来的时代性的网站。那可以说是他最伟大的成就。\r\n十几年过去了，他却还是在维护同一个网站。\r\n虽然网站在不断的增加新功能，但是比起当初的那种成就感，扎克伯格越发的感觉到无聊——当初的激情早已荡然无存。到底当初是为了什么才那么拼命的工作呢？\r\n扎克伯格已经感到麻木。\r\n直到一篇悼念乔布斯的一篇互联网文章出现在了他的眼前，这才渐渐的回过神来：\r\n那篇文章除了对乔布斯那个充满惊喜的时代表示怀念外，还举出了“后乔布斯时代”苹果公司的一系列衰落表现。这些表现就是新产品没有创造性，同类型产品不断被竞争对手取代等等。\r\n扎克伯格在这篇文章里同样意识到了自己的问题，对，就是那个——没有创造性！\r\n当初在大学宿舍，不正是为了那个原因而癫狂嘛！\r\n不是为了造福人类，也不是为了方便舍友，单纯的只是想实现自己脑海里的一个灵感，这一点，就足够废寝忘食地去做了。\r\n扎克伯格发现了这个问题所在，就想去解决它。解决问题的第一步，就是发现问题。\r\n于是，他举办了创意大赛。但是评委会选出的优秀作品远远达不到他的要求，他们不是希望制作一款软件，就是希望改进界面的美感，这些怎么能叫创造性呢？\r\n陷于人生瓶颈的扎克伯格，提出了休假，他需要调整一下自己的状态。\r\n就是从这时开始，他爱上了赛车。\r\n刺激的运动让他暂时忘记了事业上的止步，他在赛车场上还结实了很多朋友，他们大都不是职业的赛车手，在生活中也都是些小人物。但这些人却教会了扎克伯格很多东西，有些是赛车技巧上的，有些是由赛车引申出来的人生观。\r\n扎克伯格渐渐意识到，由于以前接触的越来越多的是大人物，现在却发现反而是这些名不见经传的小人物们更能给他带来灵感和自信。\r\n然后扎克伯格又突发奇想，也许可以回到公司，从一些基层的员工那里得到些灵感。\r\n抱着这样的想法，他回到了公司。\r\n但他从不参加公司会议，只是每天和一些基层员工闲聊。有时是聊员工的家庭，有时聊一聊娱乐，有时还会问员工有没有一些创意。\r\n这一天，当他和一个参与过创意大赛举办工作的数据录入员闲聊时，那个年轻的小伙子说到：“我倒是没什么创意，不过我觉得上次咱们公司举办的创意大赛里，其实有好多没获奖的提案倒是很有意思，你要是想看，我这里还有存档呢！”\r\n扎克伯格本来没抱什么希望，就随意的翻了翻年轻小伙子在电脑里摆弄出来的存档。\r\n当他翻到第三页时，瞳孔突然放大，表情严肃起来，然后对年轻小伙子说：“就是这个！你把它整理出来，马上发到我的邮箱！”\r\n小伙子也被扎克伯格这么突然的转变吓了一跳，然后立刻手脚麻利地整理出来发送了过去。\r\n扎克伯格一路小跑回到了自己的办公室，打开那篇提案，一遍又一遍的阅读。每读完一遍，眼中的光芒就越亮一点。\r\n\r\n当然，他看到的这篇创意提案，就是前面我们提到的那个作者的大学论文《读书系统的革命》。\r\n扎克伯格被作者的想象力深深吸引。\r\n论文从怎么让读者买到想买的书和怎么让出版商多赚钱这两个基本点出发，最后竟然引发出整个图书产业的进化。不得不说作者的勇气可嘉。\r\n大胆的创意，正需要这样敢于想象的勇气。\r\n扎克伯格最感兴趣的不是关于图书产业，而是作者为了这个产业而设计的一整套系统。\r\n这之中包括了基于强大语义分析的搜索引擎部分，安全便捷的网络付费部分，更适应庞大数据量的信息联结方式的部分，大胆却有效的物流运送部分，等等等等。\r\n扎克伯格立即就想到，这套系统其实是可以应用到互联网相关的所有产业的，如果能把它实现，那么就会引起所有行业的进化！\r\n说的夸张一点，甚至会带来新一次的技术革命！\r\n是的，历史上的工业革命、产业革命、信息革命，都是由技术的进步引发的，如果他能够抓住这个机会，他就是新一代技术革命的创始人！\r\n想到这里，扎克伯格的热血上涌，仿佛又找到了当初大学时的激情。\r\n事不宜迟，扎克伯格立刻召集了Facebook各个部门的负责人，在大会议室召开了会议。\r\n秘书将论文的全文发给了每个人，然后扎克伯格要求每个人都提出自己对这个提案的可实现性给出意见。\r\n十几分钟过去了，每个人都已经仔细读完了论文。接下来又是漫长的沉默，每个人的想法都不一样。\r\n终于，财务部经理打破了沉默，发表了意见：“这不可能实现，牵涉到这么多的部门和企业，预算上很难估量。”\r\n然后其他部门的经理也纷纷响应。\r\n技术部经理说：“如果连谷歌都做不到的搜索引擎，我们这个搜索界的外行怎么做呢？”\r\n行政部经理说：“按照这篇论文里的说法，必须要配合那么多的企业一起开发，这说起来简单，但是这种程度的合作怎么能说做就能做到呢？谁知道别人会有什么自私的想法呢？”\r\n应用程序部经理说：“的确，要和外部合作，就需要开发很多接口，凭我们目前的能力，很难达到。”\r\n市场部经理说：“作者虽然说要让每一方都从中盈利，但他的意见还太理论化了，实际上的多方盈利可是没这么简单的。”\r\n战略发展部经理说：“他还提到什么时间公式，什么六年后就能让所有人接受这个新概念，我看那根本是异想天开！何况那个公式根本就没有得到验证。”\r\n这时，其他部门还要说下去，被扎克伯格打断了。\r\n“等一等，难道你们就没人想到这个主意好的一面吗？”扎克伯格激动的说到。\r\n所有人都沉默。\r\n“我知道你们的想法，但是，正是因为那么的不可能，我们才要去做啊！如果有那么容易做到，我们的竞争对手不也能马上做到了，那么还有什么意义呢？”\r\n又是沉默。\r\n“我们再继续这种状态下去，肯定是要被对手击败的！如果我们不做点更有创意的东西，结局就会像今天的苹果一样！”\r\n沉默。\r\n“那么好，我最后问一句，有谁愿意和我一起干这个事？”\r\n漫长的沉默。\r\n“很好，很好！”\r\n扎克伯格气愤地站起来，环视每一个低着头的脑顶，然后又叹了叹气，什么都没有说，走出了会议室，重重地关上了门。\r\n第二天，扎克伯格就像董事会提出了辞呈，希望辞去CEO职务，只保留股东的股份和董事长的职位。\r\n董事会大为惊讶，无论怎么劝说都无法阻止。但是没办法，大家都了解扎克伯格的怪脾气，只好同意。\r\n最后商议结果是，保留扎克伯格的名义CEO职位，实际上却采用另外的人来管理公司正常运作。\r\n\r\n离开了Facebook总部后，扎克伯格没有回家，而是开着赛车在赛道上一圈又一圈的慢跑。\r\n虽然他仍是Facebook的股东，也仍是Facebook的CEO，但此时此刻他却好像失去了归属感——一切从零开始，开启一条新的旅途。\r\n扎克伯格想，这么庞大的系统，究竟应该如何入手？应该怎么制作？做到什么地步？\r\n这时突然乔布斯的形象浮现在了脑海，他想，如果是乔布斯的话，会怎么做呢？\r\n如果是乔布斯的话，那么，他只负责一点就够了——想象。其他的细节和实现，去交给专门负责的人就好了。\r\n想到这里，扎克伯格突然豁然开朗。\r\n\r\n在接下来的一段时间里，扎克伯格几乎没有出过家门，虽然偶尔会照顾孩子，但大多数时间他都在幻想，幻想一个完美的系统。\r\n灵感如泉涌般，不断有新的设想冒出来，每有一个新想法，他就用画笔把灵感记录在墙上。\r\n他先想，我要做一个什么样的系统？新型的读书系统？\r\n“不，我要做一套和它理念相同，但是扩展到互联网所有领域的新系统。”扎克伯格想。\r\n于是他在墙面的正中间写下“新互联网系统”。\r\n那么，这个系统需要些什么东西呢？也许可以从用户和企业的这个角度来看。\r\n如果他是用户的话，他需要些什么东西呢？\r\n扎克伯格又在墙上分别写下了“办公”、“娱乐”、“交易”。\r\n那么他需要什么样的体验效果呢？\r\n他在墙上写下了“简单”、“安全”、“省时间”、“好玩”几个词，每个之间的距离都很大。\r\n每写下一个词，他都放开思想的缰绳，任由其奔跑。\r\n然后，他在“简单”的下面写到：“不需要我考虑所有事情，甚至不需要学习怎么操作，即使古代人来了也能懂，我只需要知道他想要什么就行。我想在网上买东西时，最好是像现实中一样，看中了一样东西只要把钱掏出来递过去就可以了。实现：把所有多于3步的操作全去掉。”\r\n又在“安全”下面写到：“1，我的隐私要有一套最先进的保护系统。实现：也许可以把存有用户信息的数据库独立出来，交给政府监管，具体还要和专家们商量。”\r\n“2，我的钱不会丢。实现：人像识别、指纹识别、声音识别、密码识别。”\r\n在“省时间”的下面，他写到：“把所有浪费时间的东西全去掉，不需要下载一晚上的电影，也不需要每隔一段时间就安装新的系统，更不要无限地配置软件的参数。实现：能一口气实现这些的，也就只有云技术了！把东西全放在网上，对用户来说就没有下载的概念了；在云端把新系统都安装好，参数都配置好，我只要直接用就行了。”\r\n在“好玩”的下面，他写到：“不用考虑自己的电脑够不够配置玩最新的游戏，所有的游戏我都可以玩。实现：云技术。”\r\n\r\n扎克伯格又想，如果从软件、硬件这个角度来看呢？\r\n然后他在墙面写下了“硬件”和“软件”。\r\n“硬件”下面他写到：“最好是又薄又大又轻，看得清楚，又好随身带着。哦对了，还要待机时间长的！实现：也许我可以考虑一下电子纸的技术。”\r\n“软件”下面他写到：“1，必须要消灭平台的区别。我可不想在Windows平台的电脑上办公，又跑去安装了苹果平台的电脑上画画，然后又在Linux平台的电脑上弄服务器。实现：做一套完美兼容所有平台的平台。\r\n“2，如果每个软件之间不是互相独立的，而是都能像哥俩一样的互相配合，那该多好啊！实现：要求每个软件都提供一些接口，允许别的软件借用。”\r\n\r\n写到这里，扎克伯格非常有成就感，他沉浸在了自己的想象世界里，仿佛他已经来到了未来的那个世界一样。\r\n他从文件柜里拿出《读书系统的革命》，继续从里面找灵感。\r\n文中有一部分提到如何解决用户搜索的问题，也就是说用户想知道一些事情，系统怎么根据他的提问给出解答？\r\n这个问题在论文中分为两个方面做了讨论，一个是搜索引擎的方面，一个是存在于互联网上每一条信息的识别问题。\r\n扎克伯格照着论文在墙上写下：“1，搜索引擎要像一个有智慧的老人，能听懂人的话，然后回答人的问题。实现：看来我得找一帮语义分析专家来了。\r\n“2，就照论文说的，把互联网的每条信息按照神经元的结构联结起来，抛弃树形结构。实现：把论文里设计的QBD做出来。”\r\n扎克伯格接着在论文里找灵感。这时他看到了书籍购买的部分，这里重点设计了新型物流系统。\r\n于是他在墙上写到：“新物流系统。必须要更快，要更便宜。实现：就按原文里设计的来。”（注：物流部分在论文中做了非常详尽的讨论，为了节省空间，扎克伯格在墙上并没有写出来。当然，后面我们还会提到它的具体内容。）\r\n\r\n将论文中主要的灵感都画在墙上后，扎克伯格脑袋里的那匹思维之马似乎有些累了，于是它放慢了脚步，只是一遍又一遍的重新看已经画在墙面上的内容，看看有没有需要补充的地方。\r\n当他看了几遍“安全”那一部分区域时，发现眼睛始终很难离开“个人隐私”的那个字眼。然后他走到那个词的面前，试图再扩展一下。\r\n“隐私——个人信息——姓名，年龄，婚姻，职业，家庭，朋友，学校……”\r\n顺着思路写到这里，他突然灵光一闪，重重地拍了一下自己的脑袋。\r\n“哎呀，这么重要的东西我怎么没注意到！”\r\n扎克伯格提起画笔，脸上出现了一个诡异的笑容，把上面的那些词用一个大圆圈勾上，然后用一个大大的箭头指向一个空白处，又画了一个空心圆圈，并在里面写下：\r\n“Facebook，人类信息库。”\r\n一个月过去了，他把书房的墙面画得乱七八糟，到处都记录着新想法。直到墙面都画满了，他想：“差不多了，下一步就看要怎么实现了！”\r\n于是又花了一个月，他把整理好的灵感一条一条列出来，然后逐个上网查询可以实现的方法。如果网上查不到，他就让秘书联系相关领域的专家，到他的家里来做客。\r\n\r\n时间过得很快，虽然每天都很忙，扎克伯格却感到了前所未有的开心，这种史无前例的挑战就像赛车一样，紧张刺激，却很高兴。\r\n出乎意料的是，他所有的设想，在技术领域都是可以实现的，甚至很多是已经实现却鲜为人知的。他本以为那么多的幻想可能只有不到50%是可以实现的，搞不好其他实现不了的都要重新构思了。但是与众多专家的对话，让他看到了前方的属于胜利的强光。\r\n\r\n到了这里，前期创意，和技术可行性都已经完成了。接下来就不是靠他一个人能够完成的了，必须要成立一个团队才行。\r\n当然，在凑齐团队之前，先要给团队起个名字。那么，叫什么好呢？\r\n他再次翻阅了那篇论文的档案，看到那封匿名提交的邮件，发信地址是Leonard_Elric@163.com，难道作者的名字叫Leonard Elric？\r\n论文的标题是读书系统的革命，那结合起来的英文就是Leonard Elric’s Revolution Of Reading System，简写是LERORS。想到这里，扎克伯格有种小孩子玩文字游戏的愉悦感。\r\n最终确定下来，团队叫LERORS团队，而他们要执行的计划代号就是Project-L。\r\n下一步，就该凑齐队员了。\r\n\r\n第十节 麦肯锡\r\n麦肯锡是一家在美国成立了近百年的商业管理咨询公司，也是全球最大的战略咨询公司。直到今天，他们已经帮助了无数企业实现了显著的、持久的经营业绩增长，并为这些企业建立了能够极大吸引人才、培育人才的优秀组织环境。\r\n麦肯锡的主要工作，一般是调查企业所在的市场环境、政治环境，以及企业自身的所有信息，然后得出一个适合的发展方式。\r\n简单来说，麦肯锡就是一个“军师”——要想在商业战场上获得胜利，是不能缺少这样一个好军师的。\r\n\r\n扎克伯格，正是意识到了这点，所以第一个要找的就是麦肯锡。\r\n这天，扎克伯格来到了麦肯锡的总部。\r\n由于之前做过预约，麦肯锡已经知道这天扎克伯格会来访。像扎克伯格这样响彻商界的大人物，即使对于麦肯锡来说也是非常大的客户。为此，他们早就提前准备好了咨询团队，包含了相关领域的资深专家，等候着扎克伯格的来临。\r\n刚走进麦肯锡的大楼，扎克伯格就被热情的引导员小姐领到了楼上的会议室。扎克伯格看到，会议室此时已经坐好了七八个穿着整洁西装的中年男子，一眼看上去就知道是些很有经验的专家。\r\n他们一看到扎克伯格进来，就立马站了起来，向他表示热烈的欢迎。\r\n安排好了扎克伯格的座位后，每个人也都坐下。\r\n这时麦肯锡的咨询主管Mike说：“非常高兴您的到来，扎克伯格先生。在此前的电话里，您说想做一个很大的互联网项目，是吗？”\r\n“是的，我整理好了一份大概的提案，如果可以的话，”扎克伯格说“我想请你们协助我一起完成这个项目。”\r\n然后扎克伯格从皮包里拿出了那份提案，交给了麦肯锡的工作人员，并复印分发给每个在场的咨询专家。\r\n十几分钟过去后，出现在每个人的脸上又是那种熟悉的表情。这让扎克伯格想起了自己离开Facebook前一天在会议室出现的那种表情。\r\n接下来又是漫长的沉默，气氛很是浓重。\r\n主管Mike打破了沉默：“扎克伯格先生，这可是一个非常宏大的项目啊！恕我直言，我在麦肯锡三十年，参与过数不清的项目，但还没有一个像您所提出的这样大胆。”\r\n“也就是说，你们办不到了？”扎克伯格严肃的看着Mike。\r\n“我们并没有那么说，只不过。。。”\r\n“如果有那么容易做到，我还会找你们吗？”扎克伯格有点生气了。\r\n“这个。。。”\r\n此时Mike以及在座的咨询专家们想的是，这个不可能的任务，如果他们接手了，却完不成，就有面临收不到费用的风险；而如果不接手，又白白错失了扎克伯格这个少见的大客户。所以此时会议室的气氛变得更加凝重了。\r\n突然，其中一个咨询专家用力地咳嗽了两声，所有人的目光都集中到了他的身上。\r\nMike说：“James，你有什么意见吗？不妨直说。”\r\n“好的，”James说，“我觉得大家不必悲观，如果这个项目交给我做的话，肯定没问题！”\r\n听到这里，扎克伯格的眼睛亮了起来，看着这个样子有四五十岁的中年男子，他脑袋的头发已经稀疏，面容也没有其他人显得精神，反而是目光中有一种别人少有的坚定。\r\n同时，其他专家也抱着怀疑的目光看着James，他们都知道，James的业绩并不好，而且参与过的大项目也很少。面对这样史无前例的扎克伯格提案，James说交给他就能完成，其他人怎么能信服呢？\r\n“很好，James，但是，”Mike转过来对扎克伯格说，“您的这个提案远超出了我们的预期，我们很难立刻做出答复，如果可以的话，我想再商量一下再给您一个答复好吗？”\r\n“不行，”扎克伯格摇摇头，“必须现在答复我，如果你们连这点勇气都没有的话，我可得找别人来做了。”\r\nMike眉头紧锁，他心里很是焦虑，到底选择哪边呢？做，还是不做？哪边的风险都很大啊！\r\n正当Mike犹豫不决时，James又咳嗽了两声：“Mike，诸位朋友，我以我的职位做保证，如果这个项目全权交给我做，肯定能成功！如果不行的话，我愿意主动辞职！”\r\nMike不知道这个平日沉默寡言的James为何今天突然如此激动，仍然很难做出决定。\r\n“哈哈哈，”扎克伯格站起来，走到James身旁，拍着他的肩膀说，“我需要的就是你这种激情！”\r\n扎克伯格接着说：“请大家不要担心，来之前我已经想好了。如果你们愿意协助我完成这个项目，我愿意给你们出一个肯定会满意的费用。如果成功了的话，我还可以按营业额的比例给你们提成，你们看？”\r\n听到这里，Mike当机立断，起身握住扎克伯格的手：“好的，就这么定了！”，然后也拍了拍James的肩膀，说：“这个项目就是你的了，千万不能给我们麦肯锡丢脸啊！”\r\n其他人向James投来了嫉妒的目光。要知道，麦肯锡以往接受的咨询项目，通常是以固定费用，如几千万或大的项目上亿元为固定费用的。而像扎克伯格提出的以营业额的一定比例为咨询费用，简直就和当股东一样，一旦成功，将为麦肯锡带来庞大而持续的利润。\r\n这个诱惑，是任何人都不能抵挡的。\r\n\r\n合同当天就签好了，当中规定了麦肯锡必须对扎克伯格的项目绝对保密，知情人限制在在场以及总部高层在内的十人以内；同时还规定，麦肯锡团队对该项目全时跟进，知道完成为止；扎克伯格身为乙方负责麦肯锡团队的所有费用；麦肯锡团队由James全权指导，具有甲方团队的最高指挥权和最优先选择成员的权利等等。\r\n当天晚上，扎克伯格单独约了James到附近的一家餐厅。\r\n“为什么你这么肯定能成功呢？”扎克伯格问。\r\n“我并没有百分之百的把握。”James回答。\r\n“什么？那你怎么敢接这个任务？”\r\n“说实话，我也是背水一战了，”James说，“Up or Out，你知道吧？”\r\n“我听说过，麦肯锡的’不进则退原则’吧。”\r\n“是的，我的业绩测今年一直不太好，如果再不创造些业绩，我就会被辞退。”\r\n“只因为这个你就接了我的案子？”扎克伯格说。\r\n“嘿嘿，”James眼睛亮了起来，“扎克伯格先生，你认为我也是那种只以利益衡量一切的人吗？刚看到您的那个提案的前几段，我的血就久违地沸腾起来了！”\r\n“果然，你像我想象的那样，具有我需要的特质。”\r\n“我了解你的想法，我想我们都是对梦想有激情的人，”James说到，“你别看我是个中年人，这方面我可不比年轻人差。我年轻的时候，也梦想要改变世界，但一直没有碰到机会。当你的提案摆在我的面前时，命运告诉我，我的机会来了。”\r\n扎克伯格看着眼前的这个麦肯锡专家，勇敢、素质、经验，似乎已经能看到梦想实现的场景了。\r\n“那么，你看，我们下一步应该怎么做呢？”扎克伯格问。\r\n“召集团队。”\r\n“哈哈，我们想到一起去了！”\r\n“这个项目不一般，我们要做好长期的准备。”James严肃的说。\r\n“那你看要多久才行呢？”\r\n“一两年太短，不太可能，十年又太长，等实现就晚了，所以我们的目标定在六年以内比较合适。”\r\n“六年！哈哈哈！”听到这里，扎克伯格乐开了花。\r\n他给麦肯锡的提案里并没有《读书系统的革命》的内容，而James却提出了和那篇论文作者一样的观点，让扎克伯格刮目相看。\r\n“那么，六年这么久的项目，我们要召集什么样的团队呢？”扎克伯格接着问。\r\n“依我看，这个项目首先是属于绝密级别的，一旦让竞争对手们知道一点消息，对我们来讲都是极其不利的，”James说，“所以要进行这么长期的暗中开发，核心队员最好是些年轻的肯长期在脱离与外界联系的人，当然，对他们的个人素质要求也必须相当高。”\r\n扎克伯格专心的听着。\r\n“另外，要涉及到那么多别的企业合作，而能长期保密，这也是个难题。”James说。\r\n“的确，还是你考虑的全面，目前为止我光是幻想，却没想到这些问题。”\r\n“没关系，既然我们要做，就肯定会遇到这些问题。这个问题就交给我了，你放心吧。”\r\n扎克伯格点点头，他想到，自己第一步就去找麦肯锡真是幸运，这是个再正确不过的决定。\r\n“还有，最重要的问题，资金方面，”James说，“据我估计，没有数十亿是不可能完成的，这个你怎么解决？”\r\n“这个你不用担心，我的公司可以提供一部分，我自己也会变卖一部分股份，另外还可以找到合适的赞助商。”此时，扎克伯格的心里已经有了一个最合适的赞助商。\r\n“那么好吧，下一步呢，我这边先集齐商业调查的团队，你那边也挑选一些技术相关的核心队员，然后把资金的事确定下来，我们就可以开始正式行动了，你看怎么样？”\r\n“好的，就这么办！”扎克伯格激动的说。\r\n\r\n第十一节 命运的结合\r\n第二天，正当James反复查阅麦肯锡在美国各分部的年轻咨询师时，扎克伯格也没闲着。他从纽约坐飞机来到了加州库帕提诺市。我们都知道，这正是苹果公司总部的所在地。\r\n果然，他走进了苹果总部的大门，由董事会长莱文森亲自接待，走进了一间办公室。\r\n由于此前扎克伯格已经打过招呼，所以此次会见非常隐秘，只有他和莱文森两个人。\r\n莱文森，接替了已去世的乔布斯成为苹果公司的董事长。\r\n他的经历也很传奇，莱文森上世纪毕业于普林斯顿大学，获得了博士学位，之后又以科学家的身份加入基因科技公司。在一系列不断的科学创新后，将濒临破产的基因科技公司变成了一家生物领域巨擎，创造了华尔街神话。\r\n进入20世纪时，他又先后担任了谷歌公司的董事和苹果公司的董事。直到2011年11月，他被任命为苹果公司的董事长。\r\n总之，这个商界的科学家正是以创新而出众，始终坚持尊重科技的本质，相信科技才是成功的根本。他的这种商业理念，另乔布斯也极为尊重和推崇，莱文森因而也被乔布斯当作良师益友。\r\n\r\n这一天，69岁的莱文森在办公室里接见了扎克伯格，他有预感这是一次改变命运的会面。\r\n“莱文森，”扎克伯格说，“我就直说了，我们来玩点大的怎么样？”\r\n“我们？”\r\n“对，你和我，苹果和Facebook，我们。”\r\n“那么，你想玩点什么呢？”莱文森扶了扶眼镜，换了个坐姿，专注地看着眼前的这个年轻人。\r\n“来玩点创新，怎么样？”\r\n“好啊，不过，我还是不太明白你的意思。”\r\n“具体的我先不能告诉你，不过这次我打算做一个很大的项目，大到即使是苹果也不敢想象。”\r\n“哦？”莱文森笑了笑，“真的吗？”\r\n“是的，我需要你的帮助，如果我们一起来做，成功的可能性就极高了。”\r\n“看来你已经有计划了？”\r\n“只是一个初步的计划，后面实施起来必须有你的帮助才行，”扎克伯格说，“我需要你，同时我也认为，这对你来说也是有百利而无一害的，不是吗？苹果不也正面临创新的瓶颈吗？”\r\n莱文森笑了笑，然后沉默了一会。如果在平常，一个同行说自己面临瓶颈，是明显的挑衅行为，那绝不是一句好话。\r\n但是这次，莱文森没有马上反驳，他有一种异常的感觉。\r\n事实上，在乔布斯去世后，苹果无论怎么努力，都很难创造出一个让人满意的产品，当然这有很大一部分因素是为所有人都对苹果的要求太高了，几乎时时刻刻都拿他和曾经辉煌时期来比。另一方面，对于一个以创造性而生，并因此站到市场之巅的企业来说，创意不够也是致命的。\r\n扎克伯格的到访，也许对于他们来说是一个重要的机会呢？莱文森决定还是先试探一下。\r\n“呵呵，你光是这么说的话，我也很难决定什么啊。”\r\n“当然，”扎克伯格说，“这样吧，你看看这个。”\r\n扎克伯格从皮包里拿出了那篇《读书系统的革命》，递给了莱文森。\r\n由于扎克伯格的提案是一个绝密的商业计划，因此他只拿出了带给他灵感的论文。当然，这篇论文也是经过了部分调整的，隐藏了关键的内容和细节，只保留下来了概念部分。\r\n莱文森接过论文，简单的翻了翻，翻到第三页时，似乎想到了些什么，又翻回了第一页，这次是很认真的看了起来。\r\n扎克伯格捕捉到了莱文森眼神的变化，那神情和当初自己刚发现这篇论文一样。\r\n能对《读书系统的革命》这种纯粹理论性概念如此重视的，也就只有像他们这种级别的精英能够做到，因为那些看似不可能的东西也只有在他们面前才变得有价值，才变得可能实现。\r\n\r\n莱文森缓慢的合上了论文的副本，沉稳地看着扎克伯格，说：“这就是你想做的吗？”\r\n“当然不是，”扎克伯格面带狡黠地说，“这只是其中的一小部分而已。”\r\n“哈哈哈，扎克伯格，看来你是想做一个不得了的东西啊！”莱文森的表情比此前要热情了很多，少了一些戒备。\r\n“那么，做不做？”\r\n莱文森没有直接回答他，而是站了起来，走到了窗边，凝视着窗外的苹果园区独自出神，扎克伯格也没有催，因为他知道，这是个非常重大的决定。一旦确定下来，将是个非同小可的事情，它将主导未来两家公司的命运，甚至是整个市场的命运。\r\n扎克伯格注视着墙上的钟，分针转了两圈。\r\n“如果我不同意呢？”莱文森仍然看着窗外。\r\n“那么，我会立刻取消这个项目。”扎克伯格很快地回答。\r\n“哈哈，真的吗？”莱文森转过身来，表情却很严肃地看着扎克伯格的眼睛。\r\n“是的。”扎克伯格坚定的回答。\r\n“为什么？”\r\n“这么重大的项目，如果还没开始运作就被你们苹果知道的话，对我们可不妙啊，哈哈。”扎克伯格同样面无表情地说。\r\n对话再次陷入了沉默。\r\n可以说，这是两个全球最著名的企业家之间的巅峰对话，看似平凡的对话，却暗含着许多的话中话。描述起来的话，更像两个棋术高手的对弈。\r\n“我有什么好处？”莱文森仍然很谨慎。\r\n“莱文森先生，”扎克伯格站了起来，“我一直以来都对您很敬仰。我想我们都是同道中人，我们可以在当前这种纷乱的局势中共同依靠，所以才特地来见您。对您有什么好处，我想您已经很清楚了，不是吗？而那些具体的利润分成，就交给商务部门去处理吧，我相信他们会做得让大家都满意。今天我来，只想得到您一个答复，做，或不做？”\r\n莱文森没有再次沉默，而是直视扎克伯格的眼睛，5秒钟。然后他向扎克伯格走了过来，伸出了右手：\r\n“我想我们可以达成一致了，不是吗？”莱文森脸上终于出现了真正伙伴一般的笑容。\r\n“哈哈哈，欢迎你，莱文森，我的朋友！”扎克伯格也开朗地笑了起来，热情地和莱文森握手。\r\n那一天，是2013年9月1日星期日，值得载入历史的一天。在那一天，受命运之神青睐的两家企业结合了。\r\n第十二节 加州远征队\r\n“也就是说，”Sam喝了一口已经冰凉的咖啡，坐在这栋神秘的建筑物的一楼大厅中，正听着扎克伯格讲2013年的故事，“苹果的董事长，莱文森，答应了跟你合作？”\r\n“是的，”扎克伯格也喝了一口咖啡，讲了这么多，他已经口干舌燥，“刚过了一个礼拜，我们就谈好了所有的商务事项，签好了合同。”\r\n“这么重要的事情只在一个礼拜就签好合同了？”\r\n“当然，莱文森做事雷厉风行，而且我提供的可行性报告也很容易让人信服。”\r\n“呵呵，那份报告一定是麦肯锡的功劳吧？”\r\n“是的，”扎克伯格说，“James这个人看上去好像是个要退休的中年人似的，做起事来还真让人不得不佩服。”\r\n“那么，我想问一个问题，”Sam说，“我想知道，您到底最后筹集到了多少钱？”\r\n扎克伯格竖起了三个手指。\r\n“什么？只用了三千万！”Sam惊讶的看着扎克伯格，此时他的脑海中闪现了无数个在经济学课堂上老师举出过的“小投资造就大奇迹”的商业案例。\r\n“嘿！Sam，你在开玩笑吧！”扎克伯格看似生气的喊道。\r\n“什么？”\r\n“30亿！”\r\n“30亿！”Sam近乎失控地喊出着那个数字，他感到自己的五脏六腑都沸腾了起来。\r\n“30亿！”Sam再一次重复道。\r\n“没错，”扎克伯格说，“难道你以为这只是个三千万的小项目吗？别忘了，持续了六年，庞大的开发团队，高度隐蔽，尖端科技，企业公关，你以为多少钱能够维持这些东西的正常运作？”\r\nSam已经无法言语。这时他想起了第二次与扎克伯格见面，并向他提出了一个现在看来愚蠢之极的问题：“您是怎么做到仅在10个月内就完成这么一部智能机器的？”\r\nSam冷笑了几声，暗嘲自己的无知。如果当初他能再多动动脑筋的话，怎么想都知道，这不是一两年能做出来的东西。\r\n\r\n“你认为，”扎克伯格喝了一口咖啡，“科技是什么？”"},{"url":"https://api.github.com/repos/solomonxie/solomonxie.github.io/issues/comments/383297585","html_url":"https://github.com/solomonxie/solomonxie.github.io/issues/17#issuecomment-383297585","issue_url":"https://api.github.com/repos/solomonxie/solomonxie.github.io/issues/17","id":383297585,"user":{"login":"solomonxie","id":14041622,"avatar_url":"https://avatars2.githubusercontent.com/u/14041622?v=4","gravatar_id":"","url":"https://api.github.com/users/solomonxie","html_url":"https://github.com/solomonxie","followers_url":"https://api.github.com/users/solomonxie/followers","following_url":"https://api.github.com/users/solomonxie/following{/other_user}","gists_url":"https://api.github.com/users/solomonxie/gists{/gist_id}","starred_url":"https://api.github.com/users/solomonxie/starred{/owner}{/repo}","subscriptions_url":"https://api.github.com/users/solomonxie/subscriptions","organizations_url":"https://api.github.com/users/solomonxie/orgs","repos_url":"https://api.github.com/users/solomonxie/repos","events_url":"https://api.github.com/users/solomonxie/events{/privacy}","received_events_url":"https://api.github.com/users/solomonxie/received_events","type":"User","site_admin":false},"created_at":"2018-04-21T13:59:54Z","updated_at":"2018-04-21T13:59:54Z","author_association":"OWNER","body":"# 《读书系统的革命: 第六版》2013年\r\n——由图书产业链的结构重组引起的技术革命\r\n\r\n\r\n\r\n目录\r\n（正文部分 第六版）\t2\r\n第一节 发布会\t2\r\n第二节 秘密\t5\r\n第三节 一篇报告\t9\r\n第四节 神秘礼品\t13\r\n第五节 线索\t18\r\n第六节 北京\t22\r\n第七节 扎克伯格与乔布斯\t27\r\n第八节 秘密协议\t30\r\n第九节 Project-L\t33\r\n第十节 麦肯锡\t38\r\n第十一节 命运的结合\t41\r\n第十二节 加州远征队\t43\r\n\r\n\r\n\f（正文部分 第六版）\r\n\r\n第一节 发布会\r\n2019年10月1日，位于美国加州库珀蒂诺市——苹果公司总部的Town Hall Auditorium礼堂中，正在举办一场新产品发布会。\r\n这次的发布会规模宏大，从总部的室外和礼堂的内部装潢上来看，似乎苹果为这次的发布会的准备做了不少工作。\r\n这里聚集了全球几乎所有知名媒体人以及资深业内人士。\r\n苹果公司在一个月前，给这些指定的媒体和同行统一发了一封邀请信，内容很简单，只是说这次新产品发布会将掀起一场风暴。\r\n时代周刊的资深记者Andy与实习生Sam在礼堂门口领取了一张参会牌挂在脖子上，同时挂在脖子上的还有几个厚重的摄影器材。两个人在人群中穿梭，终于占据了一个有利的拍摄地点。\r\n发布会还没开始，Sam放下了沉重的设备，“Andy,怎么回事啊，怎么会有这么多人？上次我和你去三星的发布会时可没有这么热闹呢。”\r\nAndy拍了几张会场的照片后，也放下了设备，回答说：“怎么你不知道吗，那封邮件。”\r\n“邮件？”Sam好奇地问。 \r\n“对了，因为你才来没多久，所以没有告诉你，”Andy从小包里掏出了一个比手掌要大很多的三星手机，点了几下，“你看，这是一个月前苹果发给我们的邀请信。”\r\nSam看到手机上正显示着一封邮件，内容只有简单的一句话：“苹果公司邀请您参加2019年的新产品发布会，共同鉴证这次科技大革命。”\r\nAndy接着说：“你可能不知道，苹果这两年经营的很不好，股票连续下跌，”然后Andy指了指礼堂门口的一个挂立海报，“然后他们决定请那个人来管理公司。”\r\nSam顺着他的手看过去，然后惊讶的说到：“那个，不是扎克伯格（全球顶尖社交网站Facebook创始人）吗！怎么会让他来苹果公司了？”\r\n“Sam，”Andy说道，“记住，你是一个记者，这么重要的消息怎么能不关注呢？”\r\nSam羞愧的低下了头。\r\n“扎克伯格在年初的时候发表了声明，说他不愿意总是维护同一个产品，那太枯燥了——没有什么挑战性，”Andy说，“所以他辞去了Facebook网站的CEO职位，只保留原有股份，打算趁着年轻挑战一下。”\r\n“然后呢？”Sam问。\r\n“然后，没几天苹果公司就发表声明说将聘用扎克伯格做新一任CEO，希望用他的年轻勇敢和创新能力，带领苹果重返光荣。”\r\n“所以说，”Sam兴奋的说，“这次是要发布扎克伯格上任后第一个产品了？”\r\n“是的，”Andy答道。\r\nSam满怀憧憬地看着那篮球场般大小的演讲台，“真想知道十几年前的那个震惊了全世界的怪才，这次又能带来什么惊喜！”\r\n“是啊，在场的所有人都和你一样的想法。”\r\n\r\n在发布会正式开始前，请让我先介绍一下当时的背景。\r\n有心的读者也许还记得，在本世纪的前十年里，苹果的智能手机iphone和平板电脑ipad以绝对的优势占领了全球的市场。\r\n然而随着2011年苹果的灵魂人物乔布斯去世，苹果的优势直线下降——再也没能发布什么吸引人的产品。这个时候，同样是科技产品巨头的三星公司抓住了这个机会，投入了近10亿元的研发经费，发誓要取代苹果的地位。\r\n效果很快就显现出来了，之后的几年里，三星发布了一系列新产品，无论是硬件配置还是功能操作上，都领先了其他竞争对手很多，同时成本也要低很多，因此快速的占领了市场。\r\n到了2018年，三星更是发布了新型Note X平板电脑，不但完美的结合了手机和电脑的所有优点，甚至还创造了不需要插电话卡就可以让移动设备随时随地联网的技术，这项技术不但取消了电脑和手机的区别，还引领了当时所有科技设备厂商的潮流。\r\n更重要的是，他们将价格定在1999元——这简直是同类产品中不可想象的超低价格，三星就这样踢掉了所有的竞争对手，成为了市场第一。\r\n这个时候，无论是昔日软件巨人——微软、搜索巨匠——谷歌还是潮流先锋——苹果，发布的产品都无法与三星匹敌。他们的产品不是创新不足，就是价格太高，怎么追赶都总是慢一拍。\r\n而三星的这些竞争对手中受到打击最大的，就是苹果公司了。因为他的大部分利润都来自于屈指可数的几款手机和电脑，另外一部分销售软件的利润也被三星打败了。因为苹果的IOS系统是不开放的，而三星使用的安卓系统是完全开放的，这样一来就吸引了苹果无法比拟的大量自由开发者，创造出了无数免费而又好用的软件。\r\n一家著名的财经分析频道中出现了这样的一条消息：\r\n在连续12个月的销售额下降和股价下跌后，苹果公司终于按耐不住了，记者在采访董事长莱文森时了解到，苹果正准备动用一切资源来场大的改革，否则将会很难生存下去。\r\n几乎就在同时，苹果公司得到了扎克伯格辞职的消息，于是就有人提议，如果能请来那个曾经震惊了世界的天才的话，也许苹果还有的救。他不但胆子大敢于创新，又有足够的能力和精力，就像曾经的乔布斯一样。\r\n董事会当机立断，请来了扎克伯格商谈，扎克伯格马上就答应了。2019年1月7日苹果公司郑重其事地对媒体宣布，任命扎克伯格为新一任的苹果CEO。\r\n\r\n10个月过去了。\r\n大礼堂的灯光忽然暗了下来，只照亮了演讲台上的一角。这时出现了一个人，踩着滑板滑到了讲台。台下顿时掌声雷动——这就是扎克伯格。\r\nSam看到，这个穿着一个休闲短裤和灰色T恤并且踩着滑板的滑稽的男人，就是那个传说中的扎克伯格。\r\n这个出场真是让人眼睛一亮。\r\n扎克伯格敲了两下话筒，清了清喉咙：“大家好，我是扎克伯格，”他带着点调皮的表情说，“发布会结束了，你们可以回去了。”\r\n会场上顿时一片哗然。\r\nSam瞪着大眼睛问身旁的Andy：“怎么回事，发布会明明还没开始啊！”\r\nAndy哈哈大笑，说：“你太不了解扎克伯格了，他就是喜欢搞怪！”\r\n果然，扎克伯格大声地说：“嘿嘿，我是开玩笑的。但是我敢说，从某些方面来说发布会已经完成了，”他指了指脖子上挂着的那个像员工牌一样的卡片，“我想你们刚才在进礼堂的时候都领到了这张卡片，那么现在请你们把它举起来给我看看。”\r\n听众们不知道这是怎么一回事，但还是照着他说的做了，纷纷将已经取下的准入牌举起来。\r\n“然后请你们在空中摇一摇手。”听众们虽然觉得有种被耍的感觉，还是照着他说的摇了摇手。\r\n突然，他们听到一连串咔嚓咔嚓的声音，手中像银行卡片的东西突然亮了起来。Sam看到手中的卡片正发着亮光，并显现出了一个像手机一样的操作画面。\r\n所有人都惊呆了。“哇塞！”“好酷！”台下一片热闹，很多人甚至忍不住兴奋地叫了出来。\r\n扎克伯格解释说，在每个人进大厅时领取的并不是一张普通的参会卡，而是苹果团队研发的新式智能手机iphone card。\r\n它的屏幕并不是我们常见的液晶屏幕，而是采用了最新的电子纸材料，亚马逊公司的Kindle阅读器就是采用的电子纸方式。如果我们不仔细看的话，很难认出来它是一个屏幕。\r\n以往虽然有产品采用了电子纸，但是为了给其供电、照明、加键盘等，大大增加了厚度，并没有很好的发展。而扎克伯格首次将这种电子纸真的做到接近纸那么薄，而且还是可以触摸操作的界面。\r\n可以说在当时这已经是足够震撼的科技了，难怪会场上的人会那么惊讶。\r\nAndy一脸无奈的说，“果然是扎克伯格的风格，我们又被他耍了！”\r\n然而他却感到很兴奋，毕竟不是所有人都能够见证这样的科技产品发布的——还是以这种奇妙的方式。\r\n扎克伯格看着台下所有人惊讶的表情，暗自得意。他摇了摇自己的卡片，并在上面点了几下，突然所有人的卡片都响了一声。\r\n“这是我的名片，”扎克伯格说。\r\nSam低头看到手上的卡片变成了一张名片，上面只有短短的一行字——“混蛋，我是苹果CEO，你喜欢我的设计吗？”台下又是一阵哗然。\r\n只有少数几个了解他的人才知道，这是扎克伯格特有的名片。虽然被骂，但是人们都敬佩这种有才华的怪人，不会因为他的那些小小的搞怪就感到被冒犯。\r\n这时扎克伯格冷笑了一声。\r\n“我发现，你们的反应并没有我想象的那样好啊，”扎克伯格拼命忍住一脸的坏笑而假装严肃地说，“因为你们竟然现在还没有发现它的真面貌！”\r\nSam心头一紧，“真面貌？什么真面貌？”然后带着疑问的眼神看着经验丰富、见多识广的Andy，但他也只能耸耸肩表示毫不知情。\r\n扎克伯格接着说：“好吧，那我给一个提示——请你们看看，这张卡片的侧面是不是有一条切缝？”\r\n有些反应快的人立刻就叫了出来，“噢！噢！”\r\n这时人们发现，在自己手中的卡片，其实是可以展开的，就像展开一张叠过的纸一样。\r\nSam得意的看着手中2张卡片大小的屏幕，然后看看旁边Andy，惊讶的发现Andy手中的卡片竟然变成了一张报纸那么大！\r\n原来，这款iphone card全部展开时是16张信用卡大小。它像报纸一样薄，可以按照自己的需要进行折叠，最小可以折叠到1张信用卡大小，厚度也差不多。\r\n此时Sam与其他参会的人们一样，惊讶之余敬佩之心油然而生。Sam、Andy与其他记者，甚至都忘记了自己记录、拍摄的任务。\r\n扎克伯格满意的笑了起来，“好吧，说实话，其实它不叫iphone card，抱歉我对大家开了个玩笑。它正式的名字是ipaperⅠ。你可以把它看成是一个电脑，也可以看成是一个手机，当然它看起来更像是一张报纸。”\r\n只见他把ipaper小心的对折好，插到钱包的一个卡槽里，最后把钱包塞进裤兜。\r\n台下掌声雷动，记者们纷纷用专业相机记录下了扎克伯格这经典的一系列动作。\r\nSam有预感，这一连串具有划时代意义的动作将会被载入科技史册。就像十几年前，乔布斯在新品发布会上从信封里拿出一台笔记本电脑的那个瞬间一样，将被人们永远地记住。\r\n\r\n扎克伯格接着说：“那么下面，我将会请我的助手来给大家讲解一下ipaper的使用方法。在那之后我希望你们还没走，因为我想讲讲它的一个秘密。谢谢！”\r\n助手走上了台。与扎克伯格的风格截然不同，他的助手着装更加正式，更像是一个专业人士。他捧着一台展开的ipaper，借助身后的大屏幕，从它的硬件配置，到运作原理，再到基本操作，逐一地进行了讲解。\r\n人们了解到，这部ipaper的硬件配置并不高，但它不同于以往的任何一款手机或电脑，它采用的是“完全云技术”——也就是说，ipaper是一个超级显示屏幕，它的本身并没有任何存储数据的功能，而且只有很小的基础运算能力。\r\nipaper的一切功能都是通过互联网实现的。\r\n它的所有软件和数据等都存储在苹果公司分布于美国各地的大型服务器中。所有的运算工作、分析工作等等也都是由苹果公司布置在互联网上的超级计算机来负责。而这个超级显示屏幕需要做的就只有将用户的操作传送到苹果的计算机中，再通过互联网把计算机得到的结果显示出来而已。\r\n这种技术就是我们常常能听到的“云技术”。\r\n此前的云技术并不成熟，还多是单纯的“网络硬盘”形式或者如日历和阅读文字等小型软件，并没有做到完全的“云端”处理。\r\n而ipaper做到了“完全的云技术”，即“云技术”的最高阶段——将“一切”都放在网络上。\r\n正是因为这个特点，使得ipaper又轻又薄，功能强大，运行超快，并且有着对个人来说几乎无限制的存储空间。\r\n当人们了解到这一点时，已经打消了此前对扎克伯格的任何质疑，有些人互相交谈着，说这一次苹果肯定会打一场漂亮的翻身仗了。\r\n然而，在场的一些精通科学技术的人士，似乎隐隐的感到一些不同，似乎除了云技术外还隐藏着些什么更重要的内容是他们不知道的，也许这与扎克伯格所说的“秘密”有关系吧？\r\n\r\n\r\n第二节 秘密\r\n\t正当人们各自揣摩那个“秘密”到底是什么的时候，助手展示完了大屏幕上显示的最后一张幻灯片，然后说“好的，这款ipaper的基本介绍就先讲到这里。那么下面有请我们的CEO扎克伯格先生上台。”\r\n\t台下掌声响起，扎克伯格回到了台上。\r\n“那么，我来说点重要的事。你们在来之前也许都看到了我们在邀请函里的话——苹果将引领科技风暴。实际上，”扎克伯格一脸严肃地说，“你们目前为止所看到实在是微不足道的，而真正划时代的内容就隐藏在这款智能机中，刚才并没有演示给你们看。刚才我说它有一个大的秘密，就是指的它。所以，我想说的是，呃，那么，它，就，是——需要你们自己去找出来了！”\r\n“什么？”“这算什么？耍我们吗？”“混蛋！”\r\n人们各种的期望都破灭了，以为答案将会揭晓，结果却被耍了。参会的人终于忍不住了，甚至有人大骂各种脏话。\r\n“当然，可以给你们一个小提示——‘合作’。好的，谢谢！”扎克伯格说完这句话后，潇洒的转身就往台下走，根本不顾会场上闹哄哄的抗议声。\r\n这时他又好像意识到了些什么，返回了台上，对着话筒说：“噢抱歉，我忘了说，这款智能机的售价定为9998元。谢谢！”台下顿时又沸腾了，人们简直不相信自己的耳朵。\r\n扎克伯格一声不吭的走下台，脸上带着很满意的表情，似乎所有的一切都在他的计算中一样。然后从礼堂的侧门出去了。\r\n助手再次上台，说：“请大家安静一下。不好意思，扎克伯克先生希望我告诉大家，关于这款智能机的秘密，也就是它最与众不同的地方，找到正确答案并最先投稿到我们官方邮箱中的人，将会收到苹果公司特别赠送的一份豪华大礼。至于更具体的信息，我们将会在日后发布在官方网站上，请大家留意。那么，发布会到此结束，谢谢！”\r\n\t助手下台后，看到每个人的脸上都显示着沮丧。\r\n工作人员回收了每一部ipaper——当然，这么贵重的东西不可能免费的送给每个人。\r\n\t\r\n\t将摄影器材放置到汽车的后备箱里，Andy插进钥匙启动汽车，准备回公司准备新闻。\r\nSam正坐在副驾驶座位上垂头丧气，仿佛受到了很大的打击。“我真想不明白，扎克伯格怎么能这样做呢？这可是他上任后发布的第一个东西啊，难道他不怕这样耍人惹怒了大家吗？怎么说在场的也都是些有头有脸的人物嘛！为什么不能好好的说出来呢？还有为什么要定价那么贵呢？他不怕卖不出去吗？”\r\nAndy一声不吭的听Sam在那里抱怨，然后说：“好了Sam，如果不加上最后的那一段， 你认为这场发布会怎么样？”\r\nSam答道：“恩，如果不包括最后的那一节，可真是一场精妙绝伦、前所未有的发布会！我敢说那小子是个名副其实的天才！但是他后面的举动简直毁了它！”\r\nAndy说：“你错了，Sam，其实最后的那几句话，才是点睛之笔！那才是天才之作！”\r\n“怎么说？”\r\n“你动动脑子，你想想他为什么要这么做？”\r\n“呜，也许就像你说的，他就喜欢搞怪吧！”Sam说。\r\n“不是的。他不会做这种毫无意义的事，实际上那是一种策略。”\r\n\r\n\t回到报社后，两个人向主编详细的说明了整场发布会的经过。然后主编决定尽快将这个消息发布出去。\r\n忙完这项工作已经是深夜了，Sam回到家中，洗漱完毕后躺在床上，怎么也睡不着。\r\n\t他现在满脑袋想的都是那场发布会的事，整个过程太有趣了，跌宕起伏，仿佛刚刚亲身体验了一部奥斯卡冒险电影。他想起了发布会结束后，在汽车里Andy对他说的那些话。\r\n\t“那是扎克伯格的策略，”Andy把汽车钥匙拔下来，认真的对Sam说，“为什么他不直接告诉我们那个秘密，而是让我们自己去找呢？你好好想想。”\r\nSam毫不犹豫的说：“你说过的，他就是喜欢这样搞怪啊，那样让他很爽不是么！”\r\n“不对，你再好好想想。”\r\n“不对吗？那我再想想，”Sam低头想了一阵子，然后抬起头，恍然大悟般说，“啊！给大家一个悬念，让所有人都好奇的去找答案，这样就能扩大新产品的影响力和知名度了！”\r\nAndy微笑着说，“没错，不愧是常青藤的高材生。这下你又学到了一招吧！这就是利用了群众的好奇心理——这也是营销的技巧。”\r\nSam说：“那为什么他要定那么高的价格呢？一般的手机或平板电脑不会这么定价啊，而且现在市场上都在打低价牌，他这么做不是把客户都吓跑了吗？”\r\nAndy并没有马上回答，而是思考了一会儿，然后摇摇头，说：“这个我也很难确定，虽然市场上有靠提高价格来增强产品销量的例子，但是目前市场竞争这么激烈，三星更是推出超低价的Note x系列让这些厂商争的你死我活，拼命了要降低成本来打价格战。这个时候苹果做出了这样反常的举动，定出比同类产品高出几倍的价格，真是让人捉摸不透。”\r\nSam应声说，“是啊，到底怎么回事呢？”\r\nAndy说：“要说苹果愚蠢也不对，他们的营销策略一向都很厉害。也许这里还隐藏着什么故事呢？”\r\nSam说：“不会是和那个‘秘密’有关系吧？”\r\nAndy说：“恩，有道理，也许真的和那个‘秘密’有关系。”\r\n“那会是什么呢？”\r\n“他这个谜题太深奥了，我连一点想法都没有。”Andy回答道。\r\nSam头一次看到Andy被难住的情况，说：“呵呵，也许只有买一台来试试才能知道答案是什么了。”\r\nAndy说：“是啊，也只能这样了。嘿嘿，瞧，这不正是让你想买一台吗？”\r\n\tSam在床上辗转反侧，反复的想着那个“秘密”是什么。扎克伯格的提示是“合作”，什么合作？与谁合作？怎么也想不通。想着想着，就睡着了。\r\n\r\n\t第二天早上，Sam一到公司，就被总编叫到了办公室。他看到Andy也坐在那。\r\n总编说：“Sam，你才来公司没有多久。昨天是你参加的第一次新品发布会，说说你是怎么想的。”\r\nSam想了想，大致的说了一些当时惊讶的心理，然后说：“扎克伯格的这些行为看起来是搞怪，其实大有内容，”他说到这里眼神亮了起来，看着主编说，“我认为，如果我们能抢在别人前面把这些内容挖掘出来，那就是一个大新闻！”\r\n主编看着Sam因为激动而微微泛红的脸，沉默了一小会，然后点点头说：“恩，很好。那么这就作为你的第一个专题，我希望你能赶在别的媒体之前把它做出来，如果有什么问题可以问Andy。好了，你去准备准备吧。”\r\nSam走出了办公室，忍不住心情的激动，乐出了声——刚来几天就交给他这么大的任务，看来总编很看好他。一定要利用这个机会好好表现，如果能够做好它，就更能让主编刮目相看了。\r\n他没有回到自己的工位，而是走到了楼梯处的一个吸烟区——他需要吸一根烟好好想想。\r\n\t这时Andy走了过来，说：“恭喜你啊，Sam，一上来就有这么好的任务，看来主编很看好你！”\r\n“谢谢！”\r\n“这个机会很难得，做好了对你以后的晋升很有帮助，做不好以后也很难再有表现机会了。”Andy说。\r\n“恩知道了，谢谢你。”\r\n“好了我就说这些，有什么不懂的再来问我吧！”\r\nSam继续把剩下的半根烟抽完。\r\n\t回到座位上，他想，既然要买到一部ipaper才能够了解到这个秘密，他就要赶在别人前面买到一部ipaper。几天后，社会上已经沸沸扬扬的讨论ipaper了，当然人们更多感兴趣的是那个所谓的“秘密”到底是什么。当人们的好奇心到达极点时，苹果才宣布将在10月10日公开发售这款智能机。\r\n\t为了能够抢到ipaper，Sam决定10月9日的凌晨就去苹果零售店排队。当他披着一条薄毛毯来到零售店时，惊讶的发现这里竟然已经排了长长的队伍了！人们竟然有这么高的热情。\r\n看到这种情形，Sam没有直接走过去排队，而是先到旁边的24小时商店买了一些食物，再去排队。他回头时发现身后的人正在迅速增加，很快队伍已经看不到尾了。\r\n终于，在寒冷中坚持了近十个小后，他用公司批准的1万元顺利的在零售店里买到了一部ipaper。 \r\n上午九点半左右，他满意的坐上了一辆出租车回到公司。在自己的座位上，拆开包装。\r\n这是一个类似扑克牌大小的精致白色纸盒子，上面没有太多的装饰，只有简单的苹果标志和IPAPERⅠ这几个字。打开盒子，里面放着扑克牌大小的ipaper智能机，一根白色的专用电子笔，还有一块常见的电子充电板。\r\n他取出了这部神奇的机器，激动的启动了它。即使已经在发布会上见识过一次，他看到这部机器启动还是感叹了一番。\r\n屏幕亮了以后，显示出一个界面，和传统的苹果手机或苹果电脑的桌面没有什么不同。上面整齐的摆列着一些传统的程序软件的图标，如ibook读书软件，ebay购物软件，safri网页浏览器，supernote笔记软件等，都是最常见的软件。\r\nSam心里想，这没有什么不同嘛，只不过是硬件变了而已，操作并没有什么太大的变化吧！毕竟扎克伯格不可能在短短的十个月里就造出一部里里外外全都不同的东西。\r\n他看到界面最下方，有一个黄色感叹号的图标，标志下写着“激活向导”。\r\nSam点击这个图标，然后界面上弹出了一个提示，写着“此激活向导将用最简单的步骤将您的ipaper变成一部超级机器，确认请点击下一步。”\r\n超级机器？Sam怀着强烈的好奇点击了下一步，界面上弹出了一个输入框，要求他输入自己的社保卡号码。\r\nSam输入了自己的社保卡号码，然后点击确认。\r\n不到1秒钟，界面上就弹出了一个画面，显示：“您好，Sam　Winchester先生。您的ipaperⅠ已经激活成功！谢谢！”然后画面就自动关闭了，桌面上的黄色感叹号图标也随即消失了。\r\nSam正在纳闷到底怎么回事，行政部的同事走到他身旁，说：“Sam，该开会了，记得带上纸笔。”\r\n编辑部每天早上十点钟都会开一个例行会议，大致上就是汇报当前的工作进度并进行之后的安排，是个很枯燥的会议。\r\nSam拿起笔和本子正要站起来，突然灵机一动——他决定今天的例会不带纸笔 ，而是试试用新买的ipaper来做会议记录。\r\n走到会议室，Sam坐下来，把这部ipaper展开到4张扑克牌的大小，拿出了电子笔，准备在这部智能机器上做会议记录，体验一下它的操作到底怎么样。\r\n主编依次询问了几个新闻专题的进展情况：\r\n美国教育专题，主要是针对当前美国教育的转型和接收亚洲大量留学生问题的调查。专题组长表示，由于工作量很大，又有人员突然病倒了，所以整理数据、调查、采访等都有可能赶不上进度。\r\n中国经济体制改革的专题，是针对中国近期宣布要进行大幅度的产业结构和相关经济体制的改革而进行的分析报道。组长表示，因为中国相关专家的信服力低下，美国又很难找到对中国这次经济有研究的专家，所以很难做出客观准确的报道。\r\n欧元区实体经济专题，由于欧元区国家经济危机不断，而他们意识到靠金融是解决不了他们的问题的，所以决定要从各成员国的实体经济下手，解决问题的根本。但是组长表示，由于这个问题已经积存已久，相关评论和分析数据太多，工作量庞大。\r\n最后是苹果公司新产品的专题组，由新人Sam任组长，Andy负责监督和协助。\r\nAndy代表这个调查组发表当前进展后，主编简短的分别安排了些事项。\r\n\r\nSam握着电子笔在supernote笔记软件上，依次记录了主编的所有安排。\r\n因为打开软件时选择的是“会议记录”，所以在Sam写字的同时，软件自动的录制了语音记录。\r\n软件对Sam飞快的书写记录识别率非常高，几乎每个歪七扭八的字母都能识别出来。这让他很满意。\r\n会议结束后，Sam点击软件右上方的保存键。\r\n这时，界面上弹出了一个窗口，显示“您好，Sam　Winchester先生，会议记录保存成功。由于您已经注册为超级用户，请问您希望体验苹果公司为您提供的智能分析功能吗？确认请点击下一步。”\r\n智能分析？\r\nSam呆呆地看着这几个字，大脑似乎一片空白——只是一个普通的会议记录罢了，这有什么分析可言呢？这时Andy走到他旁边，说：“Sam，会都开完了，你怎么还不走？”\r\n\r\n\t\r\n第三节 一篇报告\r\n\tSam回到自己的座位上。怀着强烈的好奇点击了界面上的下一步。他好像是一个在凡尔纳笔下初到神秘岛的探险者，他所见到的一切都会引起极大的好奇，而他要做的正是跟着那好奇心，一路走下去。\r\n\t过了2、3秒钟，界面变成了一篇类似报告的东西。为了看得更清楚，Sam把ipaper展开到最大——也就是16张扑克牌的像报纸一样的大小。他看到这篇报告后，睁大了眼睛——\r\n\r\n会议记录 智能分析报告\r\n2019年10月10日 上午10:43\r\n所在位置：美国 纽约市 第六大道 洛克菲勒中心 时代&生活大厦\r\n\r\n记录1：“美国教育专题组的进度，他们说目前已经采访了美国教育部长，和哈佛、耶鲁等大学的校长关于美国教育改革的意见，主编说下一步再采访一些主流的教育专家”\r\n建议结果：\r\n①\t我们分析认为您所提到的[美国教育]是泛指“美国教育制度、状况等”（如果不对请点击这里）\r\n②\t我们为您找到的[美国教育]相关的新闻专题有：\r\n《时代》往年关于[美国教育]的报道，（报道原文请点击这里显示）\r\n《华尔街日报》关于[美国教育]的深度专题报道，（报道原文请点击这里显示）\r\n亚洲媒体关于[美国教育]的报道，（报道原文请点击这里显示）\r\n③\t您的记录中提到了[美国教育部长]，我们为您找到的关于美国教育部长的信息包括：现任部长名称，简历，相关新闻报道等，（查看详细信息请点击这里）\r\n④\t您的记录中提到了[哈佛、耶鲁大学校长]，我们为您找到的关于哈佛校长、耶鲁校长的信息包括：哈佛信息，哈佛校长简历，哈佛校长著作，耶鲁信息，耶鲁校长简历，耶鲁校长著作等，（查看详细信息请点击这里）\r\n⑤\t您的记录中提到了[教育专家]，我们为您找到的教育专家有：\r\n美国教育专家：（点击这里显示），以及相关著作：（点击这里显示）\r\n其他国家教育专家：（点击这里显示）\r\n离您的位置最近的教育专家：（点击这里显示）\r\n\r\n记录2：“中国经济体制改革，主编说这个专题非常重要，这次体制改革如果成功，将对美国甚至全世界有非常大的影响。主编还说我们一定要抢在别的媒体之前对这个专题进行深刻的分析报道。目前专题组已经采访了一些美国经济专家以及中国的经济学者，主编要求下一步还要联系中国的相关高层人物，同时再联系些专门做中国经营环境分析的咨询公司，看看能不能要到一些数据。”\r\n建议结果：\r\n①\t我们认为您所提到的[中国经济体制改革]，是指的离当前时间最近的“2019年中国经济体制的改革”相关的信息。（如果不对请点击这里）\r\n②\t您的记录中提到[对美国甚至全世界有非常大的影响]，根据语义分析，我们认为您所指的是“2019年中国经济体制改革相关的影响”，以下是我们为您找到的与这些影响相关的报道：（点击这里显示）\r\n③\t您的记录中提到了[美国经济专家]，我们为您找到的美国经济专家以及相关著作有：（点击这里显示）\r\n④\t您的记录中提到了[中国经济学者]，我们为您找到的中国经济学者以及相关著作有：（点击这里显示）\r\n⑤\t您的记录中提到了[中国相关的高层]，根据语义分析，我们认为您指的是“中国关于经济体制改革的高层领导”，以下是我们为您找到的人：（点击这里显示）\r\n⑥\t您的记录中提到了[中国经营环境分析的咨询公司]，我们为您找到的公司及其信息：（点击这里显示）\r\n\r\n记录3：“欧元区实体经济问题，专题刚刚开始做，只是采访了一些证券分析师，对欧元区的实体经济问题有了初步了解。主编要求下一步还要采访欧元区各大银行的高层，最好把欧元区各国的意见都采集来。”\r\n建议结果：\r\n①\t您的记录中提到了[欧元区实体经济问题]，我们认为您指的是离当前时间最近的“2019年欧元区关于实体经济的问题”，我们为您找到了欧元区相关解释以及欧元区实体经济相关报道，（点击这里显示）\r\n②\t您的记录中提到了[证券分析师]，我们为您找到的证券分析师有：（点击这里显示）\r\n③\t您的记录中提到了[欧元区各大银行的高层]，我们认为您指的是“欧元区的银行的高层领导”，我们为您找到的相关领导有：（点击这里显示）\r\n④\t您的记录中提到了[欧元区各国的意见]，根据语义分析，我们认为您指的是“与2019年欧元区实体经济问题有关的欧元区各国相关的意见”，我们为您找到的信息有，（点击这里显示）\r\n\r\n记录4：“苹果新产品，主编夸我是个很有勇气很有潜力的小伙子，嘿嘿！主编说，一定要尽快挖掘苹果新产品的秘密，并且努力深度挖掘这个产品背后的故事，他说以他的直觉，这个产品不一般，也许真的要掀起一场风暴。最重要的是要快，而且要有深度，要做到别的媒体都做不到的，最好是独家新闻。”\r\n建议结果：\r\n①\t您的记录中提到了[苹果新产品]，我们认为您指的是离当前时间最近的“2019年苹果公司发布的ipaperⅠ智能机”，我们为您找到了它的介绍以及相关报道，（点击这里显示）\r\n②\t您的记录中提到了[苹果新产品的秘密]，我们为您找到了相关的报道以及互联网上所有网站上相关的讨论，（点击这里显示）\r\n\r\n\r\n报告看到这里，Sam已经目瞪口呆，一篇及其简单而且潦草的会议记录，竟然能被一个机器分析到这种地步。信息量极大而且都是非常相关的信息，没有一点多余的内容。\r\n这样的一篇智能报告，加上那些链接，就可以马上解决例会上各个专题组的问题了，至少能给大家减轻不少的工作负担。\r\n如果不是自己亲眼所见，他会以为这是哪个专业的分析公司所提供的价值上千的专业报告呢！ \r\n在阅读的过程中，Sam不断的问自己：“它是怎么做到的？它是怎么做到的？”\r\n直到最后，他问自己都问到烦躁了，以至于他相信其实是有一个专业的分析师坐在电脑的另一端，在一个字一个字的敲击键盘，然后才把这篇详尽的分析报告提供给他的。\r\n但是Sam摇了摇头，他知道，从自己点击确定到报告出来，前后一共不过2、3秒钟而已，这是人类不可能做到的。\r\n他的大脑又变得一片空白，因为已经不知道自己该想些什么，该问些什么，只是觉得这一切都和自己所经历的时代太过于不同了。\r\n仿佛像电影中一样坐了时空机器去了未来的世界，面对未来人的生活而不知所措。\r\n他开始漫无目的的来回翻动这篇分析报告，看到每句话最后的那个“点击这里查看详细内容”，他就随便挑了一个点了一下。\r\n但就是这一下，让他回过神来了。\r\nSam点击的是关于“哈佛大学校长”的详细内容，这时界面上显示“您好，Sam　Winchester先生。您现在正在请求查看[哈佛大学校长]的简历、著作等相关内容，下载这些信息需要付1元。确定请点击下一步。如需帮助请点击文字上方的问号。”\r\n\t付费？\r\nSam回过神来就是因为这个词。\r\n原来这一切并没有那么简单，苹果公司提供的这种“超级服务”自然不能是完全免费的，毕竟那样的分析报告即使在市场上去卖也是值不少钱的。\r\n自己怎么没有想到这点呢？\r\n\tSam并没有直接点击下一步，而是先点击了上面的问号，看看它对此有什么样的解释。\r\n这时，界面上开始播放一段视频。\r\n视频在短暂的显示了苹果的标志后，出现一位漂亮的女人。然后她开始说话了：“您好，尊敬的ipaper客户，我是苹果公司的Lily，专门为您解决与这部智能机器相关的问题。根据使用记录，这是您第一次使用ipaper为您提供的超级服务，其中涉及到了智能分析以及付费下载等功能。下面我将为您进行简单的介绍。”\r\n\tLily接着说：“ipaper是一部划时代的产品，它为您提供了非凡的使用方式以及操作体验。在这里您将体验到功能强大而易于操作的特性。您当前所使用的supernote笔记软件，与目前市场上所有的笔记软件都不同。它不但拥有强大的记录功能，同时还具有智能分析的功能。\r\n“智能分析功能是由苹果公司集合众多语义分析专家、互联网技术专家以及众多的数据提供商一起为您提供的超级功能，它能够为您带来生活、工作上极大的便利。\r\n“同时为了保证这个功能的持续运行，您需要知道的是，它需要很大的成本。因此您的每一次使用都需要付出相应的费用。然而基于众多的考虑，苹果公司决定将它的使用价格降到所有人都能接受的地步。\r\n“在每次将要付费的时候，您都会看到相应的费用是多少而自愿选择是否支付。为了使您有一个大概的了解，以下将向您展示常用信息类型的收费。”\r\n\t画面中出现了一个表格，Sam看到表格中详细的列举了各种类型信息的收费标准，大多数付费信息都是以这个标准来定价的。比如书籍下载，0.1元~10元；杂志下载，0.1元~3元；新闻报道，10份以内不收费，超过10份的每10份收0.1元；互联网已有信息，免费。\r\n\tSam不禁感叹——“呵，扎克伯格已经做到这种地步了！他竟然已经做到这么详细的地步了！”\r\n然后他点击表格下面的“我已经阅读完了”。\r\n这时Lily又出现在了画面中。\r\n\t“我想您从上面的表格中已经了解到——使用我们提供的付费信息，并不会给您带来经济上的困扰。同时我将提醒您注意到另一个重要的问题就是——您的付费过程将是最简单而最安全的，”Lily接着说，“与传统的网络付费不同，为了使您更好的享受使用过程，苹果公司创造了一种非常简便的付费方式，无需每次付费都到网络银行输入密码、多重确认，您甚至可以不用做任何操作就完成了付费。”\r\n\tSam心里想：不需要密码就直接付款？那岂不是太不安全了？如果我的机器被别人使用了怎么办，那我的账户安全谁来保障呢？\r\n\tLily继续说：“但是您不用担心——虽然在操作过程中无需任何安全确认就可以付款，但是在后台我们已经做到了最安全的验证方式。\r\n“我们默认的验证方式是这样的，当然您可以根据自己需要的进行调整：款项低于1元的，可以直接付款，这将极大的方便您的操作，因为小额的付款将在使用中经常出现，如果每次都输入密码会很浪费时间；款项低于一百元的，需要输入银行密码；款项低于一千元的，在输入密码的同时需要回答您在网络银行预设的问题，只有回答正确了才能付款；款项低于一万元的，需要您输入密码、回答问题以及回复发到您手机上的验证短信中的验证码；款项高于一万元的，将启动最高验证模式，需要您在智能机上验证指纹、视网膜和声音。\r\n“当然，无论在哪种模式下，智能机都将拍摄使用者的头像，与您注册的头像进行对比，一旦对比结果不同，那么将对您进行电话确认。”\r\n\t听到这里，Sam对付费问题的疑虑已经荡然无存了——他仍然相信自己是在未来世界里，而那个世界的网络付费是那样的安全和方便。\r\n\t最后Lily说：“好的，关于supernote的智能分析与付费问题，已经向您解释完毕了，希望您在我们努力创造的新世界里拥有一个愉快的旅途，谢谢！”\r\n视频自动消失，并回到了分析报告的界面。\r\n\t这时Sam感到，就像在这一路的探险的中途走到了其中的一个休息站，可以暂时歇一歇，缓一缓，让大脑消化一下这从一开始就让人惊讶到现在的每一件细小而又神奇的每一样事物。然而他知道，在后面等待他的也许还有更多的惊喜。\r\n他看着那篇报告发了一会儿的呆，然后站起来，走到楼层的吸烟区，点上一根烟，看着窗外的天空吐出一团又一团的烟雾。\r\n这时Andy走了过来，也点上一根烟，说：“你怎么了？我看你的表情不太对啊。”\r\n“Andy，我想，扎克伯格真是一个天才！”Sam说。\r\n“看来你是发现了些什么吧？”\r\n“没错，andy，他简直是个天才！他也许真的创造了一个新世界，而我刚刚却只看到了这个世界的一角！”Sam激动的说。\r\n“那么你之前的判断是对的，扎克伯格这次发布的产品大有内容。加油吧Sam，一定要挖掘出它的故事，抓住它的核心，要记住，你是一个记者，而且是《时代》的记者！”\r\n“是的，谢谢你andy。”\r\n“那么，那个秘密你已经知道了吗？”\r\n“秘密，我还没开始…等等！”Sam似乎想到了些什么，“谢谢你andy！我好像知道些什么了！谢谢你！”\r\nSam赶忙把烟掐灭，然后一路小跑回自己的座位。再次拿起了那部神奇的机器。\r\n他关闭了分析报告，然后打开几个的程序软件，左点点右划划，同时还用笔写着些什么，偶尔还会连续打好几个电话。\r\n一直忙到中午休息的时候。旁边的同事催他去吃饭，Sam应道：“你先去吧，我还有好多事情要做，先不吃了！”同事无奈的自己去吃饭了。\r\n\r\n第四节 神秘礼品\r\n第二天，也就是周五早上的九点钟，苹果公司的官方网站上出现了一篇公告，瞬间被各大网站和媒体争相转载，网络上又掀起了一阵风波。\r\n公告的内容大致是：苹果公司已经得到了第一个回答出ipaper“秘密”的人。那个人的名字是Sam Winchester。\r\n为了奖励他，公司决定赠送他一个神秘礼品，并给他一个和苹果公司CEO扎克伯格共进午餐的机会。至于答案的具体内容以及神秘礼品是什么，都将在Sam Winchester领取奖品之后再公布。\r\n\t网络上人人都在猜测那个秘密的答案是什么，并且争先恐后的公布自己的解答。有的人猜ipaper最与众不同的地方就是它采用了基于云技术的系统，有的人猜ipaper能获得个人的信息，还有的人猜ipaper实行了网络实名制，甚至有人站出来说自己通过一些渠道获得了ipaper的内幕消息——它是美国中情局参与的能监控所有用户的智能机器。\r\n就像每年一届的奥斯卡开幕前夕，所有人都在猜测奖杯的得主是谁一样。\r\n受到网络热潮以及极大的好奇心的影响，苹果专卖店的销售比之前更加火热了，门口排的队伍也越来越长。有些地区甚至派出了警察队伍到专卖店的门口维护治安，还有一些交警来疏散附近拥堵的交通。\r\n\t不得不说，苹果公司的这一系列举动，引起了全民的热潮。\r\n而苹果似乎又什么都没做——他们没有在电视上、在网络上插播一条广告，没有任何宣传，甚至连产品的介绍都没有。毫无疑问的，这也是扎克伯格的一个非凡营销策略。\r\n也许用不了多久，学MBA的学生们就可以在自己的课本上看到这个经典的案例分析了。\r\n\t早上十点钟，位于纽约的《时代》的办公大楼中，主编正在开每天的例会。\r\n例会的焦点就集中在Sam将与扎克伯格共进午餐的这个主题上。\r\n在一番夸奖后，主编严肃的对Sam说，“Sam，这是一个非常重要的机会。就像你所知道的那样，我们也了解到了苹果的这部新产品确实是一部神奇的机器，这是跨时代的新闻，是将载入科技产品历史的事件，就像乔布斯发布iphone一样，就像扎克伯格的Facebook上线一样，都是引领时代的事件。所以你需要知道，这次共进午餐的机会很重要，”主编接着说，“你要抓住机会问他一些问题，最好是能获得独家采访的权利。当然，关于这些问题你的经验还少，在这方面Andy会给你很大帮助的。”\r\n“好的，主编，谢谢您对我的信任。我一定会努力利用好这次机会的”Sam充满信心的答道。\r\n“好吧，不要浪费时间，你和Andy去准备吧。”主编说。\r\n于是Sam和andy离开了会议室，主编则继续给其他专题组安排任务。\r\n\t\r\nSam在Andy的指导下经过了努力的准备，终于到了10月14日，也就是周一。\r\nSam如约到达了位于加州库珀蒂诺市的苹果总部。现场已经聚集了很多主流报刊杂志的记者，而Andy作为《时代》的记者也出现在了新闻发布会台下的坐席上。\r\n\t在这场小型的新闻发布会上，Sam成了主角。\r\n工作人员在简短的说了一些开场词后，高调的邀请一位漂亮的模特端着一个白色印有苹果标志的像钻戒盒子一样的东西来到了Sam面前，Sam恭敬的接过来。\r\n下面的记者这时紧忙唰唰唰的拍照。主持人邀请Sam拆开包装，看看这个神秘的礼品到底是什么。\r\n\tSam小心翼翼的拆开了包装，展现在眼前的东西又使他吃了一惊——那，是一块手表！\r\n这时主持人微笑着告诉大家，这不是一块普通的手表，而是一个配合ipaper使用的多功能辅助机器。\r\n大屏幕上开始播放这部iwatch的宣传片。\r\n大家了解到，由于ipaper的一切使用都是基于网络的，甚至可以说是完全基于美国的全境无线网络，而且必须依赖很高的网速才能够维持其运作。然而，一旦遇到偏远地区网速很慢或者没有网络，这部智能机就相当于一个废物。为了弥补这个问题，苹果公司开发了相应的硬件补充——iwatch。\r\niwatch外形是一个手表，内部却有极其精密的16.0GHZ超高速cpu运算器，32T容量超大额存储硬盘，无线网络发射器/接收器，数据传输插口，以及一个袖珍的投影机。\r\n将iwatch和ipaper进行无线网配对连接后，ipaper将如虎添翼，不但能够极大的加快运转速度，还能够在没有互联网的情况下使用一些常用软件，甚至能够将ipaper的内容投影至任何宽阔的墙面上观看。值得一说的是，iwatch的外形使得携带便捷，可以将它放在包里随身携带着——它能与附近一百米的ipaper进行连接使用。\r\niwatch的出现，使发布会现场再度沸腾起来。\r\n毫无疑问，无论是Sam体验到的软件方面的智能，还是ipaper、iwatch的硬件方面的尖端， 扎克伯格都将当时科技水平所允许的的都做到了极致——在场的所有人都无不感叹，扎克伯格已经领先了时代太多！\r\n主持人继续说明，iwatch将在随后公开发售，售价仅为1000元。\r\nSam想，这样的价格也许是为了应对三星等公司的价格战，毕竟iwatch在性能上是很容易被赶超的，它的竞争力远没有ipaper高，所以定这样的市场平均价格是一个平稳的策略。\r\n而此时在台下的记者Andy想的是，这次的新闻发布会原来亦是一个营销策略：看似只是一个“解谜”的小型新闻发布会，实则是承上启下来引出新产品的发布，这一步一步连接得毫无缝隙 ，真是令人敬佩。\r\n接下来到了记者提问环节。\r\n在回答了ipaper如何对个人信息保密、如何与iwatch配合使用等常见的问题后，有个记者站起来问大声的说：“现在，该公布那个‘秘密’的答案了吧！”\r\n台下又轰然乱成一片，大家都在喊“是的”“该公开了”“快说出来吧”“我们等的够久了”等等。\r\n的确，这些天来，几乎所有人都在猜测那个谜题，很多人都不惜花费大笔的钱去买下这台神奇的机器来破解这个谜题。\r\n主持人说：“好的，不过不是现在。我们会在晚上在官方网站上公布谜题的，这样对全球关注我们信息的人都很公平。谢谢。”\r\n然后主持人有礼貌的走下了台，并邀请Sam去苹果总部的员工餐厅与扎克伯格共进午餐。\r\n\tSam从记者们的长枪短炮中脱离出来，与主持人来到了餐厅。\r\n主持人领着他来到了餐厅的一个角落，说：“这是扎克伯格先生经常做的位置，请您在这里稍等一下，他马上就过来。”\r\n\t主持人走后不久，仍是穿着一身休闲服装的扎克伯格过来了，和Sam上一次在新品发布会时见到他一样——他就像在大学校园的一个学生，正悠闲的到学校食堂吃饭。\r\n\t扎克伯格微笑着的和Sam握了握手，然后直截了当地说：“嘿，我看了你发来的邮件，你的反应真的很快，而且说明很详尽，远远的超出了我的预期，”扎克伯格一边端详着这个年轻的记者一边说，“说说吧，你是怎么做到的？”\r\n“嘿嘿，呃，运气吧，运气！”Sam脸红了起来，这对一个大男孩来说也是很少见的。\r\n他很紧张，不知道该说什么，毕竟对面坐的是那个传奇的人物扎克伯格。\r\n扎克伯格看到他这样笑了笑，说：“不要紧张嘛，随便一点。你看，就像我这样，没什么大不了的，我们只是吃个饭而已。”\r\n说到这里，扎克伯格叫来服务员，点了两份餐厅最拿手的菜，然后接着说，“快说说吧，是怎么发现的？我很好奇。”\r\n看到扎克伯格这么平易近人，而且年龄看起来也相差不远，就像两个同龄的哥们一样，Sam不那么紧张了。\r\n他说：“那好吧，事情是这样的……”\r\n在他解释自己是如何点击各个软件的功能、打电话到相关的公司咨询、上网查询的时候，让我们来看一看他发的那封邮件吧：\r\n\r\n收件人：Mark_Elliot_Zuckerberg@apple.com\r\n发件人：Sam_Winchester@time.com\r\n标题：关于ipaper发布会上谜题的解答\r\n正文：\r\n尊敬的苹果公司CEO 扎克伯格先生 你好，\r\n我是《时代》的实习记者Sam　Winchester。我有幸在10月1日您举办的新品发布会上见到了您，并且见识到了您带领团队开发出来的ipaper——那部神奇的机器。为了体验这部您所说的划时代的产品，我在它公开发售的第一天就买到了手中。\r\n在体验了您创造的一些神奇的功能后，感到自己仿佛经历了一场伟大的冒险。然而我感到那只是我所看到的冰山一角——无论是它的硬件技术还是一些智能软件都只是它的一小部分而已。我发现到，这部机器的核心内容才是它划时代的特征，同时，它也正是您所说的那个“秘密”。\r\n经过不断的验证和尝试，我发现了这秘密，这也令我大吃一惊——那可真是个好东西——那个秘密就是，您所尝试创造的并不是一个一个的具体软件或硬件，而是创造一个能完美的将各种功能、各种企业、甚至各种行业融合在一起的平台！这个平台正是以我们最普通的用户的需求为最高追求的。要创造这样一个平台，就需要每一个具体软件的制作者的紧密合作——这就是您所提示的那个词“合作”。\r\n我不知道这样的回答能不能够使您满意。下面我将列出我对每款软件的想法以及猜测，希望能够对我刚刚所作出的解释有所帮助。\r\n①\t注册激活。在最开始将自己注册为超级用户的时候，我只输入了一个社保卡号码就完成了全部的注册。（这令我非常吃惊）我想到，您也许是通过我的社保卡号码与民政局的数据进行了连接，获取了我的名称、网络银行账号等相关的信息，而省得我再重复的输入所有的这些信息。不得不说，这太棒了！\r\n②\tSupernote智能分析。分析报告非常贴切我的需要，经过一些简单的调查和对比，我发现报告中为我提供的书籍都是由亚马逊公司提供的，词语解释都是由维基百科网站提供的，而下载的一些数据最下方都标记着谷歌数据的字样，所以我认为您是与这些公司在合作的——大家一起合作提供了这样精确的数据。\r\n③\t付费方式。很明显的，与银行的对接是这种奇妙的付费方式必不可少的。我认为您已经与一些银行（其中包括我的账户所在的银行）进行了深度合作，才能够得到这种既安全又方便的付费方式。\r\n④\t广告。在我进行一些相关信息浏览时，界面的空白处总会出现一些相关的——很多都是我需要的产品的广告，并附带有相应的购买链接等。经过调查，我发现这些广告都是由美国LMC旗下的传媒公司提供的。所以我认为您也与这家传媒公司进行了深度合作，在为我提供一些也许我会想要的产品的同时，也为众多广告公司做出了贡献。\r\n总之，您做到了其他任何竞争对手都没有做到的东西——合作 ——正是您在新品发布会上所说的那个关键词。就像您将最初的社交网站Facebook发展成一个集合人际交往、游戏、软件工具、新闻发布等合作平台一样。\r\n我和您一样认为，在这个时代真正强大的不是专注于自己的一隅，而是能够搭建一个舞台，允许任何人在上面展示自己，跳出一段段优美的舞蹈。也许这才是您所想要向世人表达的吧！\r\n希望我的答复能够令您满意，\r\n您忠诚的，\r\nSam　Winchester\r\n2019年10月10日 13:00\r\n\r\n\r\n扎克伯格眼中泛着光芒看着眼前的这个小伙子，这让他想到自己年轻的时候，心里感叹：年轻真好啊。\r\nSam解释完自己是怎样一步一步的发现这个秘密，并领先于别人将邮件发送到苹果公司的官方邮箱后，扎克伯格说：“非常不错，小伙子，我很喜欢你。”\r\n“夸奖了，扎克伯格先生。我真的只是幸运而已。”\r\n然后Sam想到自己并不是单纯的一个用户，而更重要的是作为一个记者来到这里的。\r\n于是他壮了壮胆子，认为时机差不多了，打算切入主题。\r\n“扎克伯格先生，我非常好奇，想问一下您是怎么想到要开发这么一部智能机器的呢？”Sam问道。\r\n扎克伯格回答：“这个嘛，是因为一时的灵感才想到要做的。说实话，这可真费了我不少的脑力呢。有一段时间我甚至长出了几根白头发呢。”\r\n“那么，”Sam似乎恢复了记者的姿态问，“那是个什么样的灵感呢？”\r\n扎克伯格并没有立刻回答，想了想然后说：“不好意思，这个我不方便告诉你。”\r\n“哦这样啊。那换一个问题，您真的能够在上任苹果公司ceo后的短短十个月之内就开发出这样一部划时代的机器吗？——那简直难以置信。还是说您来到苹果之前就有这样的打算了呢？”Sam问。\r\n这个问题又使扎克伯格停顿了几秒钟，看来Sam的这几天与andy一起的努力准备并没有白费——都问到了重点。\r\n然后扎克伯格笑了笑，说：“嘿嘿，问题很尖锐嘛！你还真是一个记者，吃饭都不忘记要做采访！”\r\nSam有些失望，因为到此为止还没有任何收获。他想到，来都来了，机会难得，再努把力吧！\r\n于是他又问：“扎克伯格先生，是这样的，时代周刊绝定为这个的新产品做一次深度的报道，所以希望对您进行一次正式的采访，这个任务很荣幸地交给了我。您看可以吗？”\r\n扎克伯格没有回答，本想直接的回避的，但是看了看眼前的这个眼睛里充满着期待的年轻记者，似乎突然间想到了些什么，沉思了一会，然后抬起头来看着Sam，露出了一丝微笑。\r\nSam没有明白这个微笑是什么意思，然后扎克伯格说：“哈哈，小伙子，我很看好你。这样吧，我再给你出一个谜题，如果你可以解决的话，我就答应接受你们的采访，也许还能告诉你很多背后的故事，你看怎么样？”\r\n“真的吗？！好的好的！您请说！”Sam激动地说。\r\n“很简单，”扎克伯格说道，“你刚才问到我的灵感是什么，我只能告诉你一个词，其他的东西就需要你自己去想了。那个词就是……”\r\n“什么？”Sam迫不及待地问。\r\n“中国的读书运动。”扎克伯格答道。\r\n“中国，读书运动？”\r\n“哈哈，我的提示就到这了，”扎克伯格站了起来，和Sam握了握手说，“今天很高兴和你一起吃饭。希望我们还能有机会见面。”\r\nSam也站起来，说：“谢谢您，扎克伯格先生，我也很高兴见到您。我们一定还会再见的！”\r\n然后Sam就离开了苹果公司的总部。\r\n由于Andy还有事就没有等Sam，提前回去了。于是Sam自己坐了最近的一班到纽约的飞机。\r\n坐在飞机上，Sam的思想正如一只无头苍蝇，到处乱飞，他控制不住自己。也说不上是高兴或是难过，总之脑袋里胡乱一片。\r\n说起来，也许这更像是失望。因为他没有完成好他身为一名记者的任务——他没有从扎克伯格那里获得足够的消息，挖掘他背后的故事。\r\n但是扎克伯格告诉了Sam一条线索——“中国的读书运动”。\r\nSam本以为自己赢得胜利了，还没到机场就急不可耐地用手中的ipaper上网搜索这个关键词。\r\n可是令他失望的是，无论怎么搜，都搜不到一条相关的信息。\r\n这时他产生了一种逃避的情绪——他希望这架飞机永远不要停下来，直到他想好怎么向主编交代为止。\r\n他让思绪胡乱的飞了一会儿，然后心里对自己说：“不，我不能这样下去，事情还没有完，我要好好想一想，也许还有机会！”\r\n于是Sam从包里拿出了一个mp3播放器，是微软开发的Zune一代硬盘级播放器，可以存储大量的歌曲，拿在手里就像一块小砖块——已经停产了十几年。那是他最喜欢的播放器，因为操作简单，没有任何多余功能。他戴上耳机，打开这个硬盘级别的播放器，选到了一部安静的指弹吉他专辑，点击播放。然后他戴上眼罩，双手合十放在两腿间，紧靠着座椅——这是他要开始思考时的习惯动作。\r\n他仔细的回忆与扎克伯格的每句对话，扎克伯格的每个动作，以及刚才新闻发布会的每个细节。他反复的思考着，就像在黑暗的房间中摸索那根开灯的灯绳一样。\r\n他的思绪却反复的围绕着他们最后的那几句对话中：“因为受到一个灵感的启发” “这个我不方便告诉你” “短短的十个月就做出这样的产品” “受到中国读书运动的启发” “商业机密”。他反复的琢磨着这几句话。\r\n那个读书运动史怎样启发扎克伯格去做这么一部ipaper的呢？这之间一定有什么重要的关联，如果能够抓住这两者的关联关系，我肯定能做出一篇很有深度的专题报道！也许这个专题能够给我们的科技产业带来同样大的启发呢！\r\n所以，这个线索无论如何也要查到，不管是在网络上查还是找人问都一定要找到！\r\nSam继续想着，感觉那根开灯的绳子就在不远了。他摘下眼罩，看着窗外的云彩，玻璃上他能看到自己闪着光芒的眼睛。\r\n下了飞机后，他马不停蹄的回到自己的工作岗位上，甚至没有向Andy和主编汇报情况，就开始了行动。\r\n\r\n\r\n第五节 线索\r\nSam首先想到，可以问一些在中国的朋友，也许他们会知道的。\r\n于是他打开了1张卡片大小的ipaper，点击通讯录，打开搜索功能，搜索出了所有在中国地区的朋友。\r\n搜索结果出来，界面上清晰地显示着他的几个中国朋友的名称、电话、职位、年龄、婚姻状况等信息，Sam想，这些信息是从哪里来的？他不记得自己输入过这些信息。\r\n界面上，几个他认识的朋友旁边，还用线条连着另外几个不认识的人，下面显示着他们是朋友的朋友。\r\n但是Sam现在没有心情去探索这些新鲜而匪夷所思的功能了，他急于去求证那个问题。于是拨通了几个中国朋友的电话。\r\n他第一个选的是何威，是他以前去中国玩时认识的一个作家朋友，名称下面显示着“中国科幻小说作家”。他按下了拨打键，电话接通了，他简单地和对方寒暄了几句。\r\n然后问起对方，中国发生的读书运动是怎么回事？\r\n而对方的答案让Sam很失望——从来都没有听过，中国什么时候有读书运动？身为一个中国作者的他竟然没听过这个事情。\r\n挂断电话后，Sam试着拨通了第二个中国朋友的电话。这个人叫郭明明，下面显示着“中国某传媒公司负责人”，是他在一些广告工作上联系过的合作方。\r\n她也表示从来没有听过这个事情，Sam又追问了几句，她还是说没有印象。\r\n“到底是怎么回事？你真的没有听说过吗？我的一个采访对象说的这个事不像是假的啊。”Sam说。\r\n“不好意思，我真的没有听说过。如果说中国有什么读书运动，那也只可能发生在春秋战国时代，最起码这几十年来从来没发生过这个事件。”郭明明说。\r\nSam很失望，这是他抓住的唯一线索，竟然是一个莫须有的东西。\r\n听出了Sam的失望，出于礼貌，郭明明接着说：“没关系，我回去帮你问问我的其他朋友，看看有没有这回事，也许是有的而我不知道呢。”\r\n“好的，那谢谢你了。再见。”Sam说。\r\n挂断电话后，Sam还是没有放弃。\r\n他又打了个电话给一个在中国的一个咖啡馆时认识的那里的老板成禹，他也表示没听说过这么一回事。\r\nSam失望极了，他想，这一路下来，除了得到一块“超级手表”外，他身为一名记者几乎一无所获。\r\n当Andy过来询问他事情进展的怎么样时，Sam无奈的耸了耸肩，说：“对不起，Andy，我没有得到什么重要的信息。”\r\nAndy并没有责骂他，而是说：“没关系，Sam，这在我们记者是常有的事，并不是什么信息都那么容易让你得到的，再说这是你第一次做深度报道，”Andy把手按在Sam的肩膀上，接着说，“但是你要记住，你还有机会的，只要你不放弃。”\r\nSam回过头来看着Andy，说：“我还有机会吗？”\r\n“当然！你看，虽然主编要求你一定要尽快赶在别的媒体之前作出这个报道，但是经过我这些天的关注，现在他们还只是停留在对这部机器的浅薄的理解上，而你已经比所有媒体都更接近真相了。所以你只要专心做好，我相信你一定不比别人慢的。”Andy耐心的说。\r\n“是吗？真的，谢谢你Andy！我现在好多了，看来我还有好多工作没有尝试呢，这时候放弃未免太让人瞧不起了吧，谢谢你！”Sam高兴的说。\r\n\r\n接下来的几天里，Sam一直在使用ipaper里面的各种功能，他试图再次从这里找些线索。\r\n他先想起的是那天使用的通讯录功能，因为他记得那天在通讯录里搜索中国地区出来的联系人，下面都标记着很多他并不知道的信息，如婚姻状况和朋友关系等。于是他又看了看美国的联系人，先点击了Andy的信息。ipaper界面上立刻显示出了Andy的公司、职位、婚姻、毕业大学、从业经历等。\r\n这激起了Sam的好奇心——他从来没有输入过这些信息啊，而且他从来都不知道Andy是不是已经结了婚。难道苹果公司用黑客调查了他的所有朋友？不不，这不太可能。\r\nSam百思不得其解，于是还是去找了Andy求证。Andy看到这些信息后也非常惊讶，他在想莫非是自己的信息都被人泄露了？\r\nAndy拿过来ipaper，看着它想了许久。突然好像有些什么思路，然后点开了网页浏览器，输入了一个地址，点击确定。画面出来后，Andy开心的笑了。\r\nSam好奇的看着Andy问：“怎么？有眉目了？快说啊”\r\nAndy答道：“哈哈，原来是这样！那我就放心了！你看看吧。”说着把ipaper递给Sam。\r\nSam看到后也乐出了声：“哈哈，原来是这样啊！苹果只是把你在Facebook上的信息同步到我的通讯录里了，这样你再Facebook上发布的所有信息在这里也就可以看到了。当然你不想让别人看到的，删除就可以了。”\r\nAndy说：“呵呵，没错，看来我们又不经意被扎克伯格那个小子摆了一道呢，原本还以为是信息泄露呢！”\r\nSam好像一个刚刚破解了谜题的侦探一样，高兴地回到座位上。继续探索这个神奇的通讯录。他发现，通讯录里面还隐藏着另一个功能，叫“族谱”。\r\n点开“族谱后”，界面上显示出了密密麻麻的线条，好像是一颗大树。Sam展开ipaper到最大的状态，看到这原来不是一棵普通的树，而是Sam自己的家族树。每个枝条都代表他家族里的一个人。他清楚的看到父母的两根枝条相交成一根，然后下面出现了一根新的枝条，标记着“Sam Winchester”的字样。同样在这棵树上还显示着诸如他的祖父、外祖父、表哥、堂哥等家庭的联系。\r\n毫无疑问，这也可能是Facebook通过他庞大的人类信息库提供的。\r\n\r\n退出通讯录后，Sam打开了“游戏”字样的图标，画面出现让他眼前一亮——这里简直有成千上万的游戏啊！而且完全不需要以往好几个小时的下载、安装、调试等步骤，所有游戏都分门别类的摆放在页面上，直接点击开就可以玩！\r\n他看到了《使命召唤15》，这应该是《使命召唤》游戏系列今年刚推出的游戏。这是Sam最喜欢玩的游戏系列，他非常清楚这款游戏是不能在苹果系统上玩的，这是怎么回事呢？\r\nSam放弃了对游戏的探索，因为上班时间是不可以玩游戏的。\r\n然后他想到，这样找下去不行，必须要从扎克伯格给的提示“中国读书运动”这条线索入手。\r\n读书？\r\n于是Sam打开了ipaper的读书软件ilibrary。Sam记得以前的苹果的读书软件叫ibook或者ireader之类，这次变成了ilibrary，从名字上就感到了巨大的差异——书和图书馆的差异。\r\n打开软件后，报纸大小的ipaper上铺满了各类各式的书，下面都标记了价格，有的是3元，有的只有0.5元。他想起了之前在使用supernote笔记本时Lily说过的价格表。\r\n在界面的菜单里有一项写着“Sam Winchester想要读的书”。Sam点进去后，显示出了他想要购买和阅读的所有书。这次他的反应很快，知道了这是他以前在Librarything网站登记的读书信息。\r\nSam在ilibrary里并没有找到能够给出答案的东西，搜索结果依然显示为无此信息。\r\n接下来，他又打开了ebay网络购物的软件——他每次心情不好的时候就想在网上买点东西来发泄。\r\n这次他看中了一件98元的衬衫，于是点击购买，点击确定，整个购买过程就完成了。甚至没有任何其他的信息输入。经常进行网络购物的读者们会明白，通常要在网上购买一件东西，需要依次输入收货地址、收货人、联系电话，然后再向自己的银行账户提交划款请求，输入一系列密码和验证码，再回到购物网站点击确定，并等待发货信息等众多步骤。\r\n这样一步就完成购买，在当时是不太可能的。但是这时Sam已经感不到奇怪了，因为他已经接受ipaper是一部来自未来的机器了。\r\n由于这件衬衫价格是低于100元的，所以无需输入任何密码，这样的简便让他多少有了些安慰。\r\n当天晚上他就在家里收到了这件衬衫，据他所知那件衬衫是从美国南部很远的一个城市发过来的，他很惊讶——美国的物流什么时候这么发达了？\r\n一般经过装货、中途转移、分配、发货等步骤，怎么也要在一天半以上才能够送到。据他了解，十几年来无论物流行业怎么努力，都无法超过这个时间极限，而这件位于遥远南方的衬衫是怎样像同城快递一样的不到十个小时就送到了呢？莫非这也是扎克伯格的功劳吗？\r\n事实上，Sam还忽略了一个重要的细节——他可能是还没有从失望中缓解过来吧——他甚至没有输入送货地址——它是怎么知道我要货物送到公司还是送到家里呢？直到中午吃饭的时候向同事炫耀那件衬衫的快递速度的时候，他才想起这个重要的细节。\r\n于是他决定再做一次网络购物。这次他想要买一本关于物流方面的书。他展开ipaper，打开了一个叫“图书搜索引擎”的软件。\r\n软件的界面很简单，只有一个像谷歌主页上一样的大大的搜索框和搜索按钮，不同的是上方还多了醒目的一句话：“请输入您的问题，而不是书的名字。”\r\n不是输入名字？“这句话到底什么意思？”Sam想。\r\n“扎克伯格真是个怪人，为什么每个东西都和我的认知相抵触呢，”Sam心里发着牢骚，“难道我真是来自于过去的人吗？”然后他又再次点击了界面右上角的问号标志，也许这次Lily还能够帮他解决疑问。\r\n果然，界面上又开始播放一段视频，而画面中出现的正是那个漂亮的Lily。\r\n“您好，尊敬的ipaper用户。您正在使用的这项功能是苹果公司精心为您研制的超级图书搜索引擎。不同于您以往查找图书的过程，在这里您不需要输入某本书的名字，也不需要按照某本书的分类而逐个的去查看，您需要做的全部就是告诉我们您想要知道些什么，或者您需要解决的什么问题。将您的问题输入到界面上的搜索框中，系统就会为您自动的提供一切能够解答您的问题的书籍。没错，一切都是这么简单。谢谢。”\r\nLily又随着视频画面自动消失了。\r\nSam想，如果这是真的话，那可真是个好东西！读了这么多年的书，一直困扰我的就是怎么找到我所需要的书——我想要学习的知识太多了，但我却不知道那些知识在哪！就打比方说吧，我想知道怎么治疗失眠，那么我应该看什么书呢？搜索书名叫做《治疗失眠》吗？还是到医学分类的几千本书里去一本一本的找呢？上大学的时候，我的数学一直跟不上老师的进度，快到了考试的时候，我总是想着如果能有一本教我在十天之内学会微积分的辅导资料就好啦。可是那本叫《5天自学微积分》的好书，直到我的数学挂科之后才偶然在书店里发现。但那一切都晚了——如果这个图书搜索真的有那么神奇的话，将会解决我多少的问题啊！\r\n在Sam看完Lily的介绍视频之后，闪现在脑海里的就是那些一连串的“找书”之痛。\r\n然后他定了定神，在搜索框中输入了一句相当于魔法咒语般的句子：“我想找到关于物流的历史以及物流行业当前的状况。”点击搜索键，不到1秒钟，界面上就显示出了一个图书列表。\r\n列表上方写着一段话：“根据您的问题，我们为您找到的关于[物流]的历史以及[物流行业]的当前状况的书籍如下。”\r\nSam看到列表里出现了几十本书，每本书的名字旁边都有书籍的封面，名字的下面有描述物流的历史或现状出现在书籍的哪些章节里。比如第一本叫《一个箱子的旅途》，封面上画的是一个放在飞机上的快递盒子，下面简介中说这本书写的是快递行业的现状，包括优点和缺点的分析。第二本叫《我的十八份工作》，讲的是一个人在十八份工作中所经历的事，其中一份工作是快递员，深刻体会到了物流行业的一些状况，并产生了很多的感想。第三本叫《网络购物的发展历史》，其中有一章是专门描述跟随网络购物兴起的物流行业的发展历史。第四本叫《物流学》，系统的介绍了有关物流的发展、现状、运作系统等相关知识。\r\n看到第四本，Sam的脑海中再一次产生了很多疑问。\r\n他想，ipaper是怎么做到的？明明前三本书里没有一本的名字有“物流”两个字，甚至整本书都不能算在与“物流”相关的分类里。但是书里出现的东西确实是自己希望知道的啊。第四本《物流学》虽然毫无疑问能够解答他的问题，但是那样以“学”结尾的书籍一般都过于严谨而难懂，这对于身为非物流专业的他未免有点吃力了。反倒是第二本小说更能让他快速的了解到这个行业的东西，毕竟讲故事是最容易让人接受的。\r\n最后，Sam选择了那本《我的十八份工作》，电子书版本的是0.3元，纸质书版本的是15元。为了再次体验一下物流情况，Sam选择了纸质书的购买。\r\n像上次一样，购买过程及其简单——点击了确定以后，付费就已经成功了。然后Sam马上在ipaper提供的查询银行账户的功能里，看到银行账户已经减少了15元。\r\n下班后，Sam回到了自己的公寓。他想到这几天的经历，又想到在做新闻调查过程中的失落，感到有些疲惫。于是他换了身休闲的衣服，从公寓出来走到附近的一个酒吧，喝一杯啤酒轻松一下。\r\n这时是晚上8点钟，酒吧的门口的风铃铃铃的响了一下，走进来一个身穿联邦快递制服的人，他径直朝Sam走了过来。\r\n“您好，Sam　Winchester先生。这是您的快递，请签收。”那个快递员说。\r\nSam这时正在喝一口酒，因为太突然，他把酒都呛了出来，然后很狼狈的看着快递员，说“你确定这是我的快递吗？”\r\n“是的，Sam　Winchester先生。我们系统中有您在下午三点二十分的订单，而且还有您的地址和头像信息，不会错的。”快递员说。\r\nSam目瞪口呆的看着这个联邦快递公司的快递员，愣了几秒后，他接过对方手中的包裹和笔，在单子上签好名字后，快递拿着单子走出了酒吧。\r\nSam看着手中的这本书，然后闷了一口啤酒，自言自语的说：“好家伙，扎克伯格！你一定是嫌我今天受到的刺激还不够吧！”\r\n当Sam正在百思不得其解物流公司是怎样操作的时候，手机响了。\r\n他从牛仔裤兜里拿出卡片大小的ipaper，看到是那个中国的朋友郭明明打来的电话。\r\n“嗨Sam，你前几天让我给那些校长发的邮件，有人回复我了，不知道是不是你想要的那个？”\r\n原来，前几天Sam想到了一个主意，就又给这个中国朋友打了一个电话，拜托她帮忙给中国的一些校长和相关学术界的人发邮件，看看有没有什么线索。\r\n“喔，真的吗，”Sam兴奋地说，“太谢谢你了，郭明明。请赶快告诉我吧，我正等得着急呢！”\r\n“那是一个匿名的人给我回复的邮件。里面说到，也许你提到的‘中国读书运动’不是已经发生的事，而只是一个还处于理论阶段的概念。”郭明明说。\r\n“还没有发生的事？”\r\n“是的。邮件里还说，即使是这个理论，也没几个人知道。而他只是偶然间看到过这个论文，但是具体内容记不太清楚了，只记得个大概。”\r\n“好的，那太好了！那么快告诉我这篇论文讲的是什么吧，我有预感它一定是我想要的，嘿嘿！”Sam像个小孩子一样兴奋的说。\r\n“哦那好吧，先别高兴的太早。邮件里提到，论文的标题应该是《读书系统的革命》，里面主要是分析了图书相关的一整条产业链的情况，并研究了未来可能的趋势，然后作者设计了一套系统，打算利用互联网技术，重组整个图书产业的盈利链条，如果真的能付诸实践的话将会是一场大范围的读书运动，这场运动将…”\r\n“就是它！”Sam还没有等郭明明说完就打断了她，“肯定就是它，没错！那个，作者叫什么？”\r\n“这个，邮件里说不知道，能记住得也就是这么多了。”\r\n“那好吧，这样吧郭明明，”Sam说，“麻烦你再帮我一个忙，既然有了这篇论文的名字，就再向中国的校长们查一查有没有这篇论文的档案。”\r\n“好的，包在我身上了，哈哈！”\r\n结束通话后，Sam抑制不住内心中的兴奋，又点了一瓶啤酒后猛的干了下去，心里念着：“感谢上帝！”\r\n然后他想，如果这正是他要的东西，那么扎克伯格所说的灵感，不是一场已经发生了的运动，而是中国作者所预示的一个即将发生的运动，而这个运动最终由扎克伯格付诸实践。\r\n想到这里，Sam已经不能自已了——他太高兴了，甚至在走出酒吧的时候撞到了门。\r\n\r\n又过了两天，Sam接到了郭明明的电话。\r\n对方说，已经查到这篇论文是某学生的毕业论文，论文本身没有存档，只是在学生档案里写了论文摘要，和那封匿名信提供的信息是一致的。\r\n“那么，作者叫什么名字？”Sam迫不及待地问。\r\n“他叫谢小波。由于时间太长了，所以现在在哪里还不知道。”\r\n“谢小波。好的，我记住了，剩下的我自己就可以解决了，谢谢！”\r\nSam又走到了吸烟区，舒缓了一下心情。然后找到了Andy，两人交换了一下意见，就一起来到了主编的办公室。\r\n\r\n第六节 北京\r\nAndy对主编说：“我想Sam这次的收获真不小，你看，他不但解答了扎克伯格希望让人探索的秘密，还抓住了秘密背后的故事。Sam，你对主编说说吧，把你知道的都说出来。”\r\n于是Sam将这几天他所了解的事都一五一十的告诉了主编。\r\nSam说完后，看到主编双指交叉，低头似乎在思索什么，眼中泛着异样的光芒。\r\n“听着，Sam，”主编严肃地看着Sam说，“你知道吗，你发现了一个了不得的事情。这部产品的确不是传统意义的一个智能机，它代表的是打破过去一切传统的产业结构的银色子弹！Andy你也听好，抓住这种引领时代的事件，正是我们《时代》从创刊以来核心的宗旨。明白吗？”\r\nSam和Andy两人纷纷点头。\r\n主编接着说：“我们不要着急发布，一定要把专题的质量放到第一位。以目前的形势来看，别的媒体所掌握的信息还远不如我们。下一步，Andy，你带着Sam一起去一趟中国，”主编指着后背墙上的世界地图说，“去会一会他，我想你们还能够从他那里获得更多的信息。明白我的意思吗？”\r\n“明白！”两人一起说。\r\n“好了，抓紧时间，不管用什么方法，赶快联系到他。订票和出差费用的事你们直接和行政部沟通，手续我会替你们办好的。快去吧。”\r\n两人离开了办公室。\r\nSam的心情非常激动，在这之前也许只是自己的胡思乱想，而这次主编竟然能认可他的想法，并重视到如此程度。再加上有经验丰富的Andy陪同，他感到信心倍增。\r\n这个旅途对他而言，对《时代》而言，都是意义非凡的。\r\n\t\r\nAndy联系到了《时代》在中国分部的同事，简单的说明了情况，并表达了主编的意思。\r\n那边很快的通过公安系统的朋友查到那个作者的联系方式以及住址。Andy又拜托中国当地的行政部联系一下作者，安排好他们的会面。\r\n这前前后后仅有不超过十几分钟而已，Andy表现出了一个经验丰富的记者应有的姿态，让Sam感到非常敬佩，他想，自己也一定要努力，争取成为像Andy一样的专业的记者。\r\n\tAndy与Sam一起来到了行政部，在填写了一些必要的文件后又来到了财务部，领取了主编签字划拨的差旅费用。然后对Sam说：“我们有两个小时的准备时间，你现在就回家准备东西，两个小时候我们回到这里集合。”\r\n“好的！”\r\n\tSam没想到公司的办事效率这么高，还没来得及反应过来，就已经安排好了行程。\r\n这与做记者之前的自己所过的拖拖拉拉的生活完全不同，“的确，我也该打起精神了，别忘了我可是《时代》的记者！”Sam想。\r\n\t两个小时后，Sam和Andy回到了公司，每个人都拖着一个旅行箱。\r\n这时行政部的人走过来，把已经订好的两张机票递给了他们。起飞的时间是当天晚上6:30。时间已经不早，于是Andy和Sam就在机场附近简单的吃了一顿快餐，按时登上了去往北京的飞机。\r\n\r\n坐上飞机后，两个人一开始并没有交谈，而是各自在考虑一些事情。Andy在想接下来应该怎么样和那个神秘的作者谈话，才能得到想要的信息；而Sam想的是，这一连串的事似乎来得太快了：本以为解答出那个“秘密”时就已经结束了，但实际上那只是非常浅薄的一层含义，别人也可以很快解答出来，然后被媒体纷纷报道。这次两人去北京，却是抢在任何人之前挖掘“合作”背后更深层的故事。\r\n想到这里，Sam的心跳不禁加快了起来，他不知道这次等待着他的又是什么。\r\n这时Andy打断了Sam的思路，他把已经有的一些采访的构思和Sam交换了一下意见。\r\n很快，飞机就到达了北京。\r\n他们住进了北京分公司安排的酒店后，得知与作者会见的时间定在了第二天的早晨，地点位于美国大使馆附近繁华地区的雷雨咖啡——在当地有点名气，经常有一些美国人喜欢到那里去。\r\n北京的同事还告诉他们，作者说明不需要翻译陪同，因为他自己可以进行正常的英文交流。这也给北京分公司减少了不少负担。\r\n\r\n第二天，也就是10月19日星期六的早上九点半钟，Andy与Sam如约来到了雷雨咖啡。\r\n走进了这家具有浓厚美国本土气息的雷雨咖啡，两人很快就找到了作者谢小波——他们的北京同事给他们发送了这个人的照片。\r\n他正坐在靠着窗户一个位置，两人走过去很热情的和作者打了招呼。\r\n\tSam仔细的打量着眼前的这个人，他不敢想象，这就是一天那个启发扎克伯格的神秘作者，而现在这个人就在他的眼前。\r\nSam看到，这位作者年龄并不大——至少与他想象的满头白发的历经沧桑的形象要有很大差别——大概也就是三十岁不到的样子。他穿着整洁干净的浅蓝色条纹的衬衫，深蓝色牛仔裤，黑色的短发，和年轻的面容。使人印象最深刻的是，他的眼神很深邃，仿佛在那双眼睛的后面正藏着极大的智慧。\r\n作者很有礼貌的叫来了咖啡馆老板，Sam看到这个人正是自己多年前来中国游玩时认识的那位咖啡馆老板成禹。\r\n老板很快的认出了Sam，然后热情的说：“真没想到你来中国了，怎么提前没打招呼啊。对了，上次你问我的那个事，我又问了一些朋友，还是没有人知道，真是抱歉！”\r\nSam略微尴尬的说：“没关系，我已经解决了，非常谢谢你！而且我要找的人坐在我的对面。”\r\n老板看了看坐在Sam对面的作者，两人互相点了点头，然后说：“既然你们来了中国，而且到了我的咖啡馆，那就是我的客人，你们这桌我请客了，你们等一下，我去安排。”\r\nSam不好意思拒绝老板的热情，只能连说谢谢。\r\n在简单的自我介绍后，Andy向作者说明了他们来采访他的目的因为他在2013年写的那篇《读书系统的革命》，所以想当面向他请教一些问题。\r\n\t“是的，昨天你们的同事已经告诉我了。真没想到，这么多年过去了还有人提起我的那篇东西，”作者说，“而且还是特地从美国过来的时代周刊的作者，我真是受宠若惊了！”\r\n“谢先生，您的这篇论文在我们编辑部引起了非常大的重视，不过有一点小问题，”Andy说，“我们只是看到了您的这篇论文的摘要而已，所以这次来还想看一下它的全文。”\r\n“什么？”作者惊讶的看着Andy，“你是说，你们只是看到了摘要就从美国来找我？”\r\nSam刚想说些什么，被Andy用眼神阻止了，然后Andy说，“嘿嘿，真不好意思，这个还有一些缘由，我想一会儿再和您详谈。”\r\n作者沉默了一会，表现出一些戒备的样子。\r\nSam见状急忙说，“谢先生，千万别误会，我们不是美国特工，我们是真的很看好您的文章，绝对没有什么不好的目的！”\r\n作者看到Sam的样子，才放松下来，笑了笑，说：“哈哈，我看你们也不像。好吧，其实里面也没写什么大不了的东西。那篇论文存在我的邮箱里，怎么给你们？”\r\n这时Sam拿出ipaper，交给作者，说：“请您就下载到这上面吧。”\r\n作者看到ipaper，挡不住惊讶地叫了出来：“ipaper！这就是那个神器！”\r\n咖啡馆的老板见状也凑了过来，新奇地观察着这部到处闹得沸沸扬扬的智能机。\r\n作者很快就熟悉了它的操作，这点点那划划，马上就把论文下载下来了，然后交给了Sam。\r\nSam看到作者这么熟练的操作，就好像他才是这部机器的主人一样。\r\n\tSam将ipaper展开，又引起了作者和咖啡馆老板的惊呼，同时还吸引了咖啡馆里其他人来围观。\r\n\t打开论文后，Andy和Sam一起读这篇论文。作者安静地、好像很享受地观察对面这两人不断变化的表情——Andy聚精会神、眉头紧锁，Sam瞳孔时不时放大，偶尔还会伴随着“噢”一声的感叹或惊呼。\r\n\t\r\n\tSam已经完全看入了神，他不知道旁人是怎样的，只知道自己好像被吸引进了另一个世界。\r\n\t展现在他眼前的论文，首先是那个占据了整个页面的一个大标题——“读书系统的革命”，第二行副标题“针对中国图书产业链的结构重组”，第三行写着“作者：谢小波”。\r\n这一页最下方标记着的论文完成时间是2013年3月。\r\nSam立时想到，距离现在已经有6年多了。如果扎克伯格是受到这篇文章的启发的话，那么他也许最早在2013年就已经形成了ipaper的想法。\r\n如果是这样的话，那可真是一个非常值得报道的内容。\r\n\tSam决心一定要仔细的分析这篇论文，抓住扎克伯格创造的这个划时代的机器的背后的故事。\r\n他相信这无疑是个非常棒的主意——如果能够解析扎克伯格的这部神起机器ipaper是怎么来的，它的运作后台的内在逻辑与运作基础等等秘密都挖掘出来，那么做出来的报道专题一定会深受广大的使用者、行业研究者、业内人士与竞争对手的追捧的。\r\n从目录可以看出，全文分为六章。\r\n\r\n\t第一章是引论，开篇是这样写的：\r\n\t“在高度竞争的现代化社会中，掌握充足的知识成为了人们竞争的主要砝码，而读书作为人们最主要的充实自己的手段，却走进了一个颇为尴尬的境地。\r\n\t“一方面，由于工业、信息业、交通业的高速发展，图书的产量呈几何级数爆炸式增长，读书的方式也不断的增加。虽极大的方便了读者，但太多的选择反而使人不知所措，在有限的时间里，读者不知道应该怎样读书、也不知道读什么书。另一方面，由于书籍产业的高度竞争，也使相关的出版社、图书商、电购平台面临一个销售窘境。\r\n\t“实际上，大量的书商销量不佳，并不是因为读书的人少，而是因为没有找到一个满足读者真正需求的方式。换言之，是上层结构拖累了全体的进步。由此我设想，如果能够推翻原有读书系统的结构，按照符合时代发展的新需要重新构建一个更加先进的读书系统，掀起一场知识的改革，将会大大的解决这个的矛盾。\r\n“将客户的需求与企业的产品设计统一起来，以最广泛的需求为产品的开发目标，是永恒不变的高盈利模式。因此，本文的中心目的就是寻求一个需求与设计的合理的结合模式。”\r\n\r\n“说的好！”Sam想。的确就之前他所知的那些与图书、出版相关的公司，这些年来经营的都很艰难。新闻上不断报道着这样那样的图书销商、出版社在纷纷倒闭。虽然这几段还看不出和ipaper有什么关联，但他还是接着往下看。\r\n\r\n“所谓“读书系统”，指的是于读书相关的所有环节，包括出版环节、销售环节、阅读环节、检索环节等等。它既包括了图书的产业链条，也包括了读者的体验过程。\r\n“之所以进行这种设定，是因为在当前这个科技、思想、经济都大发展的时代，读书系统已不是以往那种单纯的“出版社出书-读者买书”的结构了，而又融入了更多元的因素，例如互联网。\r\n“它使整个链条都复杂了起来，所以为了适应新时代的变化、达到进步，我们有必要对所有这些传统环节、新兴环节重新整理，并构造出一个更合理的、更进步的系统。”\r\n\r\nSam不禁想：“这个中国作者到底是要做多大的一个项目啊？别人都只是专注于自己的公司经营的好不好，而他却试图改变所有公司的命运！”还没有进入正文，Sam就不禁佩服起了作者的勇气。\r\n\r\n然后就进入了第二章，即现状、未来趋势和分析。\r\n这一章先提供了一系列数据，然后论证了为什么电子书会完全代替纸质书。为了节省篇幅，在此我们就不将原文全部摆上来了。\r\n作者又写到，既然确定了纸质书和电子书的关系和发展趋势，那么基于这个论点就可以先设计出一套完善的产业盈利结构，然后再探讨如何从传统的产业结构向新结构过渡。\r\nSam想，这个口气听起来并不像是一个图书产业的事情，那更像是一个国家的产业革命。作者正是像要掀起这样一场革命似的。\r\n\r\n第三章，是针对当前主要问题的对策。作者在这章花费了大量的篇幅，从两大方面进行了讨论。一方面是图书产业经营者方面的问题，一方面是读者需求方面的问题。由于以后还会讲到，这里也让我们先跳过吧。\r\n来看第四章，读书系统的总设计。\r\n这章就到了全文最重要的地方了，Sam更打起了精神，像在大学期间学习知识一样的认真起来，把自己想象成一个专业的研究者，只有从专业的角度去研究这篇论文，才能够发现扎克伯格的核心秘密。\r\n作者写到：\r\n“简单的说，本文所提出的[读书系统革命]，也可以看做是利用高度发达的互联网来做一次全产业一体化的合作方案，即推翻旧的系统，形成一套崭新的读书系统。\r\n这个方案的核心就在于——合作。”\r\n\r\n“合作！”Sam惊讶的看到这个当初扎克伯格在发布会上提示的关键词。这个解开ipaper秘密的咒语，又一次出现在了这篇神秘的论文里。\r\n\r\n“而合作的基础就是参与方共赢——只有你、我、大家都盈利了，才会有人同意合作。\r\n“所以在本章的系统设计中，我将着重探讨每一个环节的盈利点。只有将每一方的盈利说清楚，才能够在此基础上进行更细致的实施方案设计。”\r\n然后在文中的漫长篇幅中，作者设计了每一个环节的经营者如何从合作中盈利，使每个人都从中获得比系统成立之前更多的利益，达到多方共赢的状态。\r\n作者甚至为每个环节都设计了非常详细的合作方案，Sam此时已经对作者感到无比的钦佩。他想，也不知道这个作者是何方神圣，为什么从来也没有听说过呢？为什么这么好的文章却从来没人提起过呢？\r\n然后他又想到，扎克伯格不正是将这个多方共赢的合作系统应用到现实中的人吗？不得不说，他可真是个厉害的角色，发现了这样文章，并且还将它付诸了实践。可是这明明是6年前的文章啊，为什么我到现在才知道呢？\r\n怀着复杂的心情，Sam继续看下去。\r\n第五章，由旧系统向新系统的过渡策略。文中先对传统图书结构做出了一些描述，并强调传统的图书盈利链条仍然是占绝大部分的。因此要撼动这么坚固的结构并不是一朝一夕的事情。因此如果要实现新系统，就必须做好长期的准备。\r\n然后，作者提到，他在研究经济学与社会学的过程中，发现了一个时间模型。\r\n如果要做长期“战斗”的准备，就需要知道这个长期到底是多少年。他的这个模型就是一个数学公式，公式非常复杂，简单理解就是：一个东西越复杂，人们就需要用更长的时间才能接受它。\r\n“历史上无数伟大的科学家，在自己的那个时代被人称作是疯子，就是因为他们所提出的事物超越他们所处的那个时代太多，如果他们能够明白这个道理而晚些年再提出的话，就不是那样的境况了。”\r\n作者利用这个公式算出来，他所设计的这个新的读书系统，让全中国普遍接受的时间在15年左右，而在技术最发达、经济环境最自由的美国，是6年左右，误差不超过2年。\r\n读到“6年”时，Sam的眼睛已经瞪得不能再大了——“我知道了，我知道了！原来扎克伯格早就知道了这个结果，所以他才会选择在2019年发布这个产品的！”Sam激动的想。\r\nSam此时已经忘记了周围还有人在看着自己，忘记了自己还有采访的任务，只是单纯的陷于对作者一系列设想的钦佩上。\r\n\r\n到了最后一章，作者重申了合作的重要性，并对系统做出了一个美好的期望。然后写到：\r\n“这篇论文并不是给一般读者看的，而是希望位于读书系统的高层人物，或是有意为新型读书系统进行努力的人从这里得到一些启发或参考，来一同推进时代的进步。（全文完）”\r\n\r\nSam呆呆的倚在自己的座位上，不知道该做些什么，剩下的只是无尽的感叹。Andy虽然是身经百战，此时也是不知道该说什么。\r\n两个人都低头看着屏幕，陷入了沉思之中。\r\n如果单纯是这篇论文，也许并不足以让一个常青藤的MBA高材生和一个经验丰富的记者惊讶，顶多只能让人觉得作者想象力不错而已。\r\n但正是因为有人实现了它，并且在这两人所在的国家引起了不同凡响的影响，才更让人对这个始作俑者表现出如此的惊叹。\r\n\r\n这时作者打断了他们的思路，如果这时没人说话，他们还会继续沉思下去。\r\n作者微笑着说：“现在，该告诉我你们的故事了吧？”\r\n\r\n第七节 扎克伯格与乔布斯\r\n这时两个人才回过神来。\r\nAndy示意了一下，Sam按照两个人在飞机上商量好的，简单地把从发布会开始到解谜，再到扎克伯格的提醒，以及得知论文的事都告诉了作者。\r\n“谢先生，我们本来只是抱着了解一些情况的心态来的，”Sam说，“没想到看到这样一篇厉害的文章，我是真的被您的想象力和分析力震惊了！”\r\n“哈哈，您太夸奖了。从来没有人在我面前这么认真的读我写的文章，光是这一点，我已经非常感谢你们了！”作者谦虚地说。\r\n“不过，听你们这么一说，我有一些疑问，”作者接着说，“扎克伯格是怎么知道我的这篇论文的？”\r\n“什么？不是您给他的吗？”Sam好奇的问。\r\n“当然不是了，”作者说，“这是我的大学时候的毕业论文。当时我的导师说虽然写的不错，但是太异想天开了，根本不可能实现。为此我还郁闷了好一段时间呢。”\r\n“不可能实现！苹果可是在您这个想法的基础上完美的实现了啊！”Sam激动的说。\r\n“的确，我也很惊讶，原来真的有人能实现。不过我还是很好奇，它是怎么会到扎克伯格的手上的。”作者说。\r\n\r\n其实，在场的所有人都不知道。在6年前，也就是2013年作者把论文提交到学校。学校将所有论文的摘要记录在档案里，给出一定的成绩后，就把所有毕业生的论文原件都丢到了垃圾桶里。\r\n这时一个有心人在周围没人时从垃圾桶里回收了这些论文。当他看到作者的这篇论文时，也是眼睛一亮。正好当时Facebook网站正在举行奖金丰厚的创意大赛，这个有心人就用翻译工具把这篇论文翻译成英文，发到Facebook公司的邮箱。但是它在比赛上并没有拿奖，事情也就这么告了一段落。而扎克伯格是如何发现这篇论文的，后面我们还会讲到。\r\n\r\n“谢先生，”Andy说到，“我们希望您能够帮我们一个忙。”\r\n“您说。”作者答道。\r\n“希望您能和我们一起去美国加州，见一见扎克伯格先生。因为就像刚才Sam所说，如果扎克伯格能够见到您，就会答应我们的采访。”\r\n作者并没有回答，而是陷入了沉思中。\r\nAndy马上说到：“关于费用的事情您完全不用担心，这个会由我们时代周刊全部提供。而且，如果您能答应的话，我们还会有额外的一笔奖励金。希望您一定要答应！”\r\n作者还是没有说话。两个记者此时都没有意识到作者考虑的完全是别的问题。\r\n又过了几分钟，作者终于开口了。\r\n“好吧，我答应你们，正好去美国玩一玩，哈哈！”\r\nSam和Andy如释重负，开心地和作者握手。\r\n\r\n采访还在继续，把几个主要问题说清后，气氛明显轻松了起来。三个人开始随意的聊了聊天。\r\n“哈哈，告诉你们一个好玩的事吧，”作者说，“你们不觉得扎克伯格和乔布斯的命运有什么关联吗？”\r\n对面的两人呆呆地看着作者。\r\n“我也是觉得很巧，所以你们就当听笑话吧。”作者说。\r\n两人点点头。\r\n“比如说他们都是20岁就开始创业；\r\n“乔布斯在车库里创办了苹果公司，扎克伯格在大学宿舍里创办了Facebook；\r\n“他们都是玩技术的怪才，乔布斯玩电子，扎克伯格玩编程，他们在高中时期对技术的狂热爱好远远超出了同龄人，很早就开始发明东西；\r\n“他们都从大学辍学；\r\n“他们的性格都很古怪。”\r\n作者看到Sam和andy听得正出身，很得意的接着说，“最重要的是，他们的理念都一样：为了创造伟大的发明，引领时代的进步，而不是为了赚钱！”\r\nSam点点头。\r\n作者接着说，“这些你们可能都知道，但有趣的来了。我查了他们两人的一些经历，如果把它们联系起来，就很好玩，哈哈！”\r\n“快说吧！”这时站在旁边等着听故事的咖啡店老板说。\r\n“你们看，”作者饶有兴致的说，“1946年，世界上第一台计算机出现在了美国吧。但是经过了十年还是那么笨重，有什么办法呢？于是乔布斯出生了。哈哈”\r\n“这个笑话就有点太冷了。”咖啡店老板说。\r\n“别急嘛，反正是瞎说的，”作者说，“如果说存在命运的话，那么叫命运的那个家伙也等不及把那些笨重的计算机给弄一弄了，所以还没等乔布斯毕业就叫他退学了。在乔布斯成立苹果公司之后，1984年弄出了第一台微型个人电脑。\r\n“这是跨时代的产品了吧。但这还不够，光有硬件不行，软件还得跟上啊，这时候扎克伯格出生了。哈哈，1985年。\r\n“然后命运的急性子又犯了，扎克伯格刚到十岁就给了他一台电脑。同一年，乔布斯也成立了一个动画公司，制作第一步3D动画《玩具总动员》——两个人都开始了一段新事业。\r\n“后来的几年里，乔布斯大绽光彩，而扎克伯格也正在初中学校里展现他惊人的编程天赋；\r\n“2000年，乔布斯重新登上苹果CEO的宝座，扎克伯格也在高中学校里编出一些新鲜的软件；\r\n“2003年，乔布斯年龄也不小了，该给年轻人让让路了，于是10月份，乔布斯在医院检查到了自己身上的胰脏肿瘤，同一个月，命运让扎克伯格受到了感情的刺激，突然一个灵感启发他在大学宿舍里创建了Facebook的前身Facemash；\r\n“2004年，乔布斯被确诊为胰腺癌，几乎面临死亡，他一心只想着培养苹果的接班人，怎样才能找到替代他继续引领苹果、引领科技进步的人，这时扎克伯格闪亮登场了——Facebook正式上线了！难道这不是命运的巧妙安排吗？！”\r\n说到这里，作者看到Sam和andy都听得正出神，很难说挂在他们脸上的表情是相信还是怀疑，也许各占一半吧。\r\n\t作者接着说下去：“这个时候，Facebook顺利运行后，命运放心多了，于是就看着这两个人怎样为时代进步而努力。\r\n“2005年，乔布斯重返到第一线工作，重点开发当时的高度机密项目——iphone一代，那个开天辟地的智能手机，此时扎克伯格的facebook也如日中天的侵占着各个国家的网络；\r\n“2007年，乔布斯发布了那部划时代的尖端手机iphone一代，同时扎克伯格的Facebook成为世界上最大的社交网络。\r\n“因此命运让乔布斯关注到了扎克伯格这个人，并且直觉上就很喜欢这个小伙子，扎克伯格也说自己是乔布斯的信徒，《乔布斯传》的作者说，他们两个人之间似乎存在着一种‘奇怪的亲密关系’；\r\n“2010年，命运想，时机差不多了，也该新老交替了，乔布斯的身体到达了极限，癌症在全身快速扩散，而扎克伯格却走上了巅峰，他获得《时代》的年度人物称号，Facebook在这一年超越谷歌成为了全世界点击率第一的网站。”\r\n这时作者停顿了一下，看到Sam和andy的表情已经僵住了，仿佛他们是在听一个恐怖的鬼故事一样。\r\n作者慢慢悠悠的喝了口水，咖啡厅老板再次提示他快讲下去。\r\n作者继续说：“这里才是关键。2011年，9月份扎克伯格召开了当时大型的Facebook第一届开发者大会，并在会上做了著名的演讲，提出了划时代的‘开放平台’概念，乔布斯得知以后非常满意，他知道自己后继有人了，同时他也知道自己再也扛不住癌症的痛苦了。\r\n“然后，你们知道的，乔布斯在第二个月发布了iphone4s，完成了他人生最后的一个引领时代的任务，第二天就去世了。”\r\n作者低头闭目，双手合十默哀了几秒钟，两个记者也跟着一起默哀——毕竟，那个时代过来的人，没有人不为乔布斯的去世而感到遗憾。\r\n作者接着说：“故事就到这里了，你们看，怎么样？”\r\nSam还没有从那奇妙的命运故事中愣过神来，缓了一会儿，然后说：“棒，太棒了！真的是这样吗？如果命运真的这么有趣，放在我们的报道专题里，肯定会有很大的反响！”andy也表示同意。\r\n作者笑了笑，说：“好吧，这个故事是你们的了。反正从我嘴巴里说出去，也没有什么影响力。既然觉得有趣，你们就拿去写吧！”\r\n\r\n然后双方又简单的聊了几句，这次的会面就结束了。回到酒店的路上，Sam向Andy提议将乔布斯与扎克伯格之间的奇妙命运也写进专题，Andy表示同意，如果可以的话再进行一些调查，润色一下再发表。\r\n\t到酒店放下了采访的设备，Sam联系了那个给他帮了大忙的郭明明，约在了附近 的一间西餐厅，希望能够当面感谢她，毕竟能够找到那个作者完全是她的功劳。\r\n\t见到郭明明后，简单的寒暄了几句，然后向她说明了苹果的那个产品的大概情况。Sam说，这个产品在广告投放上也有非同小可的进步，到时也许可以和郭明明所在的传媒公司合作。郭明明表示非常感兴趣，并要求在Sam的报道专题完成后一定第一时间通知她。\r\n\r\n第二天，两个记者坐上了飞回纽约的飞机。\r\n他们感到信心满满——这次来北京果然收获真不小（主编果然有预见性）：得知了扎克伯格实施的产品战略的核心思想，乔布斯与扎克伯格的命运，最重要的是，不但解答了扎克伯格出的谜题——他的灵感来源是哪里，还超额完成了任务——把原作者都带了过去！\r\nSam一想到这里，心情就无与伦比的高兴。\r\n\r\n回到办公室后，两个人直接来到了主编办公室。Andy将这次的采访的向主编做了详细的汇报。主编拍着桌子大声叫好，并在之后的会议上大大地表扬了两个人。\r\n又过了几天，Sam接到了作者的电话，说已经动身前往美国。Sam向公司申请了专人接待以及相关的费用后，迫不及待地等着他的到来。\r\n10月26日周六的清晨，Sam来到肯尼迪机场接机。两人寒暄几句后，Sam带作者来到了时代周刊总部所在的大楼。\r\n在员工餐厅吃过早餐后，作者被带到总编办公室，一路上知情的员工都向他做了友好的问候，这让作者感到很高兴。\r\n主编表示热烈的欢迎后，再次向作者提出了一起见面扎克伯格的请求，作者很有礼貌的答应了。\r\n然后在行政部联系了苹果公司，并说明了大概的情况后，约定了会面在当天的下午三点点半。主编感到很惊讶，因为一般情况下像苹果公司CEO这样的大人物，时间肯定是安排得非常满的，能这么快的会见他们，说明对此异常重视。\r\n主编在做了一系列安排后，就叫Sam和作者两个人尽快动身前往。由于性质特殊，这次并没有让Andy随同。\r\n\t\r\n第八节 秘密协议\r\n\t10月26日下午3:30，Sam和作者准时出现在了位于加州库帕提诺的苹果总部。这次会面的地方是扎克伯格的办公室。\r\n\t办公室设计的很简单，摆放着很多个人物品和人物贴画，包括一张床，说起来，更像是一个男孩的卧室。\r\n\t扎克伯格热情的和作者握手。\r\n\t坐下来后，Sam简单的叙述了一下找到作者的经过，扎克伯格非常高兴地再次表示了感谢。\r\n\t三个年龄都相差不远的年轻人，聊得很投机。\r\n\t扎克伯格问：“谢先生，你是怎么想到写这么一篇论文的呢？我非常好奇。”\r\n\t作者笑着答道：“其实是我一开始写着玩的东西，后来马上毕业要交毕业论文了，来不及再写一个，就那么交了上去，哈哈。”\r\n\t“写着玩的？”扎克伯格惊讶的问到。\r\n\t“对啊，那个时候我成天都在胡思乱想，每时每刻都会产生无数的灵感，”作者说，“我有把灵感随时随地记录下来的习惯。那时我列出了二十多个感兴趣的论题，读书系统的革命只是我动手写的第一篇。”\r\n“我想问一下，你大学期间学的是什么专业？”扎克伯格问。\r\n“学的是金融专业，不过我还自学过几年软件编程，业余的时候喜欢研究社会学，总之我的爱好很广泛。”作者答道。\r\n“那么，你怎么会想起写关于图书业的文章呢？”\r\n“是这样的，我一开始想自己做一个读书检索的网站，但是因为那太费时间，所以就想把这个主意写出来给一些已经存在的读书论坛看，”作者喝了一口咖啡说，“可是呢，越写越有灵感，就索性把图书购买问题也写了进去，然后又加上了阅读方式的问题，到了最后不得不重新写一遍——因为我觉得把整个产业都写进去才有意思，嘿嘿！\r\n“当时我的经济学老师夸我的思维很活跃，还建议我把一些想象的东西写成专业性质的论文，这样有利于提高我的研究水平。我觉得整个研究过程有趣极了！”\r\nSam听着作者在说自己当年的想法时，感到坐在对面的就像一个活蹦乱跳的小孩子正在说着自己玩的各种玩具一样——这与他最初在没看到对方之前所想象的完全不一样，他不敢相信那种思维缜密、逻辑清晰、颇有预见性的文章，是出于这个喜欢幻想的大学生人之手。\r\n\t“那么谢先生，你写的这篇文章，后来被中国的企业采纳了吗？”扎克伯格接着问。\r\n\t“唉，很遗憾，”作者摇摇头说，“我给很多企业都发了邮件，甚至还给一些媒体也发了。但是得到的回应很少，即使有回应，也只是说我的想法太难实现。”\r\n他露出很失望的表情，接着说：“直到现在，还没有人采纳这篇文章，它就像石沉大海一样，”然后他又小声的说，“后来我知道了为什么——我的想法并没有错，问题是在中国的经营环境里，不是企业之间勾心斗角，就是政府管制太多。所以现在我自己也觉得那几乎是不可能的事！”\r\n然后他抬起头来看着Sam和扎克伯格，眼中泛着光芒，说：“但是美国就不一样了，你们是个自由的国家，如果这个东西在你们那里实行起来效果就不一样，”作者微笑着继续说道，“你们看，这不果然就在美国实现了吗！”\r\n扎克伯格看着眼前的这个年轻人，不知不觉从内心中升起了一种同情的心，他想，如果这个人是生在美国就好了，否则的话也不会这样被埋没掉。\r\n\t然后扎克伯格又了解了一下Sam的情况，发现这个年轻人不但是个高材生，而且也是个远大理想的人。正是因此，三个对未来抱有激情和梦想的人，能聊得很开心。\r\n\t时间很快就过去了，到了晚餐的时间，三个人来到了苹果公司的餐厅。\r\n\t作者赞赏了餐厅的伙食后，他们结束了这一次的会面。\r\n扎克伯格向Sam表示，他会如当初约定一样接受时代周刊的采访，同时又向作者表示，让他今晚就住在苹果安排的酒店里，第二天还有些事要谈。\r\n这样一来，Sam就一个人回纽约了。\r\n\r\n晚上，住在豪华的大酒店里，作者泡在浴缸里，回想着这高兴的一天。然而，他知道，事实也许并不像表面上那么简单。\r\n为什么他能接受这么高的待遇？为什么苹果公司的CEO会这么热情的对待他这么一个小人物？\r\n如果只是因为一篇论文的话，扎克伯格只要一封感谢信，或者一些奖金就能打发他了啊，完全没必要做到这样，这是为什么呢？\r\n\r\n第二天早晨，作者如约再次来到了扎克伯格的办公室，这次只有他们两个人。\r\n扎克伯格简单地询问了作者昨天的睡眠情况后，直接切入主题。\r\n“谢先生，首先我先要向你表示道歉，”扎克伯格说，“因为ipaper是基于你的设想开发出来的。虽然已经比你最初设计的读书系统多出了很多东西，但你仍然是功不可没啊。之前一直就像向你表示感谢，但是一直都找不到你，所以非常抱歉！”\r\n这时作者本来想说他所做出的贡献实在太少，本来读书系统只占了ipaper的极小一部分而已。但是他没有说出来，似乎想到了些什么，所以他选择了沉默。\r\n扎克伯格接着说：“都到了这个地步，所以我就直说了。”\r\n作者点点头。\r\n“我们想和你签一份合同，就是你许可您那篇论文里的所有创意都正式转交给苹果公司。条件由你出，你看怎么样？”扎克伯格严肃的说。\r\n作者没有马上回答。他瞬间想到了在中国发生过的种种商业纠纷。闹得最大的是几年前，中国的王老吉凉茶公司，由于没有获得那个凉茶秘方的创始人授权，而在商业大获成功后被告上了法庭，不但赔了几百万的罚款，还不得不把整个王老吉的商标拱手让出，直接损失甚至达到数亿元。\r\n这次扎克伯格向他提出创意转让的要求，明显也是出于这点考虑。如果自己过于谦虚的话，反而相当于放弃了一笔巨大的利益。\r\n就在作者沉思的这个时间里，扎克伯格也在想着自己的事情。\r\n其实从ipaper项目启动以来，他就一直在考虑着找到作者的问题，因为投入了巨大的资金，如果到时因为这个创意所有权的问题被告上了法庭，损失将会不可量计。但是直到ipaper发布后也没有找到，这让他很头疼。\r\n这时Sam的出现让他眼前一亮。一方面，扎克伯格本来就有计划要在ipaper发布后，搞一次大的正式的宣传，时代周刊正是一个最好的媒介；另一方面，又看到Sam恳求采访的态度，就干脆利用他来找到那个作者，这样一来一箭双雕。\r\n他没想到的是，Sam竟然这么快就找到了原作者。\r\n当他想到这里时，作者说话了。\r\n“既然您这么说了，那我就提一个条件，”作者同样严肃的说，“如果您能够答应，我愿意立刻就签写这份合同。”\r\n“你说。”\r\n“我希望移民美国，由苹果公司提供移民所需要的所有资金和办理手续，你看这样可以吗？”\r\n“完全可以！”扎克伯格只思索了一秒就痛快的答应了。毕竟移民所需费用与正常的专利、商标甚至互联网域名的转让费比起来要便宜太多了。\r\n“哈哈，”作者说，“那我们就这么说定了！”\r\n扎克伯格也高兴的与他握手。这样一来，作者得到了他想要的，扎克伯格也卸下了一直以来的包袱。\r\n扎克伯格当时就起草了一份合同，然后递给作者。作者详细的阅读，合同很简单，条款也不算多，所以出现漏洞的风险也少很多。\r\n作者还看到，合同最后一条指明，双方都有保密的义务，不能以任何名义将此合同告诉任何第三方。\r\n作者很爽快的签下了名字。然后扎克伯格派人订购了机票，并叫司机送作者回国。\r\n这是10月27日周日的下午。\r\n\r\n这段解谜就告了一段落。也许有好奇心重的读者，已经等不及的想听下一个解谜了——那就是当初扎克伯格答应Sam的，告诉他ipaper的开发全过程。\r\n\r\n第九节 Project-L\r\n2019年11月2日周六早晨9:00，Sam受邀再次来到的加州库帕提诺的苹果总部，开始了约定的对扎克伯格进行为期两天的采访。由于新产品发布后有很多的事物，所以扎克伯格只能选择在周末接受采访。\r\n扎克伯格带着Sam来到了停车场的一辆红色跑车前。\r\n“我的新车怎么样？”扎克伯格问到。\r\n“丰田86的2019版！”Sam激动的叫到。\r\n“哈哈，你还很识货嘛！”扎克伯格说到。\r\n丰田86虽然是一款只有40万元的平民跑车，很配不上扎克伯格这种级别。但它却是在跑车界很有名的漂移神车。出于年轻人对汽车的狂热，Sam自然知道它。\r\n扎克伯格指了指它，说：“走，今天就开我这辆新车带你去一个地方。”\r\n于是两人上车，开往了位于加州库帕提诺市南部的一个森林公园，距离苹果总部只有5公里的路程。\r\n进入森林公园的有多个S弯的道路后，扎克伯格露出一丝狡黠的笑容，示意Sam系好安全带——Sam本能地意识到，扎克伯格要开始漂移了！\r\n果然，扎克伯格连续挂档，速度越来越快，然后他高速地冲向一个急弯，右脚在油门和刹车之间快速地来回切换。\r\n车子好像失重般，在几乎要撞上护栏时甩了过去。Sam心脏似乎要停止了跳动，脑袋一阵眩晕。\r\n之后又是几个连续的弯道，扎克伯格就像电影里演的飞车一样甩过每一个弯道。\r\n几分钟后，车停了下来。\r\n打开车门，Sam腿一软，不由自主地跪在了地上。\r\n扎克伯格哈哈大笑，然后递给了Sam一瓶热咖啡，缓一缓神。\r\nSam喝了一口热咖啡，索性坐在了地上，点了一根烟。\r\n这时，他看到眼前的建筑物——一栋十几层高的破旧的建筑物，没有牌子，但看样子好像是一家酒店。周围被树叶已经掉光的大树环绕着，给人一种很是凄凉的感觉。\r\nSam想，一个酒店开在这种地方，会有生意吗？\r\n这时扎克伯格示意Sam起来，Sam掐灭了烟，随着扎克伯格一起走进了这栋建筑物。建筑物上所有的窗户玻璃都贴了暗色的贴膜，从外面几乎看不到里面是什么。\r\n打开陈旧的大门，Sam感到，这肯定是一家酒店，走进去正对着的是一个吧台，吧台正中坐着一个漂亮的女人，看上去有些眼熟。\r\n漂亮女人看到他们俩，热情的向扎克伯格打了招呼，但是对于Sam的出现却表现出了一丝惊讶的样子。\r\n然后扎克伯格领Sam来到了大厅一个角落，这里有两排相对的沙发，中间一个茶几，就像常见的咖啡厅布局一样。\r\n两人坐了下来，扎克伯格示意吧台的漂亮女人端来了两杯咖啡，然后说：“Lily，你先去忙别的事吧，这里有我呢。”\r\n于是那个女人就微笑着离开了。\r\nSam刚刚想要说些什么，扎克伯格就打断了他：“Sam，今天的采访就从这里开始吧，我看这一楼很安静，我就从头给你讲起吧。”\r\nSam点点头，然后从包里拿出三脚架和摄像机，镜头对着扎克伯格，试了几个角度后确定下来。因为此前扎克伯格提出了只邀请Sam一个人来，所以Sam不能带专职的摄像师来参加这次的采访，只能独自完成这一系列的任务了。主编对于扎克伯格这种怪异的要求已经见怪不怪了，所以就答应了。\r\n“那么，可以开始了吗？”扎克伯格问。\r\n“完全可以，您开始说吧，我非常期待您的故事！”Sam说到。\r\n“那就从六年前说起吧，”扎克伯格平静地说，“也就是2013年。”\r\n“果然是六年前！”Sam想。\r\n\r\n现在，让我们随着扎克伯格的讲述，一同回到六年前的那个时候吧。\r\n2013年3月，此前我们已经提到过，当作者谢小波提交了大学毕业论文之后，被一个有心人从垃圾箱里捡起，然后将论文翻译成英文匿名地提交给了Facebook创办的创意大赛。但是由于实现起来非常难，所以被评委小组完全否决了。\r\n需要我们知道的是，这个时期的扎克伯格，实际上处于一个人生最低落的阶段——他完全不知道自己的人生到底是为了什么才继续下去的？\r\n扎克伯格在大学还没毕业就创建了Facebook网站，那个将人类联结起来的时代性的网站。那可以说是他最伟大的成就。\r\n十几年过去了，他却还是在维护同一个网站。\r\n虽然网站在不断的增加新功能，但是比起当初的那种成就感，扎克伯格越发的感觉到无聊——当初的激情早已荡然无存。到底当初是为了什么才那么拼命的工作呢？\r\n扎克伯格已经感到麻木。\r\n直到一篇悼念乔布斯的一篇互联网文章出现在了他的眼前，这才渐渐的回过神来：\r\n那篇文章除了对乔布斯那个充满惊喜的时代表示怀念外，还举出了“后乔布斯时代”苹果公司的一系列衰落表现。这些表现就是新产品没有创造性，同类型产品不断被竞争对手取代等等。\r\n扎克伯格在这篇文章里同样意识到了自己的问题，对，就是那个——没有创造性！\r\n当初在大学宿舍，不正是为了那个原因而癫狂嘛！\r\n不是为了造福人类，也不是为了方便舍友，单纯的只是想实现自己脑海里的一个灵感，这一点，就足够废寝忘食地去做了。\r\n扎克伯格发现了这个问题所在，就想去解决它。解决问题的第一步，就是发现问题。\r\n于是，他举办了创意大赛。但是评委会选出的优秀作品远远达不到他的要求，他们不是希望制作一款软件，就是希望改进界面的美感，这些怎么能叫创造性呢？\r\n陷于人生瓶颈的扎克伯格，提出了休假，他需要调整一下自己的状态。\r\n就是从这时开始，他爱上了赛车。\r\n刺激的运动让他暂时忘记了事业上的止步，他在赛车场上还结实了很多朋友，他们大都不是职业的赛车手，在生活中也都是些小人物。但这些人却教会了扎克伯格很多东西，有些是赛车技巧上的，有些是由赛车引申出来的人生观。\r\n扎克伯格渐渐意识到，由于以前接触的越来越多的是大人物，现在却发现反而是这些名不见经传的小人物们更能给他带来灵感和自信。\r\n然后扎克伯格又突发奇想，也许可以回到公司，从一些基层的员工那里得到些灵感。\r\n抱着这样的想法，他回到了公司。\r\n但他从不参加公司会议，只是每天和一些基层员工闲聊。有时是聊员工的家庭，有时聊一聊娱乐，有时还会问员工有没有一些创意。\r\n这一天，当他和一个参与过创意大赛举办工作的数据录入员闲聊时，那个年轻的小伙子说到：“我倒是没什么创意，不过我觉得上次咱们公司举办的创意大赛里，其实有好多没获奖的提案倒是很有意思，你要是想看，我这里还有存档呢！”\r\n扎克伯格本来没抱什么希望，就随意的翻了翻年轻小伙子在电脑里摆弄出来的存档。\r\n当他翻到第三页时，瞳孔突然放大，表情严肃起来，然后对年轻小伙子说：“就是这个！你把它整理出来，马上发到我的邮箱！”\r\n小伙子也被扎克伯格这么突然的转变吓了一跳，然后立刻手脚麻利地整理出来发送了过去。\r\n扎克伯格一路小跑回到了自己的办公室，打开那篇提案，一遍又一遍的阅读。每读完一遍，眼中的光芒就越亮一点。\r\n\r\n当然，他看到的这篇创意提案，就是前面我们提到的那个作者的大学论文《读书系统的革命》。\r\n扎克伯格被作者的想象力深深吸引。\r\n论文从怎么让读者买到想买的书和怎么让出版商多赚钱这两个基本点出发，最后竟然引发出整个图书产业的进化。不得不说作者的勇气可嘉。\r\n大胆的创意，正需要这样敢于想象的勇气。\r\n扎克伯格最感兴趣的不是关于图书产业，而是作者为了这个产业而设计的一整套系统。\r\n这之中包括了基于强大语义分析的搜索引擎部分，安全便捷的网络付费部分，更适应庞大数据量的信息联结方式的部分，大胆却有效的物流运送部分，等等等等。\r\n扎克伯格立即就想到，这套系统其实是可以应用到互联网相关的所有产业的，如果能把它实现，那么就会引起所有行业的进化！\r\n说的夸张一点，甚至会带来新一次的技术革命！\r\n是的，历史上的工业革命、产业革命、信息革命，都是由技术的进步引发的，如果他能够抓住这个机会，他就是新一代技术革命的创始人！\r\n想到这里，扎克伯格的热血上涌，仿佛又找到了当初大学时的激情。\r\n事不宜迟，扎克伯格立刻召集了Facebook各个部门的负责人，在大会议室召开了会议。\r\n秘书将论文的全文发给了每个人，然后扎克伯格要求每个人都提出自己对这个提案的可实现性给出意见。\r\n十几分钟过去了，每个人都已经仔细读完了论文。接下来又是漫长的沉默，每个人的想法都不一样。\r\n终于，财务部经理打破了沉默，发表了意见：“这不可能实现，牵涉到这么多的部门和企业，预算上很难估量。”\r\n然后其他部门的经理也纷纷响应。\r\n技术部经理说：“如果连谷歌都做不到的搜索引擎，我们这个搜索界的外行怎么做呢？”\r\n行政部经理说：“按照这篇论文里的说法，必须要配合那么多的企业一起开发，这说起来简单，但是这种程度的合作怎么能说做就能做到呢？谁知道别人会有什么自私的想法呢？”\r\n应用程序部经理说：“的确，要和外部合作，就需要开发很多接口，凭我们目前的能力，很难达到。”\r\n市场部经理说：“作者虽然说要让每一方都从中盈利，但他的意见还太理论化了，实际上的多方盈利可是没这么简单的。”\r\n战略发展部经理说：“他还提到什么时间公式，什么六年后就能让所有人接受这个新概念，我看那根本是异想天开！何况那个公式根本就没有得到验证。”\r\n这时，其他部门还要说下去，被扎克伯格打断了。\r\n“等一等，难道你们就没人想到这个主意好的一面吗？”扎克伯格激动的说到。\r\n所有人都沉默。\r\n“我知道你们的想法，但是，正是因为那么的不可能，我们才要去做啊！如果有那么容易做到，我们的竞争对手不也能马上做到了，那么还有什么意义呢？”\r\n又是沉默。\r\n“我们再继续这种状态下去，肯定是要被对手击败的！如果我们不做点更有创意的东西，结局就会像今天的苹果一样！”\r\n沉默。\r\n“那么好，我最后问一句，有谁愿意和我一起干这个事？”\r\n漫长的沉默。\r\n“很好，很好！”\r\n扎克伯格气愤地站起来，环视每一个低着头的脑顶，然后又叹了叹气，什么都没有说，走出了会议室，重重地关上了门。\r\n第二天，扎克伯格就像董事会提出了辞呈，希望辞去CEO职务，只保留股东的股份和董事长的职位。\r\n董事会大为惊讶，无论怎么劝说都无法阻止。但是没办法，大家都了解扎克伯格的怪脾气，只好同意。\r\n最后商议结果是，保留扎克伯格的名义CEO职位，实际上却采用另外的人来管理公司正常运作。\r\n\r\n离开了Facebook总部后，扎克伯格没有回家，而是开着赛车在赛道上一圈又一圈的慢跑。\r\n虽然他仍是Facebook的股东，也仍是Facebook的CEO，但此时此刻他却好像失去了归属感——一切从零开始，开启一条新的旅途。\r\n扎克伯格想，这么庞大的系统，究竟应该如何入手？应该怎么制作？做到什么地步？\r\n这时突然乔布斯的形象浮现在了脑海，他想，如果是乔布斯的话，会怎么做呢？\r\n如果是乔布斯的话，那么，他只负责一点就够了——想象。其他的细节和实现，去交给专门负责的人就好了。\r\n想到这里，扎克伯格突然豁然开朗。\r\n\r\n在接下来的一段时间里，扎克伯格几乎没有出过家门，虽然偶尔会照顾孩子，但大多数时间他都在幻想，幻想一个完美的系统。\r\n灵感如泉涌般，不断有新的设想冒出来，每有一个新想法，他就用画笔把灵感记录在墙上。\r\n他先想，我要做一个什么样的系统？新型的读书系统？\r\n“不，我要做一套和它理念相同，但是扩展到互联网所有领域的新系统。”扎克伯格想。\r\n于是他在墙面的正中间写下“新互联网系统”。\r\n那么，这个系统需要些什么东西呢？也许可以从用户和企业的这个角度来看。\r\n如果他是用户的话，他需要些什么东西呢？\r\n扎克伯格又在墙上分别写下了“办公”、“娱乐”、“交易”。\r\n那么他需要什么样的体验效果呢？\r\n他在墙上写下了“简单”、“安全”、“省时间”、“好玩”几个词，每个之间的距离都很大。\r\n每写下一个词，他都放开思想的缰绳，任由其奔跑。\r\n然后，他在“简单”的下面写到：“不需要我考虑所有事情，甚至不需要学习怎么操作，即使古代人来了也能懂，我只需要知道他想要什么就行。我想在网上买东西时，最好是像现实中一样，看中了一样东西只要把钱掏出来递过去就可以了。实现：把所有多于3步的操作全去掉。”\r\n又在“安全”下面写到：“1，我的隐私要有一套最先进的保护系统。实现：也许可以把存有用户信息的数据库独立出来，交给政府监管，具体还要和专家们商量。”\r\n“2，我的钱不会丢。实现：人像识别、指纹识别、声音识别、密码识别。”\r\n在“省时间”的下面，他写到：“把所有浪费时间的东西全去掉，不需要下载一晚上的电影，也不需要每隔一段时间就安装新的系统，更不要无限地配置软件的参数。实现：能一口气实现这些的，也就只有云技术了！把东西全放在网上，对用户来说就没有下载的概念了；在云端把新系统都安装好，参数都配置好，我只要直接用就行了。”\r\n在“好玩”的下面，他写到：“不用考虑自己的电脑够不够配置玩最新的游戏，所有的游戏我都可以玩。实现：云技术。”\r\n\r\n扎克伯格又想，如果从软件、硬件这个角度来看呢？\r\n然后他在墙面写下了“硬件”和“软件”。\r\n“硬件”下面他写到：“最好是又薄又大又轻，看得清楚，又好随身带着。哦对了，还要待机时间长的！实现：也许我可以考虑一下电子纸的技术。”\r\n“软件”下面他写到：“1，必须要消灭平台的区别。我可不想在Windows平台的电脑上办公，又跑去安装了苹果平台的电脑上画画，然后又在Linux平台的电脑上弄服务器。实现：做一套完美兼容所有平台的平台。\r\n“2，如果每个软件之间不是互相独立的，而是都能像哥俩一样的互相配合，那该多好啊！实现：要求每个软件都提供一些接口，允许别的软件借用。”\r\n\r\n写到这里，扎克伯格非常有成就感，他沉浸在了自己的想象世界里，仿佛他已经来到了未来的那个世界一样。\r\n他从文件柜里拿出《读书系统的革命》，继续从里面找灵感。\r\n文中有一部分提到如何解决用户搜索的问题，也就是说用户想知道一些事情，系统怎么根据他的提问给出解答？\r\n这个问题在论文中分为两个方面做了讨论，一个是搜索引擎的方面，一个是存在于互联网上每一条信息的识别问题。\r\n扎克伯格照着论文在墙上写下：“1，搜索引擎要像一个有智慧的老人，能听懂人的话，然后回答人的问题。实现：看来我得找一帮语义分析专家来了。\r\n“2，就照论文说的，把互联网的每条信息按照神经元的结构联结起来，抛弃树形结构。实现：把论文里设计的QBD做出来。”\r\n扎克伯格接着在论文里找灵感。这时他看到了书籍购买的部分，这里重点设计了新型物流系统。\r\n于是他在墙上写到：“新物流系统。必须要更快，要更便宜。实现：就按原文里设计的来。”（注：物流部分在论文中做了非常详尽的讨论，为了节省空间，扎克伯格在墙上并没有写出来。当然，后面我们还会提到它的具体内容。）\r\n\r\n将论文中主要的灵感都画在墙上后，扎克伯格脑袋里的那匹思维之马似乎有些累了，于是它放慢了脚步，只是一遍又一遍的重新看已经画在墙面上的内容，看看有没有需要补充的地方。\r\n当他看了几遍“安全”那一部分区域时，发现眼睛始终很难离开“个人隐私”的那个字眼。然后他走到那个词的面前，试图再扩展一下。\r\n“隐私——个人信息——姓名，年龄，婚姻，职业，家庭，朋友，学校……”\r\n顺着思路写到这里，他突然灵光一闪，重重地拍了一下自己的脑袋。\r\n“哎呀，这么重要的东西我怎么没注意到！”\r\n扎克伯格提起画笔，脸上出现了一个诡异的笑容，把上面的那些词用一个大圆圈勾上，然后用一个大大的箭头指向一个空白处，又画了一个空心圆圈，并在里面写下：\r\n“Facebook，人类信息库。”\r\n一个月过去了，他把书房的墙面画得乱七八糟，到处都记录着新想法。直到墙面都画满了，他想：“差不多了，下一步就看要怎么实现了！”\r\n于是又花了一个月，他把整理好的灵感一条一条列出来，然后逐个上网查询可以实现的方法。如果网上查不到，他就让秘书联系相关领域的专家，到他的家里来做客。\r\n\r\n时间过得很快，虽然每天都很忙，扎克伯格却感到了前所未有的开心，这种史无前例的挑战就像赛车一样，紧张刺激，却很高兴。\r\n出乎意料的是，他所有的设想，在技术领域都是可以实现的，甚至很多是已经实现却鲜为人知的。他本以为那么多的幻想可能只有不到50%是可以实现的，搞不好其他实现不了的都要重新构思了。但是与众多专家的对话，让他看到了前方的属于胜利的强光。\r\n\r\n到了这里，前期创意，和技术可行性都已经完成了。接下来就不是靠他一个人能够完成的了，必须要成立一个团队才行。\r\n当然，在凑齐团队之前，先要给团队起个名字。那么，叫什么好呢？\r\n他再次翻阅了那篇论文的档案，看到那封匿名提交的邮件，发信地址是Leonard_Elric@163.com，难道作者的名字叫Leonard Elric？\r\n\t论文的标题是读书系统的革命，那结合起来的英文就是Leonard Elric’s Revolution Of Reading System，简写是LERORS。想到这里，扎克伯格有种小孩子玩文字游戏的愉悦感。\r\n\t最终确定下来，团队叫LERORS团队，而他们要执行的计划代号就是Project-L。\r\n\t下一步，就该凑齐队员了。\r\n\r\n第十节 麦肯锡\r\n\t麦肯锡是一家在美国成立了近百年的商业管理咨询公司，也是全球最大的战略咨询公司。直到今天，他们已经帮助了无数企业实现了显著的、持久的经营业绩增长，并为这些企业建立了能够极大吸引人才、培育人才的优秀组织环境。\r\n\t麦肯锡的主要工作，一般是调查企业所在的市场环境、政治环境，以及企业自身的所有信息，然后得出一个适合的发展方式。\r\n\t简单来说，麦肯锡就是一个“军师”——要想在商业战场上获得胜利，是不能缺少这样一个好军师的。\r\n\t\r\n\t扎克伯格，正是意识到了这点，所以第一个要找的就是麦肯锡。\r\n\t这天，扎克伯格来到了麦肯锡的总部。\r\n\t由于之前做过预约，麦肯锡已经知道这天扎克伯格会来访。像扎克伯格这样响彻商界的大人物，即使对于麦肯锡来说也是非常大的客户。为此，他们早就提前准备好了咨询团队，包含了相关领域的资深专家，等候着扎克伯格的来临。\r\n\t刚走进麦肯锡的大楼，扎克伯格就被热情的引导员小姐领到了楼上的会议室。扎克伯格看到，会议室此时已经坐好了七八个穿着整洁西装的中年男子，一眼看上去就知道是些很有经验的专家。\r\n\t他们一看到扎克伯格进来，就立马站了起来，向他表示热烈的欢迎。\r\n\t安排好了扎克伯格的座位后，每个人也都坐下。\r\n\t这时麦肯锡的咨询主管Mike说：“非常高兴您的到来，扎克伯格先生。在此前的电话里，您说想做一个很大的互联网项目，是吗？”\r\n\t“是的，我整理好了一份大概的提案，如果可以的话，”扎克伯格说“我想请你们协助我一起完成这个项目。”\r\n\t然后扎克伯格从皮包里拿出了那份提案，交给了麦肯锡的工作人员，并复印分发给每个在场的咨询专家。\r\n\t十几分钟过去后，出现在每个人的脸上又是那种熟悉的表情。这让扎克伯格想起了自己离开Facebook前一天在会议室出现的那种表情。\r\n\t接下来又是漫长的沉默，气氛很是浓重。\r\n\t主管Mike打破了沉默：“扎克伯格先生，这可是一个非常宏大的项目啊！恕我直言，我在麦肯锡三十年，参与过数不清的项目，但还没有一个像您所提出的这样大胆。”\r\n\t“也就是说，你们办不到了？”扎克伯格严肃的看着Mike。\r\n\t“我们并没有那么说，只不过。。。”\r\n\t“如果有那么容易做到，我还会找你们吗？”扎克伯格有点生气了。\r\n\t“这个。。。”\r\n\t此时Mike以及在座的咨询专家们想的是，这个不可能的任务，如果他们接手了，却完不成，就有面临收不到费用的风险；而如果不接手，又白白错失了扎克伯格这个少见的大客户。所以此时会议室的气氛变得更加凝重了。\r\n\t突然，其中一个咨询专家用力地咳嗽了两声，所有人的目光都集中到了他的身上。\r\n\tMike说：“James，你有什么意见吗？不妨直说。”\r\n\t“好的，”James说，“我觉得大家不必悲观，如果这个项目交给我做的话，肯定没问题！”\r\n\t听到这里，扎克伯格的眼睛亮了起来，看着这个样子有四五十岁的中年男子，他脑袋的头发已经稀疏，面容也没有其他人显得精神，反而是目光中有一种别人少有的坚定。\r\n\t同时，其他专家也抱着怀疑的目光看着James，他们都知道，James的业绩并不好，而且参与过的大项目也很少。面对这样史无前例的扎克伯格提案，James说交给他就能完成，其他人怎么能信服呢？\r\n“很好，James，但是，”Mike转过来对扎克伯格说，“您的这个提案远超出了我们的预期，我们很难立刻做出答复，如果可以的话，我想再商量一下再给您一个答复好吗？”\r\n\t“不行，”扎克伯格摇摇头，“必须现在答复我，如果你们连这点勇气都没有的话，我可得找别人来做了。”\r\n\tMike眉头紧锁，他心里很是焦虑，到底选择哪边呢？做，还是不做？哪边的风险都很大啊！\r\n\t正当Mike犹豫不决时，James又咳嗽了两声：“Mike，诸位朋友，我以我的职位做保证，如果这个项目全权交给我做，肯定能成功！如果不行的话，我愿意主动辞职！”\r\n\tMike不知道这个平日沉默寡言的James为何今天突然如此激动，仍然很难做出决定。\r\n\t“哈哈哈，”扎克伯格站起来，走到James身旁，拍着他的肩膀说，“我需要的就是你这种激情！”\r\n\t扎克伯格接着说：“请大家不要担心，来之前我已经想好了。如果你们愿意协助我完成这个项目，我愿意给你们出一个肯定会满意的费用。如果成功了的话，我还可以按营业额的比例给你们提成，你们看？”\r\n\t听到这里，Mike当机立断，起身握住扎克伯格的手：“好的，就这么定了！”，然后也拍了拍James的肩膀，说：“这个项目就是你的了，千万不能给我们麦肯锡丢脸啊！”\r\n\t其他人向James投来了嫉妒的目光。要知道，麦肯锡以往接受的咨询项目，通常是以固定费用，如几千万或大的项目上亿元为固定费用的。而像扎克伯格提出的以营业额的一定比例为咨询费用，简直就和当股东一样，一旦成功，将为麦肯锡带来庞大而持续的利润。\r\n\t这个诱惑，是任何人都不能抵挡的。\r\n\t\r\n\t合同当天就签好了，当中规定了麦肯锡必须对扎克伯格的项目绝对保密，知情人限制在在场以及总部高层在内的十人以内；同时还规定，麦肯锡团队对该项目全时跟进，知道完成为止；扎克伯格身为乙方负责麦肯锡团队的所有费用；麦肯锡团队由James全权指导，具有甲方团队的最高指挥权和最优先选择成员的权利等等。\r\n当天晚上，扎克伯格单独约了James到附近的一家餐厅。\r\n\t“为什么你这么肯定能成功呢？”扎克伯格问。\r\n\t“我并没有百分之百的把握。”James回答。\r\n\t“什么？那你怎么敢接这个任务？”\r\n\t“说实话，我也是背水一战了，”James说，“Up or Out，你知道吧？”\r\n\t“我听说过，麦肯锡的’不进则退原则’吧。”\r\n\t“是的，我的业绩测今年一直不太好，如果再不创造些业绩，我就会被辞退。”\r\n\t“只因为这个你就接了我的案子？”扎克伯格说。\r\n\t“嘿嘿，”James眼睛亮了起来，“扎克伯格先生，你认为我也是那种只以利益衡量一切的人吗？刚看到您的那个提案的前几段，我的血就久违地沸腾起来了！”\r\n\t“果然，你像我想象的那样，具有我需要的特质。”\r\n\t“我了解你的想法，我想我们都是对梦想有激情的人，”James说到，“你别看我是个中年人，这方面我可不比年轻人差。我年轻的时候，也梦想要改变世界，但一直没有碰到机会。当你的提案摆在我的面前时，命运告诉我，我的机会来了。”\r\n\t扎克伯格看着眼前的这个麦肯锡专家，勇敢、素质、经验，似乎已经能看到梦想实现的场景了。\r\n\t“那么，你看，我们下一步应该怎么做呢？”扎克伯格问。\r\n\t“召集团队。”\r\n\t“哈哈，我们想到一起去了！”\r\n\t“这个项目不一般，我们要做好长期的准备。”James严肃的说。\r\n\t“那你看要多久才行呢？”\r\n\t“一两年太短，不太可能，十年又太长，等实现就晚了，所以我们的目标定在六年以内比较合适。”\r\n\t“六年！哈哈哈！”听到这里，扎克伯格乐开了花。\r\n\t他给麦肯锡的提案里并没有《读书系统的革命》的内容，而James却提出了和那篇论文作者一样的观点，让扎克伯格刮目相看。\r\n\t“那么，六年这么久的项目，我们要召集什么样的团队呢？”扎克伯格接着问。\r\n\t“依我看，这个项目首先是属于绝密级别的，一旦让竞争对手们知道一点消息，对我们来讲都是极其不利的，”James说，“所以要进行这么长期的暗中开发，核心队员最好是些年轻的肯长期在脱离与外界联系的人，当然，对他们的个人素质要求也必须相当高。”\r\n\t扎克伯格专心的听着。\r\n\t“另外，要涉及到那么多别的企业合作，而能长期保密，这也是个难题。”James说。\r\n\t“的确，还是你考虑的全面，目前为止我光是幻想，却没想到这些问题。”\r\n\t“没关系，既然我们要做，就肯定会遇到这些问题。这个问题就交给我了，你放心吧。”\r\n\t扎克伯格点点头，他想到，自己第一步就去找麦肯锡真是幸运，这是个再正确不过的决定。\r\n\t“还有，最重要的问题，资金方面，”James说，“据我估计，没有数十亿是不可能完成的，这个你怎么解决？”\r\n\t“这个你不用担心，我的公司可以提供一部分，我自己也会变卖一部分股份，另外还可以找到合适的赞助商。”此时，扎克伯格的心里已经有了一个最合适的赞助商。\r\n\t“那么好吧，下一步呢，我这边先集齐商业调查的团队，你那边也挑选一些技术相关的核心队员，然后把资金的事确定下来，我们就可以开始正式行动了，你看怎么样？”\r\n\t“好的，就这么办！”扎克伯格激动的说。\r\n\r\n第十一节 命运的结合\r\n\t第二天，正当James反复查阅麦肯锡在美国各分部的年轻咨询师时，扎克伯格也没闲着。他从纽约坐飞机来到了加州库帕提诺市。我们都知道，这正是苹果公司总部的所在地。\r\n\t果然，他走进了苹果总部的大门，由董事会长莱文森亲自接待，走进了一间办公室。\r\n\t由于此前扎克伯格已经打过招呼，所以此次会见非常隐秘，只有他和莱文森两个人。\r\n\t莱文森，接替了已去世的乔布斯成为苹果公司的董事长。\r\n\t他的经历也很传奇，莱文森上世纪毕业于普林斯顿大学，获得了博士学位，之后又以科学家的身份加入基因科技公司。在一系列不断的科学创新后，将濒临破产的基因科技公司变成了一家生物领域巨擎，创造了华尔街神话。\r\n\t进入20世纪时，他又先后担任了谷歌公司的董事和苹果公司的董事。直到2011年11月，他被任命为苹果公司的董事长。\r\n\t总之，这个商界的科学家正是以创新而出众，始终坚持尊重科技的本质，相信科技才是成功的根本。他的这种商业理念，另乔布斯也极为尊重和推崇，莱文森因而也被乔布斯当作良师益友。\r\n\r\n\t这一天，69岁的莱文森在办公室里接见了扎克伯格，他有预感这是一次改变命运的会面。\r\n\t“莱文森，”扎克伯格说，“我就直说了，我们来玩点大的怎么样？”\r\n\t“我们？”\r\n\t“对，你和我，苹果和Facebook，我们。”\r\n\t“那么，你想玩点什么呢？”莱文森扶了扶眼镜，换了个坐姿，专注地看着眼前的这个年轻人。\r\n\t“来玩点创新，怎么样？”\r\n\t“好啊，不过，我还是不太明白你的意思。”\r\n\t“具体的我先不能告诉你，不过这次我打算做一个很大的项目，大到即使是苹果也不敢想象。”\r\n\t“哦？”莱文森笑了笑，“真的吗？”\r\n\t“是的，我需要你的帮助，如果我们一起来做，成功的可能性就极高了。”\r\n\t“看来你已经有计划了？”\r\n\t“只是一个初步的计划，后面实施起来必须有你的帮助才行，”扎克伯格说，“我需要你，同时我也认为，这对你来说也是有百利而无一害的，不是吗？苹果不也正面临创新的瓶颈吗？”\r\n\t莱文森笑了笑，然后沉默了一会。如果在平常，一个同行说自己面临瓶颈，是明显的挑衅行为，那绝不是一句好话。\r\n\t但是这次，莱文森没有马上反驳，他有一种异常的感觉。\r\n\t事实上，在乔布斯去世后，苹果无论怎么努力，都很难创造出一个让人满意的产品，当然这有很大一部分因素是为所有人都对苹果的要求太高了，几乎时时刻刻都拿他和曾经辉煌时期来比。另一方面，对于一个以创造性而生，并因此站到市场之巅的企业来说，创意不够也是致命的。\r\n\t扎克伯格的到访，也许对于他们来说是一个重要的机会呢？莱文森决定还是先试探一下。\r\n\t“呵呵，你光是这么说的话，我也很难决定什么啊。”\r\n\t“当然，”扎克伯格说，“这样吧，你看看这个。”\r\n\t扎克伯格从皮包里拿出了那篇《读书系统的革命》，递给了莱文森。\r\n\t由于扎克伯格的提案是一个绝密的商业计划，因此他只拿出了带给他灵感的论文。当然，这篇论文也是经过了部分调整的，隐藏了关键的内容和细节，只保留下来了概念部分。\r\n\t莱文森接过论文，简单的翻了翻，翻到第三页时，似乎想到了些什么，又翻回了第一页，这次是很认真的看了起来。\r\n\t扎克伯格捕捉到了莱文森眼神的变化，那神情和当初自己刚发现这篇论文一样。\r\n\t能对《读书系统的革命》这种纯粹理论性概念如此重视的，也就只有像他们这种级别的精英能够做到，因为那些看似不可能的东西也只有在他们面前才变得有价值，才变得可能实现。\r\n\t\r\n\t莱文森缓慢的合上了论文的副本，沉稳地看着扎克伯格，说：“这就是你想做的吗？”\r\n\t“当然不是，”扎克伯格面带狡黠地说，“这只是其中的一小部分而已。”\r\n\t“哈哈哈，扎克伯格，看来你是想做一个不得了的东西啊！”莱文森的表情比此前要热情了很多，少了一些戒备。\r\n\t“那么，做不做？”\r\n\t莱文森没有直接回答他，而是站了起来，走到了窗边，凝视着窗外的苹果园区独自出神，扎克伯格也没有催，因为他知道，这是个非常重大的决定。一旦确定下来，将是个非同小可的事情，它将主导未来两家公司的命运，甚至是整个市场的命运。\r\n\t扎克伯格注视着墙上的钟，分针转了两圈。\r\n\t“如果我不同意呢？”莱文森仍然看着窗外。\r\n\t“那么，我会立刻取消这个项目。”扎克伯格很快地回答。\r\n\t“哈哈，真的吗？”莱文森转过身来，表情却很严肃地看着扎克伯格的眼睛。\r\n\t“是的。”扎克伯格坚定的回答。\r\n\t“为什么？”\r\n\t“这么重大的项目，如果还没开始运作就被你们苹果知道的话，对我们可不妙啊，哈哈。”扎克伯格同样面无表情地说。\r\n\t对话再次陷入了沉默。\r\n\t可以说，这是两个全球最著名的企业家之间的巅峰对话，看似平凡的对话，却暗含着许多的话中话。描述起来的话，更像两个棋术高手的对弈。\r\n\t“我有什么好处？”莱文森仍然很谨慎。\r\n\t“莱文森先生，”扎克伯格站了起来，“我一直以来都对您很敬仰。我想我们都是同道中人，我们可以在当前这种纷乱的局势中共同依靠，所以才特地来见您。对您有什么好处，我想您已经很清楚了，不是吗？而那些具体的利润分成，就交给商务部门去处理吧，我相信他们会做得让大家都满意。今天我来，只想得到您一个答复，做，或不做？”\r\n\t莱文森没有再次沉默，而是直视扎克伯格的眼睛，5秒钟。然后他向扎克伯格走了过来，伸出了右手：\r\n\t“我想我们可以达成一致了，不是吗？”莱文森脸上终于出现了真正伙伴一般的笑容。\r\n\t“哈哈哈，欢迎你，莱文森，我的朋友！”扎克伯格也开朗地笑了起来，热情地和莱文森握手。\r\n\t那一天，是2013年9月1日星期日，值得载入历史的一天。在那一天，受命运之神青睐的两家企业结合了。\r\n\t\r\n\t\r\n第十二节 加州远征队\r\n\t“也就是说，”Sam喝了一口已经冰凉的咖啡，坐在这栋神秘的建筑物的一楼大厅中，正听着扎克伯格讲2013年的故事，“苹果的董事长，莱文森，答应了跟你合作？”\r\n\t“是的，”扎克伯格也喝了一口咖啡，讲了这么多，他已经口干舌燥，“刚过了一个礼拜，我们就谈好了所有的商务事项，签好了合同。”\r\n\t“这么重要的事情只在一个礼拜就签好合同了？”\r\n\t“当然，莱文森做事雷厉风行，而且我提供的可行性报告也很容易让人信服。”\r\n\t“呵呵，那份报告一定是麦肯锡的功劳吧？”\r\n\t“是的，”扎克伯格说，“James这个人看上去好像是个要退休的中年人似的，做起事来还真让人不得不佩服。”\r\n\t“那么，我想问一个问题，”Sam说，“我想知道，您到底最后筹集到了多少钱？”\r\n\t扎克伯格竖起了三个手指。\r\n\t“什么？只用了三千万！”Sam惊讶的看着扎克伯格，此时他的脑海中闪现了无数个在经济学课堂上老师举出过的“小投资造就大奇迹”的商业案例。\r\n\t“嘿！Sam，你在开玩笑吧！”扎克伯格看似生气的喊道。\r\n\t“什么？”\r\n\t“30亿！”\r\n\t“30亿！”Sam近乎失控地喊出着那个数字，他感到自己的五脏六腑都沸腾了起来。\r\n\t“30亿！”Sam再一次重复道。\r\n\t“没错，”扎克伯格说，“难道你以为这只是个三千万的小项目吗？别忘了，持续了六年，庞大的开发团队，高度隐蔽，尖端科技，企业公关，你以为多少钱能够维持这些东西的正常运作？”\r\n\tSam已经无法言语。这时他想起了第二次与扎克伯格见面，并向他提出了一个现在看来愚蠢之极的问题：“您是怎么做到仅在10个月内就完成这么一部智能机器的？”\r\n\tSam冷笑了几声，暗嘲自己的无知。如果当初他能再多动动脑筋的话，怎么想都知道，这不是一两年能做出来的东西。\r\n\t\r\n\r\n\t“你认为，”扎克伯格喝了一口咖啡，“科技是什么？”"},{"url":"https://api.github.com/repos/solomonxie/solomonxie.github.io/issues/comments/383297819","html_url":"https://github.com/solomonxie/solomonxie.github.io/issues/17#issuecomment-383297819","issue_url":"https://api.github.com/repos/solomonxie/solomonxie.github.io/issues/17","id":383297819,"user":{"login":"solomonxie","id":14041622,"avatar_url":"https://avatars2.githubusercontent.com/u/14041622?v=4","gravatar_id":"","url":"https://api.github.com/users/solomonxie","html_url":"https://github.com/solomonxie","followers_url":"https://api.github.com/users/solomonxie/followers","following_url":"https://api.github.com/users/solomonxie/following{/other_user}","gists_url":"https://api.github.com/users/solomonxie/gists{/gist_id}","starred_url":"https://api.github.com/users/solomonxie/starred{/owner}{/repo}","subscriptions_url":"https://api.github.com/users/solomonxie/subscriptions","organizations_url":"https://api.github.com/users/solomonxie/orgs","repos_url":"https://api.github.com/users/solomonxie/repos","events_url":"https://api.github.com/users/solomonxie/events{/privacy}","received_events_url":"https://api.github.com/users/solomonxie/received_events","type":"User","site_admin":false},"created_at":"2018-04-21T14:03:48Z","updated_at":"2018-04-21T14:03:48Z","author_association":"OWNER","body":"# 《读书系统的革命: 第五版》2013年3月\r\n\r\n——由图书产业链的结构重组引起的全行业进化\r\n\r\n\r\n（正文部分 第五版）\r\n\r\n第一节 发布会\r\n\r\n2019年10月1日，位于美国加州库珀蒂诺市——苹果公司总部的Town Hall Auditorium大礼堂中，正在举办一场新品发布会。这次的发布会似乎不同以往，聚集了全球几乎所有说得上名字的媒体人以及重要的业内人士。苹果公司在一个月前就开始大张旗鼓的进行宣传，这次新发布的产品具有划时代的意义，将会带来一场科技大变革。\r\n\r\n时代周刊的资深记者Andy与实习记者Sam在人群中穿梭，终于找到一个好位置待下来。Sam放下了沉重的摄影设备，“andy，这到底是怎么回事？听说苹果公司近年的经营状况一直不怎么样，怎么突然这么多人关注？”“苹果的股价低迷了12个月，所以董事会前一阵子换了一个ceo，”andy指了指旁边墙壁上的一张带有人像的宣传海报说，“就是这个人”。“这个人…咦？难道是” “没错，就是他，全球顶尖社交网站Facebook的创始人，扎克伯格。” “他怎么成了苹果的ceo了？” “我说Sam，身为一个记者要记得多关注新闻啊！这么重要的消息你都不知道？扎克伯格今年年初发表声明说了，他不愿老是在维护同一个产品，那太枯燥无味了，他想趁着年轻再挑战一下自己，于是就辞去了\tfacebook的ceo职位。” “哇，那他可够酷的！” “是啊，然后没几天，苹果公司就发表声明他们已经聘用扎克伯格做他们的新ceo，希望依靠他的年轻有为和善于创新，带领苹果重返乔布斯时代的繁荣。你看，这次就是扎克伯格上任以来的第一场新品发布会。” Sam满怀憧憬的望着演讲台，“真想知道当年那个将互联网带入一个新时代的小伙子，这次能带给我们什么惊喜！” “是啊，在场的所有人也都有和你一样想法。”\r\n\r\n在发布会开始之前，请让我先简单介绍一下当时的背景。2011年乔布斯的过世并没有拖慢移动科技的发展脚步，移动科技已经渗透到了几乎所有科技产品上。苹果、微软、谷歌、三星等科技的领头羊，不断地在发布新型的智能手机与平板电脑，为了适应人们的需要，它们的携带越来越方便，电脑越来越小、手机越来越大，二者正在无限的接近。到了2018年，三星公司发布的新型Note X平板电脑，完美的结合了电脑与手机的功能，在具有各类主流软件、游戏的兼容性的同时，亦能够轻松的打电话。为了迅速的抢占市场，他们将价格定在了1999元人民币，在当时已经是一款智能手机或电脑所能接受的最低价了。高速的性能以及低廉的价格，一年间让三星公司就占领了大部分市场份额，代替苹果公司成为市场第一。无论是微软、谷歌还是苹果，发布的产品要不然是操作不如意，就是价格高，很难既做到满足人们日益增长的需要又达到平民的价格。三星利用这个机会，大胆的投入了几亿资金来解决低成本和高性能的结合问题，因此脱颖而出，大大打击了他的所有竞争对手。\r\n\r\n而苹果公司正是这些竞争对手中受打击最大的。因为他的大部分利润都来源于屈指可数的几款手机和电脑产品，而另一部分销售应用软件的利润来源，亦因为其系统源代码不开放而被开放内核的安卓系统打败。在连续12个月销量下滑、股价低迷后，苹果公司认为如果不进行改革的话肯定是死路一条。但是难点在于谁才能来作这个领头者，管理苹果公司，来进行这一场大改革。这时候他们看到了新闻里扎克伯格的辞职消息。于是董事会当机立断，立刻请来了扎克伯格。他们想，如果是当年那个像乔布斯一样的勇敢创新又有\r\n实力的人，没有人比他更适合了。没想到扎克伯格立刻就答应了。苹果公司欣喜若狂，在2019年1月20日郑重其事的对媒体宣布，任命扎克伯格为苹果的新任CEO。\r\n\r\n10个月过去了。在大礼堂中，一个人正迈着矫健的步伐的走上到演讲台，他穿着一双露脚趾头的沙滩鞋，一条浅蓝色牛仔裤和一件浅灰色的T恤，人们还可以看到他的头发凌乱不堪，看起来就像一个在街上闲逛的穷小子一样。他敲了敲话筒，带点调皮的表情说：“嗨，你们好，新品发布会现在结束，你们可以走了。”会场上顿时一片哗然。Sam瞪着大眼睛，问身旁的andy：“怎么回事，发布会明明还没开始啊！”andy哈哈大笑，说“你太不了解扎克伯格了，他就是喜欢搞怪！”果然，扎克伯格大声的说：“嘿嘿，我是开玩笑的。但是我敢说这场发布会已经完成了，”他指了指脖子上挂的一个像员工牌一样的卡片，“我想你们刚才在进礼堂的时候都领到了这个卡片，那么请你们现在把它从脖子上取下来然后举起来给我看。”听众们不知道这是怎么回事，但还是照着他说的做了，纷纷将手里的准入牌举起来。“然后请你们在空中摇一摇手”，扎克伯格说。听众们虽然觉得有点被耍的感觉，但还是照着做了都摇了摇手。突然他们听到一连串咔嚓咔嚓的声音，手中像银行卡片的东西突然有了亮光。Sam的眼睛瞪得更大了，他看到手中的卡片发出了光，并且显现出了一个像手机一样的操作画面。“哇塞！” “酷！”台下一片热闹，很多人甚至兴奋的叫了出来。\r\n\r\n原来，在每个人进大厅时领取的并不是一张普通的准入卡，而是扎克伯格团队研发的新式智能手机Iphone Card。它的屏幕并不是我们常见的液晶屏幕，而是采用了最新的电子纸材料，亚马逊公司的Kindle阅读器就是采用的电子纸方式。如果我们不仔细看的话，很难认出来它是一个屏幕。以往虽然有产品采用了电子纸，但是为了给其供电、加键盘等，大大增加了厚度，所以并没有很好的发展。而扎克伯格首次将这种电子纸真的变得像一张纸那么薄，而且还是可以触摸操作的界面。可以说在当时这已经是足够震撼的科技了。\r\nAndy一脸无奈的说，“果然是扎克伯格的风格，我们又被他耍了！”然而他却感到很兴奋，毕竟不是所有人都能够见证这样的科技产品发布的——还是以这种奇妙的方式。扎克伯格看着台下所有人惊讶的表情，暗自得意。他摇了摇自己的卡片，并在上面点了几下，突然所有人的卡片都响了一声，“这是我的名片，”扎克伯格说。Sam低头看到手上的卡片变成了一张名片，上面只有短短的一行字——“我是苹果CEO，你喜欢我的设计吗，混蛋。”台下又是一阵哗然。只有少数几个了解他的人才知道，这是扎克伯格特有的名片。虽然被骂，但是人们都敬佩这种有才华的怪人，而不会因为他的那些小小的搞怪而感到被冒犯。\r\n\r\n在接连的被耍后，扎克伯格又冷笑了一声。“现在呢，我觉得这里还没有够聪明的人，”扎克伯格拼命忍住笑而假装严肃的说，“因为我发现你们竟然没有人发现它的秘密！”Sam心里嘀咕，秘密？什么秘密？然后带着疑问的眼神看着知识渊博、消息灵通的andy，但andy也只能耸耸肩表示他也不知道。扎克伯格接着说，“好吧，请你们拿起这张卡片，仔细看看它边上是不是有一条切缝？”有些反应快的人立刻就叫了出来，“噢！噢！”这时人们发现，在自己手中的卡片，其实是可以展开的，就像展开一张叠过的纸一样。Sam得意的看着手中2张卡片大小的屏幕，然后看看旁边andy，惊讶的发现andy手中的卡片竟然变成了一张报纸那么大！\r\n\r\n原来，这款iphone card全部展开时是16张信用卡大小。它像报纸一样薄，可以按照自己的需要进行折叠，最小可以折叠到1张信用卡大小，厚度也差不多。此时Sam与其他参会的人们一样惊讶之余，敬佩之心油然而生。Sam、andy与其他记者，甚至都忘记了自己记录、拍摄的任务。\r\n\r\n扎克伯格满意的笑了起来，“好吧，说实话，其实它不叫iphone card，抱歉我对大家开了个玩笑。它正式的名字是ipaperⅠ。你可以把它看成是一个电脑，也可以看成是一个手\r\n\r\n机，当然它看起来更像是一张报纸。”他把ipaper小心的折好，插到钱包的一个卡槽里，然后把钱包塞回裤兜里。\r\n\r\n台下掌声雷动，Sam用专业相机记录下了扎克伯格这经典的一系列动作，他有预感，这一连串具有划时代意义的动作将会被载入科技史册。就像十几年前乔布斯在新品发布会上，从信封里拿出一台Macbook Air笔记本电脑一样。\r\n扎克伯格接着说：“那么下面，我将会请我的助手来给大家讲解一下ipaper的使用方法。在那之后我希望你们还没走，因为我想讲讲它的另一个秘密。谢谢！”助手走上了台。与扎克伯格的风格截然不同，他的助手着装更加正式，更像是一个专业人士。助手捧着一台ipaper，借助身后的大屏幕，从基本界面操作开始，逐个介绍了软件、电话等功能的使用方法。人们发现除了外表与众不同外，基本的软件操作与此前的苹果系统并没有很大的区别，个别的操作进行了改进。但是在场的一些精通科学技术的人士，似乎隐隐的感到一些不同，似乎还暗含着些什么重要的内容是他们不知道的，也许这与扎克伯格所说的“秘密”有关系吧？\r\n\r\n第二节 秘密\r\n\r\n正当人们各自揣摩那个“秘密”到底是什么的时候，助手展示完了大屏幕上显示的最后一张幻灯片，然后说“好的，这款ipaper的基本操作就先讲到这里。那么下面有请我们的CEO扎克伯格先生上台。”\r\n\r\n台下掌声响起，扎克伯格走上台。“那么，我来说点重要的事。你们在来之前也许都看到了我们的宣传语——“苹果将带来划时代的变化”。实际上，你们刚才所看到的实在是微不足道的，真正划时代的内容就隐藏在这款智能机中。刚才我说它有一个大的秘密，就是指的这个内容。那么，我想说的是，呃，那么，这个内容就是——需要你们自己去找出来了！” “什么？” “这算什么？耍我们吗？”人们各种的期望都破灭了，以为答案将会揭晓，结果却被耍了。参会的人终于忍不住了，甚至有人大骂“混蛋”。\r\n“当然，可以给你们一个小提示——‘合作’。好的，谢谢！”扎克伯格说完这句话后，潇洒的转身就往台下走，根本不顾会场上闹哄哄的抗议声。这时他好像意识到了些什么，又返回了台上，对着话筒说：“噢抱歉，我忘了说，这款智能机的售价定为9998元。谢谢！”台下顿时又沸腾了，人们简直不相信自己的耳朵。扎克伯格一声不吭的走下台，脸上带着很满意的表情，似乎所有的一切都在他的计算中一样。然后从礼堂的侧门出去了。\r\n\r\n助手再次上台，“请大家安静一下。不好意思，扎克伯克先生希望我告诉大家，关于这款智能机的秘密，最先发现并投稿到我们官方邮箱中的人，将会收到苹果公司特别赠送的一份豪华大礼。至于礼品是什么，我们同样保密。那么，发布会到此结束，谢谢大家！”\r\n\r\n助手下台后，会场上的工作人员回收了每个人手中的ipaper——当然，这么贵重的东西不可能免费的送给每个人。\r\n\r\n\r\n\r\n将摄影器材放置到汽车的后备箱里，andy插进钥匙启动汽车，准备回公司准备新闻。而Sam正坐在副驾驶座位上垂头丧气，仿佛受到了很大的打击。Sam说：“我真想不明白，扎克伯格怎么能这样做呢？这可是他上任后发布的第一个东西啊，难道他不怕我们报道出去，惹怒了大家吗？为什么不能好好的说出来呢？还有为什么要定价那么贵呢？他不怕卖不出去吗？”andy一声不吭的听Sam在那里抱怨完，说：“好了Sam，如果不加上最后说的话，你认为这场发布会怎么样？”Sam说：“恩，如果不包括最后的话，那简直是一场精妙绝伦、前所未有的新品发布会！我敢说那小子是个名副其实的天才！但是他后面的举动简直毁了这场发布会！”Andy说：“你错了，Sam，其实他最后的那几句话，才是点睛之\r\n笔！那才是天才之作！” “怎么说？” “你动动脑子，你想想他为什么要这么做？” “呜，也许就像你说的，他就喜欢搞怪吧！”Sam说。“不是的。他不会做这种毫无意义的事，实际上那是一种策略。”\r\n\r\n回到报社后，两个人向主编详细的说明了整场发布会的经过。然后主编决定尽快将这个消息发布出去。忙完这项工作已经是深夜了，Sam回到家中，洗漱完毕后躺在床上，怎么也睡不着。\r\n\r\n他现在满脑袋想的都是那场发布会的事，整个过程太有趣了，跌宕起伏，仿佛经历了一次伟大的探险。他想起了发布会结束后，在汽车里andy对他说的那些话。\r\n\r\n“那是扎克伯格的策略，”andy把汽车钥匙拔下来，认真的对Sam说，“为什么他不直接告诉我们那个秘密，而是让我们自己去找呢？你好好想想。”Sam毫不犹豫的说：“你说过的，他就是喜欢这样搞怪啊，那样让他很爽不是么！” “不对，你再好好想想。” “不对吗？那我再想想，”Sam低头想了一阵子，然后恍然大悟般说，“啊！给大家一个悬念，让所有人都好奇的去找答案，这样就能扩大新产品的影响力和知名度了！” andy微笑着说，“没错，你又学到了一招吧。这就是利用了群众的好奇心理——这也是营销的技巧。” Sam说：“那为什么他要定那么高的价格呢？一般的手机或平板电脑不会这么定价啊，而且现在市场上都在打低价牌，他这么做不是把客户都吓跑了吗？” andy并没有马上回答，而是思考了一会儿，然后摇摇头，说：“这个我也很难确定，虽然商业竞争上有靠提高价格来增强产品销量的例子，但是目前市场竞争这么激烈，三星更是推出超低价的Note x系列让这些厂商争的你死我活，拼命了要降低成本来打价格战。这个时候苹果做出了这样反常的举动，定出比同类产品高出几倍的价格，真是让人捉摸不透。” Sam应声说，“是啊，到底怎么回事呢？” andy说：“要说苹果愚蠢也不对，他们的市场策略一向都很厉害。也许这里还隐藏着什么故事呢？” Sam说：“不会是和那个‘秘密’有关系吧？” andy说：“恩，有道理，也许真的和那个‘秘密’有关系。” “那会是什么呢？” “他这个谜题太深奥了，我连一点想法都没有。”Sam头一次看到andy被难住的情况，说：“呵，也许只有买一台来试试才能知道答案是什么了。” Andy说：“是啊，也只能这样了。嘿嘿，瞧，这不正是让你想买一台吗？”\r\n\r\nSam在床上辗转反侧，反复的想着那个“秘密”是什么。扎克伯格的提示是“合作”，谁和谁合作？合作什么？怎么也想不通。想着想着，就睡着了。\r\n\r\n第二天早上，Sam一到公司，就被总编叫到了办公室。他看到andy也坐在那。总编说：“Sam，你才来公司没有几天。昨天是你参加的第一次新品发布会，说说你是怎么想的。” Sam想了想，大致的说了一些当时惊讶的心理，然后说：“扎克伯格的这些行为看起来是搞怪，其实大有内容，”他说到这里眼神亮了起来，看着主编说，“我认为，如果我们能抢在别人前面把这些内容挖掘出来，那就是一个大新闻！”主编看着Sam因为激动而微微泛红的脸，沉默了一小会，然后点点头说：“恩，很好。那么这就作为你到这里的第一个专题，我希望你能赶在别人前面把它做出来，如果有什么问题可以问andy。好了，你去准备准备吧。”Sam走出了办公室，忍不住心情的激动，乐出了声——刚来几天就交给他这么大的任务，看来总编很看好他。一定要利用这个机会好好表现，如果能够做好它，就更能让主编刮目相看了。他没有回到自己的工位，而是走到了楼梯处的一个吸烟区——他需要吸一根烟好好想想。\r\n\r\n这时andy走了过来，说：“恭喜你啊，Sam，一上来就有这么好的任务，看来主编很看好你！” Sam说：“谢谢！” andy说：“这个机会很难得，做好了对你以后的晋升很有帮助，做不好以后也很难再有表现机会了。” “恩知道了，谢谢你。” “好了我就说这些，有什么不懂的再来问我吧！” Sam继续把剩下的半根烟抽完。\r\n\r\n回到座位上，Sam想，既然要买到一部ipaper才能够了解到这个秘密，他就要赶在别人前面买到一部ipaper。几天后，社会上已经沸沸扬扬的全在讨论ipaper的出现了，当然人们更多感兴趣的是那个所谓的“秘密”到底是什么。当人们的好奇心到达极点时，苹果\r\n才宣布将在10月10日公开发售这款智能机。\r\n\r\n为了能够抢到ipaper，Sam决定10月9日的深夜就去苹果零售店排队。当他披着一条薄毛毯来到零售店时，惊讶的发现这里竟然已经排了长长的队伍了！人们竟然有这么高的热情。看到这种情形，Sam没有直接走过去排队，而是先到旁边的24小时商店买了一些食物，再去排队。他回头时发现身后的人正在迅速增加，很快队伍已经看不到尾了。\r\n\r\n终于，在寒冷中坚持了近十个小后，他用公司批准的1万元顺利的在零售店里买到了一部ipaperⅠ。\r\n上午九点半左右，他满意的坐上了一辆出租车回到公司。在自己的座位上，拆开包装。这是一个类似扑克牌大小的精致白色纸盒子，上面没有太多的装饰，只有简单的苹果标志和IPAPERⅠ这几个字。打开盒子，里面分别放着扑克牌大小的ipaper智能机，一根白色的专用电子笔，一根像软绳子的充电线。\r\n\r\n他取出了这部神奇的机器，激动的启动了它。即使已经在发布会上见识过一次，他看到这部机器启动还是感叹了一番。\r\n\r\n屏幕亮了以后，显示出一个界面，和传统的苹果手机或苹果电脑的桌面没有什么不同。上面整齐的摆列着一些传统的程序软件的图标，如ibook读书软件，ebay购物软件，safri网页浏览器，supernote笔记软件等，都是最常见的软件。Sam心里想，这没有什么不同嘛，只不过是外表变了而已，里面并没有什么太大的变化吧！毕竟扎克伯格不可能在短短的十个月里就造出一部里里外外全都不同的东西。\r\n\r\n他看到界面最下方，有一个黄色感叹号的图标，标志下写着“激活向导”。Sam点击这个图标，然后界面上弹出了一个提示，写着“此激活向导将用最简单的步骤将您的ipaper变成一部超级机器，确认请点击下一步。”超级机器？Sam怀着强烈的好奇点击了下一步，界面上弹出了一个输入框，要求他输入自己的社保卡号码。Sam输入了自己的社保卡号码，然后点击确认。不到1秒钟，界面上就弹出了一个画面，显示“您好，Sam　Winchester先生。您的ipaperⅠ已经激活成功！谢谢！”然后画面就自动关闭了，桌面上的黄色感叹号图标也随即消失了。Sam正在纳闷到底怎么回事，行政部的同事走到他身旁，说：“Sam，该开会了，记得带上笔和纸。”\r\n\r\n编辑部每天早上十点钟都会开一个例行会议，大致上就是汇报当前的工作进度并进行之后的安排，是个很枯燥的会议。Sam拿起笔和本子正要站起来，突然灵机一动——他决定今天的例会不带纸笔，而是试试用新买的ipaper来做会议记录。\r\n\r\n走到会议室，Sam坐下来，把这部ipaper展开到4张扑克牌的大小，拿出了电子笔，准备在这部智能机器上做会议记录，体验一下它的操作到底怎么样。\r\n\r\n主编依次询问几个新闻专题的进展情况，这之中包括对美国教育专题的调查组，中国经济体制改革的调查组，欧元区实体经济专题的调查组，以及Sam和andy所在的苹果公司新产品的调查组等。\r\n\r\nAndy代表这个调查组发表当前进展后，主编简短的分别安排了些事项。Sam握着电子笔在supernote笔记软件上，依次记录了主编的所有安排。因为打开软件时选择的是“会议记录”，所以在Sam写字的同时，软件自动的录制了语音记录。软件对Sam飞快的书写记录识别率非常高，几乎每个歪七扭八的字母都能识别出来。这让他很满意。\r\n\r\n会议结束后，Sam点击软件右上方的保存键。这时，界面上弹出了一个窗口，显示“您好，Sam　Winchester先生，会议记录保存成功。由于您已经注册为超级用户，请问您希望体验苹果公司为您提供的智能分析功能吗？确认请点击下一步。”\r\n\r\n智能分析？Sam惊讶的看着这几个字，每个字他都认识，但组合起来的这个单词却让他的大脑一片空白——只是一个普通的会议记录罢了，这有什么分析可言呢？这时andy走到他旁边，说：“Sam，会都开完了，你怎么还不走？”\r\n\r\n第三节 非凡体验\r\n\r\nSam回到自己的座位上。再次怀着强烈的好奇点击了界面上的下一步。他好像是凡尔纳笔下的神秘岛屿上的一个探险者，他所见到的一切都会引起极大的好奇，而他要做的正是跟着那好奇心，一路走下去。\r\n\r\n过了2、3秒钟，界面变成了一篇类似报告的东西。为了看得更清楚，Sam把ipaper展开到最大——也就是16张扑克牌的像报纸一样的大小。他看着这篇报告，简直不敢相信自己的眼睛——\r\n会议记录 智能分析报告\r\n\r\n2019年10月10日 上午10:43\r\n\r\n地点：美国 纽约市 第六大道 洛克菲勒中心 时代&生活大厦\r\n\r\n记录1：“美国教育专题组的进度，他们说目前已经采访了美国教育部长，和哈佛、耶鲁等大学的校长关于美国教育改革的意见，主编说下一步再采访一些主流的教育专家”\r\n\r\n建议结果：\r\n\r\n我们分析认为您所提到的[美国教育]是泛指“美国教育制度、状况等”（如果不对请点击这里）\r\n\r\n我们为您找到的[美国教育]相关的新闻专题有：\r\n\r\n《时代》往年关于[美国教育]的报道，（报道原文请点击这里显示）\r\n\r\n《华尔街日报》关于[美国教育]的深度专题报道，（报道原文请点击这里显示）\r\n\r\n亚洲媒体关于[美国教育]的报道，（报道原文请点击这里显示）\r\n\r\n您的记录中提到了[美国教育部长]，我们为您找到的关于美国教育部长的信息包括：现任部长名称，简历，相关新闻报道等，（查看详细信息请点击这里）\r\n\r\n您的记录中提到了[哈佛、耶鲁大学校长]，我们为您找到的关于哈佛校长、耶鲁校长的信息包括：哈佛信息，哈佛校长简历，哈佛校长著作，耶鲁信息，耶鲁校长简历，耶鲁校长著作等，（查看详细信息请点击这里）\r\n\r\n您的记录中提到了[教育专家]，我们为您找到的教育专家有：\r\n\r\n美国教育专家：（点击这里显示），以及相关著作：（点击这里显示）\r\n\r\n其他国家教育专家：（点击这里显示）\r\n\r\n离您的位置最近的教育专家：（点击这里显示）\r\n\r\n记录2：“中国经济体制改革，主编说这个专题非常重要，这次体制改革如果成功，将对美国甚至全世界有非常大的影响。主编还说我们一定要抢在别的媒体之前对这个专题进行深刻的分析报道。目前专题组已经采访了一些美国经济专家以及中国的经济学者，主编要求下一步还要联系中国的相关高层人物，同时再联系些专门做中国经营环境分析的咨询公司，看看能不能要到一些数据。”\r\n\r\n建议结果：\r\n\r\n我们认为您所提到的[中国经济体制改革]，是指的离当前时间最近的“2019年中国经济体制的改革”相关的信息。（如果不对请点击这里）\r\n\r\n您的记录中提到[对美国甚至全世界有非常大的影响]，根据语义分析，我们认为您所指的是“2019年中国经济体制改革相关的影响”，以下是我们为您找到的与这些影响相关的报道：（点击这里显示）\r\n\r\n您的记录中提到了[美国经济专家]，我们为您找到的美国经济专家以及相关著作有：（点击这里显示）\r\n\r\n您的记录中提到了[中国经济学者]，我们为您找到的中国经济学者以及相关著作有：（点击这里显示）\r\n\r\n您的记录中提到了[中国相关的高层]，根据语义分析，我们认为您指的是“中国关于经济体制改革的高层领导”，以下是我们为您找到的人：（点击这里显示）\r\n\r\n您的记录中提到了[中国经营环境分析的咨询公司]，我们为您找到的公司及其信息：（点击这里显示）\r\n\r\n记录3：“欧元区实体经济问题，专题刚刚开始做，只是采访了一些证券分析师，对欧元区的实体经济问题有了初步了解。主编要求下一步还要采访欧元区各大银行的高层，最好把欧元区各国的意见都采集来。”\r\n\r\n建议结果：\r\n\r\n您的记录中提到了[欧元区实体经济问题]，我们认为您指的是离当前时间最近的“2019年欧元区关于实体经济的问题”，我们为您找到了欧元区相关解释以及欧元区实体经济相关报道，（点击这里显示）\r\n\r\n您的记录中提到了[证券分析师]，我们为您找到的证券分析师有：（点击这里显示）\r\n\r\n您的记录中提到了[欧元区各大银行的高层]，我们认为您指的是“欧元区的银行的高层领导”，我们为您找到的相关领导有：（点击这里显示）\r\n\r\n您的记录中提到了[欧元区各国的意见]，根据语义分析，我们认为您指的是“与2019年欧元区实体经济问题有关的欧元区各国相关的意见”，我们为您找到的信息有，（点击这里显示）\r\n\r\n记录4：“苹果新产品，主编夸我是个很有勇气很有潜力的小伙子，嘿嘿！主编说，一定要尽快挖掘苹果新产品的秘密，并且努力深度挖掘这个产品背后的故事，他说以他的直觉，这个产品不一般，也许真的要掀起一场风暴。最重要的是要快，而且要有深度，要做到别的媒体都做不到的，最好是独家新闻。”\r\n\r\n建议结果：\r\n\r\n您的记录中提到了[苹果新产品]，我们认为您指的是离当前时间最近的“2019年苹果公司发布的ipaperⅠ智能机”，我们为您找到了它的介绍以及相关报道，（点击这里显示）\r\n\r\n您的记录中提到了[苹果新产品的秘密]，我们为您找到了相关的报道以及互联网上所有网站上相关的讨论，（点击这里显示）\r\n\r\n报告看到这里，Sam已经目瞪口呆——他简直不相信自己的眼睛，一篇及其简单而且潦草的会议记录，竟然能被一个机器分析到这种地步。信息量极大而且都是非常相关的信息，没有一点多余的内容。如果不是自己亲眼所见，他会以为这是哪个专业的分析公司所提供的价值上万的专业报告呢！\r\n\r\n在阅读的过程中，Sam不断的问自己：“它是怎么做到的？它是怎么做到的？”直到最后，他问自己都问到烦躁了，以至于他相信其实是有一个专业的分析师坐在电脑的另一端，在一个字一个字的敲击键盘，然后才把这篇详尽的分析报告提供给他的。\r\n\r\n但是Sam摇了摇头，他知道，从自己点击确定到报告出来，前后一共不过2、3秒钟而已，是一个人不可能做到的。\r\n\r\n这个时候，他的大脑又一片空白，因为他已经不知道自己该想些什么，该问些什么，只是觉得这一切都和自己所经历的时代太过于不同了。就仿佛自己像电影中一样坐了一部时空机器到了未来的世界，面对未来人的生活而不知所措一样。\r\n\r\n他开始漫无目的的来回翻动这篇分析报告，看到每句话最后的那个“点击这里查看详细内容”，他就随便挑了一个点了一下。但就是这一下，让他回过神来了。\r\n\r\nSam点击的是关于“哈佛大学校长”的详细内容，这时界面上显示“您好，Sam　\r\n\r\nWinchester先生。您现在正在请求查看[哈佛大学校长]的简历、著作等相关内容，下载这些信息需要付1元。确定请点击下一步。如需帮助请点击文字上方的问号。”\r\n\r\n付费？Sam回过神来就是因为这个词。原来这一切并没有那么简单，苹果公司提供的这种“超级服务”自然不能是完全免费的，毕竟那样的分析报告即使在市场上去卖也是值不少钱的。自己怎么没有想到这点呢？\r\n\r\nSam并没有直接点击下一步，而是先点击了上面的问号，看看它对此有什么样的解释。这时，界面上开始播放了一段视频。视频在短暂的显示了苹果的标志后，出现一位美貌的女人。然后她开始说话了：“您好，尊敬的ipaper客户，我是苹果公司的lily，专门为您解决与这部智能机器相关的问题。根据使用记录，这是您第一次使用ipaper为您提供的超级服务，其中涉及到了智能分析以及付费下载等功能。下面我将为您进行简单的介绍。”\r\n\r\nLily接着说：“ipaper是一部划时代的产品，它为您提供了非凡的使用方式以及操作体验。在这里您将体验到功能强大而易于操作的特性。您当前所使用的supernote笔记软件，与目前市场上所有的笔记软件都不同。它不但拥有强大的记录功能，同时还具有智能分析的功能。智能分析功能是由苹果公司集合众多语义分析专家、互联网技术专家以及众多的数据提供商一起为您提供的超级功能，它能够为您带来生活、工作上极大的便利。同时为了保证这个功能的持续运行，您需要知道的是，它需要很大的成本。因此您的每一次使用都需要付出相应的费用。然而基于众多的考虑，苹果公司决定将它的使用价格降到所有人都能接受的地步。在每次将要付费的时候，您都会看到相应的费用是多少而自愿选择是否支付。为了使您有一个大概的了解，以下将向您展示常用信息类型的收费。”\r\n\r\n画面中出现了一个表格，Sam看到表格中详细的列举了各种类型信息的收费标准，大多数付费信息都是以这个标准来定价的。比如书籍下载，0.1元~10元；杂志下载，0.1元~3元；新闻报道，10份以内不收费，超过10份的每10份收0.1元；互联网已有信息，免费。\r\n\r\nSam不禁感叹——“呵，扎克伯格已经做到这种地步了！他竟然已经做到这么详细的地步了！”然后他点击表格下面的“我已经阅读完了”。这时Lily又出现在了画面中。\r\n\r\n“我想您从上面的表格中已经了解到——使用我们提供的付费信息，并不会给您带来经济上的困扰。同时我将提醒您注意到另一个重要的问题就是——您的付费过程将是最简单而最安全的，”Lily接着说，“与传统的网络付费不同，为了使您更好的享受使用过程，苹果公司创造了一种非常简便的付费方式，无需每次付费都到网络银行输入密码、多重确认，您甚至可以不用做任何操作就完成了付费。”\r\n\r\nSam心里想：不需要密码就直接付款？那岂不是太不安全了？如果我的机器被别人使用了怎么办，那我的账户安全谁来保障呢？\r\n\r\nLily继续说：“但是您不用担心——虽然在操作过程中无需任何安全确认就可以付款，但是在后台我们已经做到了您当前最安全的验证方式。我们默认的验证方式是这样的，当然您可以根据自己需要的进行调整：款项低于1元的，可以直接付款，这将极大的方便您的操作，因为小额的付款将在使用中经常出现，如果每次都输入密码会很浪费时间；款项低于一百元的，需要输入银行密码；款项低于一千元的，在输入密码的同时需要回答您在网络银行预设的问题，只有回答正确了才能付款；款项低于一万元的，需要您输入密码、回答问题以及回复发到您手机上的验证短信中的验证码；款项高于一万元的，将启动最高验证模式，需要您在智能机上验证指纹、视网膜和声音。当然，无论在哪种模式下，智能机都将拍摄使用者的头像，与您注册的头像进行对比，一旦对比结果不同，那么将对您进行电话确认。”\r\n\r\n听到这里，Sam对付费问题的疑虑已经荡然无存了——他仍然相信自己是在未来世界里，而那个世界的网络付费是那样的安全和方便。\r\n\r\n最后Lily说：“好的，关于supernote的智能分析与付费问题，已经向您解释完毕了，希望您在我们努力创造的新世界里拥有一个愉快的旅途，谢谢！”视频自动消失，并回 \r\n到了分析报告的界面。\r\n\r\n这时Sam感到，就像在这一路的探险的中途走到了其中的一个休息站，可以暂时歇一歇，缓一缓，让大脑消化一下这从一开始就让人惊讶到现在的每一件细小而又神奇的每一样事物。然而他知道，在后面等待他的也许还有更多的惊喜。\r\n他看着那篇报告发了一会儿的呆，然后站起来，走到楼层的吸烟区，点上一根烟，看着窗外的天空吐出一团又一团的烟雾。这时andy走了过来，也点上一根烟，说“你怎么了？我看你的表情不太对啊。” “andy，我想，扎克伯格真是一个天才！”Sam说。“看来你是发现了些什么吧？”andy说。“没错，andy，他简直是个天才！他也许真的创造了一个新世界，而我刚刚却只看到了这个世界的一角！”Sam激动的说。“那么你之前的判断是对的，扎克伯格这次发布的产品大有内容。加油吧Sam，一定要挖掘出它的故事，抓住它的核心，要记住，你是一个记者，而且是《时代》的记者！”andy说。“是的，谢谢你andy。”Sam说。“那么，那个秘密你已经知道了吗？”andy问。 “秘密，我还没开始…等等！”Sam似乎想到了些什么，“谢谢你andy！我好想知道些什么了！谢谢你！”Sam赶忙把烟掐灭，然后一路小跑回自己的座位。再次拿起了那部神奇的机器。\r\n\r\n他关闭了分析报告，然后打开几个的程序软件，左点点右划划，同时还用笔写着些什么，偶尔还会连续打好几个电话。一直忙到中午休息的时候。旁边的同事一直催他一起去吃饭，Sam答道：“你先去吧，我还有好多事情要做，先不吃了！”同事无奈的自己去吃饭了。\r\n\r\n第四节 神秘礼品\r\n\r\n第二天，也就是周五早上的九点钟，苹果公司的官方网站上出现了一篇公告，瞬间被各大网站和媒体争相转载，网络上又掀起了一阵风波。公告的内容大致是：苹果公司已经得到了第一个回答出ipaper“秘密”的人。那个人的名字是Sam　Winchester。为了奖励他，公司决定赠送他一个神秘礼品，并给他一个和苹果公司CEO扎克伯格共进午餐的机会。至于答案的具体内容以及神秘礼品是什么，都将在Sam　Winchester领取奖品之后再公布。\r\n\r\n网络上人人都在猜测那个礼品是什么，并且争先恐后的公布自己对于“秘密”的解答。就仿佛每年一届的奥斯卡开幕前夕，所有人都在猜测奖杯的得主是谁一样。受到网络热潮以及极大的好奇心的影响，苹果专卖店的销售比之前更加火热了，门口排的队伍也越来越长。为此有些地区甚至派出了警察队伍到专卖店的门口维护治安，还有一些交警来疏散附近拥堵的交通。\r\n\r\n不得不说，苹果公司的这一系列举动，引起了全民的热潮。而他们似乎又什么都没做——他们没有在电视上、在网络上插播一条广告，没有任何宣传，甚至连产品的介绍都没有，除了一句“这是一个划时代的产品”外。毫无疑问的，这也是扎克伯格的一个非凡营销策略，也许用不了多久，学MBA的学生们就可以在自己的课本上看到这个经典的案例分析了。\r\n\r\n早上十点钟，位于纽约的《时代》的办公大楼中，主编正在开每天的例会。例会的焦点就集中在Sam将与扎克伯格共进午餐的这个主题上。在一番夸奖后，主编严肃的对Sam说，“Sam，这是一个非常重要的机会。就像你所知道的那样，我们也了解到了苹果的这部新产品确实是一部神奇的机器，这是跨时代的新闻，是将载入科技产品历史的事件，就像乔布斯发布iphone一样，就像扎克伯格的facebook上线一样，都是引领时代的事件。所以你需要知道，这次共进午餐的机会很重要，”主编接着说，“你要抓住机会问他一些问题，最好是能获得独家采访的权利。当然，关于这些问题你的经验还少，在这方面andy会\r\n给你很大帮助的。” “好的，主编，谢谢您对我的信任。我一定会努力利用好这次机会的”Sam充满信心的答道。“好吧，不要浪费时间，你和andy去准备吧。”主编说。于是Sam和andy离开了会议室，主编则继续给其他专题组安排任务。\r\n\r\nSam在andy的指导下经过了努力的准备，终于到了10月14日，也就是周一。Sam如约到达了位于加州库珀蒂诺市的苹果总部。现场已经聚集了很多主流报刊杂志的记者，而andy作为《时代》的记者也出现在了新闻发布会台下的坐席上。\r\n\r\n在这场小型的新闻发布会上，Sam成了主角。工作人员在简短的说了一些开场词后，高调的邀请一位漂亮的模特端着一个披萨盒一样的白色印有苹果标志的盒子来到了Sam面前，Sam恭敬的接过来。下面的记者这时紧忙唰唰唰的拍照。主持人邀请Sam拆开包装，看看这个神秘的礼品到底是什么。\r\n\r\nSam小心翼翼的拆开了包装，展现在眼前的东西又使他吃了一惊——那是一块手表！这时主持人微笑着告诉大家，这不是一块普通的手表，而是一个配合ipaper使用的多功能辅助机器。\r\n\r\n原来，ipaper本身只是一个超级显示屏幕，本身没有任何存储数据的功能，且只有很小的运算能力。Ipaper的一切功能都是通过互联网实现的。它的所有软件和数据等都存储在苹果公司分布于美国各地的大型服务器中。所有的运算工作、分析工作等等也都是由苹果公司布置在互联网上的超级计算机来负责。而ipaper这个超级显示屏幕需要做的就只有将用户的操作传送到苹果的计算机中，再通过互联网把计算机得到的结果显示出来而已。这种技术就是我们常常能听到的“云技术”。此前的云技术并不成熟，还多是单纯的用于存储数据和简单的运算，并没有做到完全的“云端”处理，而ipaper做到了“完全的云技术”，即“云技术”的最高阶段——将“一切”都放在网络上。正是因为这个特点，使得ipaper又轻又薄，供电长久。但是这一切都基于美国全境的无线互联网传送速度高度发达，一旦到了偏远地区网速很慢或者没有网络，这部智能机就相当于一个废物。而为了弥补这个问题，苹果公司开发了相应的硬件补充——iwatch。\r\n\r\nIwatch外形是一个手表，但是内部却有极其精密的16.0GHZ超高速cpu运算器，32T容量超大额存储硬盘，无线网络发射器/接收器，数据传输插口，以及一个袖珍的投影机。将iwatch和ipaper进行无线网配对连接后，ipaper将如虎添翼，不但能够极大的加快运转速度，还能够在没有互联网的情况下使用一些常用软件，甚至能够将ipaper的内容投影至任何宽阔的墙面上观看。值得一说的是，iwatch的外形使得人们携带毫无压力，你甚至可以将它放在包里随身携带着——它可以与附近一百米的ipaper进行连接使用。\r\n\r\nIwatch的出现，使发布会现场再度沸腾起来。毫无疑问，无论是Sam体验到的软件方面的奇妙程度，还是ipaper、iwatch的硬件方面的高级程度，扎克伯格都将他所能做的都做到了极致——在场的所有人都无不感叹，扎克伯格已经领先了时代太多！\r\n\r\n主持人继续说明，iwatch将在随后公开发售，售价只定位两千元。Sam想，这样的价格也许是为了应对三星等公司的价格战，毕竟iwatch在性能上是很容易被赶超的，它的竞争力远没有ipaper高，所以定这样的市场平均价格是一个平稳的策略。而此时在台下的记者andy想的是，这次的新闻发布会原来亦是一个营销策略：看似只是一个“解谜”的小型新闻发布会，实则是承上启下来引出新产品的发布，这一步接一步连接得毫无缝隙，真是令人敬佩。\r\n接下来到了记者提问环节。在回答了常见的一些问题后，有个记者站起来问大声的说：“现在，该公布那个‘秘密’的答案了吧！”台下又轰然乱成一片，大家都在喊“是的” “该公开了” “快说出来吧” “我们等了的够久了”等等。的确，这些天来，几乎所有人都在猜测那个谜题，很多人都不惜花费大笔的钱去买下这台神奇的机器来破解这个谜题。\r\n\r\n主持人说：“抱歉，很遗憾的告诉大家，你们还要再等一等。因为扎克伯格先生告诉我，要在明天才能公布答案。届时我们会在官方网站上公开的。谢谢。”然后主持人有礼貌的走下了台，并邀请Sam去苹果总部的员工餐厅与扎克伯格共进午餐。\r\n\r\nSam从记者们的长枪短炮中脱离出来，与主持人来到了餐厅。主持人领着他来到了餐厅的一个角落，说：“这是扎克伯格先生经常做的位置，请您在这里稍等一下，他马上就过来。”\r\n\r\n主持人走后不久，穿着一身休闲服装的扎克伯格就过来了，就像Sam上一次在新品发布会时见到他一样——他就像在大学校园的一个学生，正悠闲的到学校食堂吃饭。\r\n\r\n扎克伯格愉快的和Sam握了握手，然后直截了当的对Sam说：“嘿，我看了你发来的邮件，你的反应真的很快，而且说明很详尽，远远的超出了我的预期，”扎克伯格一边端详着这个年轻的记者一边说，“说说吧，你是怎么做到的？” “嘿嘿，呃，运气吧，运气！”Sam脸红了起来，这对一个大男孩来说也是很少见的。他很紧张，不知道该说什么，毕竟对面坐的是那个传奇的人物扎克伯格。扎克伯格看到他这样笑了笑，说：“不要紧张嘛，随便一点。你看，就像我这样，没什么大不了的，我们只是吃个饭而已。”说到这里，扎克伯格叫来服务员，点了两份餐厅最拿手的菜，然后接着说，“快说说吧，是怎么发现的？我很好奇”看到扎克伯格这么平易近人，而且年龄看起来也相差不远，就像两个同龄的哥们一样，Sam不那么紧张了。他说：“那好吧，事情是这样的……”\r\n\r\n在他解释自己是如何点击各个软件的功能、打电话到相关的公司咨询、上网查询的时候，让我们来看一看他发的那封邮件吧：\r\n尊敬的苹果公司CEO 扎克伯格先生 你好，\r\n\r\n我是《时代》的实习记者Sam　Winchester。我有幸在10月1日您举办的新品发布会上见到了您，并且见识到了您带领团队开发出来的ipaper——那部神奇的机器。为了体验这部您所说的划时代的产品，我在它公开发售的第一天就买到了手中。\r\n\r\n在体验了您创造的一些神奇的功能后，感到自己仿佛经历了一场伟大的冒险。然而我感到那只是我所看到的冰山一角——无论是它的外观还是几个具体的软件都只是它的一小部分而已。我发现到，这部机器的核心内容才是它划时代的特征，同时，它也正是您所说的那个“秘密”。\r\n\r\n经过不断的验证和尝试，我发现了这秘密，这也令我大吃一惊——那可真是个好东西——那个秘密就是，您所尝试创造的并不是一个一个的具体软件或硬件，而是创造一个能完美的将各种功能、各种企业、甚至各种行业融合在一起的平台！而这个平台正是以我们最普通的用户的需求为最高追求的。\r\n\r\n我不知道这样的回答能不能够使您满意。下面我将列出我对每款软件的想法以及猜测，希望能够对我刚刚所作出的解释有所帮助。\r\n\r\n注册激活。在最开始将自己注册为超级用户的时候，我只输入了一个社保卡号码就完成了全部的注册。（这令我非常吃惊）我想到，您也许是通过我的社保卡号码与民政局的数据进行了连接，获取了我的名称、网络银行账号等相关的信息，而省得我再重复的输入所有的这些信息。不得不说，这太棒了！\r\n\r\nSupernote智能分析。分析报告非常贴切我的需要，经过一些简单的调查和对比，我发现报告中为我提供的书籍都是由亚马逊公司提供的，而词语解释都是由维基百科网站提供的，而下载的一些数据最下方都标记着谷歌数据的字样，所以我认为您是与这些公司在合作的——大家一起合作提供了这样精确的数据。\r\n\r\n付费方式。很明显的，与银行的对接是这种奇妙的付费方式必不可少的。我认为您已经与一些银行（其中包括我的账户所在的银行）进行了深度合作，才能够得到这种既安全又方便的付费方式。\r\n\r\n广告。在我进行一些相关信息浏览时，界面的空白处总会出现一些相关的——很多都是我需要的产品的广告，并附带有相应的购买链接等。经过调查，我发现这些广告都是由美国LMC旗下的传媒公司提供的。所以我认为您也与这家传媒公司进行了深度合作，在为我提供一些也许我会想要的产品的同时，也为众多广告公\r\n\r\n司做出了贡献。\r\n\r\n……\r\n\r\n……\r\n\r\n……\r\n\r\n……\r\n\r\n……\r\n\r\n总之，您做到了其他任何企业都做不到的东西——合作——正是您在新品发布会上所说的那个关键词。我和您一样认为，在这个时代真正强大的不是专注于自己的一隅，而是能够与别人合作无间。也许这才是您所想要向世人表达的吧！\r\n\r\n希望我的答复能够令您满意，\r\n\r\n\r\n\r\n您忠诚的，\r\n\r\n\r\n\r\nSam　Winchester\r\n\r\n2019年10月10日 13:00\r\n\r\n\r\n\r\n\r\n\r\n扎克伯格眼中泛着光芒看着眼前的这个小伙子，这让他想到自己年轻的时候，心里感叹：年轻真好啊。\r\n\r\nSam解释完自己是怎样一步一步的发现这个秘密，并领先于别人将邮件发送到苹果公司的官方邮箱后。扎克伯格说：“非常不错，小伙子，我很喜欢你。” “夸奖了，扎克伯格先生。我也只是幸运而已。”Sam说。然后Sam想到自己并不是单纯的一个用户，而更重要的是作为一个记者来到这里的。在之前的沟通之后，他壮了壮胆子，认为时机差不多了，打算切入主题。\r\n\r\n“扎克伯格先生，我非茶好奇，想问一下您是怎么想到要开发这么一部智能机器的呢？”Sam问。扎克伯格回答：“这个嘛，是因为受到一个灵感的启发，所以才想到做它的。说实话，这可真费了我不少的脑力呢。有一段时间我甚至长出了几根白头发。” “那么，”Sam似乎恢复了记者的姿态问，“方便告诉我是受到什么样的启发吗？”扎克伯格并没有立刻回答，想了想然后说：“不好意思，这个我不能告诉你。” “哦这样啊。那换一个问题，您真的能够在上任苹果公司ceo后的短短十个月之内就开发出这样一部划时代的机器吗？——那简直难以置信。还是说您来到苹果之前就有这样的打算了呢？”Sam问。这个问题又使扎克伯格停顿了几秒钟，看来Sam的这几天与andy一起的努力准备并没有白费——都问到了重点。然后扎克伯格笑了笑，说：“嘿嘿，你的问题很尖锐嘛！你还真是一个记者，吃饭都不忘记要做采访，”扎克伯格本想直接的回避的，但是看了看眼前的这个眼睛里充满着期待的年轻记者，没有那样做，“其实吧，我只是受到中国读书运动的启发，所以才有了灵感要做这样的一个东西。对不起，关于你的其他问题都属于商业机密了，所以我不能告诉你。” Sam听后很失望，但也没有办法，毕竟这不是一次正式的采访，而且问题也太过于敏感。\r\n\r\n然后他们继续聊了聊其他的问题，就结束了这次午餐对话。“餐厅的菜很好吃，谢谢您，扎克伯格先生。”Sam站起来有礼貌的说。“很高兴听到这些，很高兴认识你，winchester先生。”扎克伯格也站起来说。“我也很高兴认识您，希望有机会我们还能够见面！”Sam主动和扎克伯格握了握手。“好的，这次谈话很愉快，期待下次的见面，再见！”扎克伯格说。\r\n\r\n\r\n然后Sam就离开了苹果公司的总部，坐上最早的一班到纽约的飞机。坐在飞机上，Sam的思想正如一只无头苍蝇，到处乱飞，他控制不住自己。也说不上是高兴或是难过，总之脑袋里胡乱一片。说起来，也许这更像是失望。因为他没有完成好他身为一名记者的\r\n任务——从扎克伯格那里获得有趣的消息，挖掘他背后的故事。这时他产生了一种逃避的情绪——他希望这架飞机永远不要停下来，直到他想好怎么向主编交代为止。他让思绪胡乱的飞了一会儿，然后心里对自己说：“不，我不能这样下去，事情还没有完，我要好好想一想，也许还有机会！”于是Sam从包里拿出了一个mp3播放器，是微软开发的Zune一代硬盘级播放器，可以存储大量的歌曲，拿在手里就像一块小的板砖——已经停产了十几年。那是他最喜欢的播放器，因为操作简单，重要的功能齐全，几乎他想要的什么都不缺。他戴上耳机，打开这个硬盘级别的播放器，选到了Andy Mckee的指弹吉他专辑，点击播放。然后他戴上眼罩，双手合十放在两腿间，紧靠着座椅——这是他要开始思考时的习惯动作。\r\n\r\n他仔细的回忆与扎克伯格的每句对话，扎克伯格的每个动作，以及刚才的小型新闻发布会的每个细节。他反复的思考着，就像在黑暗的房间中摸索那根开灯的灯绳一样。他的思绪却反复的围绕着他们最后的那几句对话中：“因为受到一个灵感的启发” “这个我不方便告诉你” “短短的十个月就做出这样的产品” “受到中国读书运动的启发” “商业机密”。他反复的琢磨着这几句话。等等，“中国读书运动”？\r\n\r\nSam似乎看见了一线曙光。他想，中国的读书运动是怎么一回事？它是怎么启发扎克伯格去做一部科技产品的呢？这之间一定有什么重要的关联，如果能够抓住这两者的关联关系，也许我能够做出一篇很有深度的专题报道呢？也许这个专题能够给我们的科技产业带来同样大的启发呢？\r\n\r\nSam就这样想着，重新回过了自信，他似乎已经认为他抓住了那根开灯的绳子。他摘下眼罩，看着窗外的云彩，玻璃上他能看到自己闪着光芒的眼睛。\r\n\r\n下了飞机后，他马不停蹄的回到自己的工作岗位上，甚至没有向andy和主编汇报情况，就开始了行动。\r\n第五节 线索\r\n\r\n他打开ipaper，翻出了自己的通讯录。在界面简洁的通讯录中，他打开了搜索功能，搜索所有在中国的朋友。点击下一步后，界面上立刻显示出了几个他认识的几个中国朋友，每个人名字下面还自动显示出了职业、职位、年龄、婚姻情况等相关的信息，看上去一目了然。在几个他知道的中国朋友下面，还显示出了好几个并没有听说过的名字，那些名字下面都分别用小字标注着是自己的哪些朋友的朋友。\r\n然而他现在没有心情去探索这些新鲜的功能了，他只是挑了他认识的那几个朋友的名字。然后依次打电话。他第一个打的是一个上次去北京玩的时候记者朋友介绍的作家，叫何威。名字下面显示“中国科幻小说作家”。他按下了拨打键，电话接通后他短暂的寒暄了几句，然后问起这个作家，中国发生的读书运动是怎么回事。而对方的答案让Sam很失望——从来都没有听过，中国什么时候有读书运动？身为一个中国作者的他竟然没听过这个事情。\r\n\r\n挂断电话后，Sam试着拨通了第二个中国朋友的电话。这个人叫郭明明，下面显示着“中国某传媒公司负责人”，是他在一些广告工作上联系过的合作方。她也表示从来没有听过这个事情，Sam又追问了几句，她还是说没有印象。“到底是怎么回事？你真的没有听说过吗？我的一个采访对象说的这个事不像是假的啊。”Sam说。“不好意思，我真的没有听说过。如果说中国有什么读书运动，那也只可能发生在春秋战国时代，最起码这几十年来从来没发生过这个事件。”郭明明说。Sam很失望，这是他抓住的唯一线索，竟然是一个莫须有的东西。听出了Sam的失望，出于礼貌，郭明明接着说：“没关系，我回去帮你问问我的其他朋友，看看有没有这回事，也许是有的而我不知道呢。” “好的，那谢谢你了。再\r\n见。”Sam说。挂断电话后，Sam还是没有放弃。他又打了个电话给一个在中国的一个咖啡馆时认识的那里的老板成禹，他也表示没听说过这么一回事。\r\n\r\nSam失望极了，他想，这一路下来，除了得到一块“超级手表”外，他身为一名记者几乎一无所获。当andy过来询问他事情进展的怎么样时，Sam无奈的耸了耸肩，说：“对不起andy，我没有得到什么重要的信息。”andy并没有责骂他，而是说：“没关系，Sam，这在我们记者是常有的事，并不是什么信息都那么容易让你得到的，再说这是你第一次做深度报道，”andy把手按在Sam的肩膀上，接着说，“但是你要记住，你还有机会的，只要你不放弃。”Sam回过头来看着andy，说：“我还有机会吗？” “当然！你看，虽然主编要求你一定要尽快赶在别的媒体之前作出这个报道，但是经过我这些天的关注，现在他们还只是停留在对这部机器的浅薄的理解上，而你已经比所有媒体都更接近真相了。所以你只要专心做好，我相信你一定不比别人慢的。”andy耐心的说。“是吗？真的，谢谢你andy！我现在好多了，看来我还有好多工作没有尝试呢，这时候放弃未免太让人瞧不起了吧，谢谢你！”Sam高兴的说。\r\n接下来的几天里，Sam一直在使用ipaper里面的各种功能，他试图再次从这里找些线索。\r\n\r\n他尝试了在ebay上进行网络购物。整个过程简单极了，他看中一件98元的休闲衬衫，于是点击购买，然后点击确定，整个购买过程就完成了，由于价格是低于100元的，所以无需输入任何密码，这样的简便让他多少有了些安慰。第二天早上他就收到了这件衬衫，而据他所知那件衬衫是从美国南部很远的一个城市发过来的，他很惊讶——美国的物流什么时候这么发达了？一般经过装货、中途转移、分配、发货等步骤，怎么也要在一天半以上才能够送到。据他了解，十几年来无论物流行业怎么努力，都无法超过这个时间极限，而这件位于遥远南方的衬衫是怎样像同城快递一样的十几个小时就送到了呢？莫非这也是扎克伯格的功劳吗？事实上，Sam还忽略了一个重要的细节——他可能是还没有从失望中缓解过来吧——他甚至没有输入送货地址。\r\n\r\n直到中午吃饭的时候向同事炫耀那件衬衫的快递速度的时候，他才想起这个重要的细节。于是他决定再做一次网络购物。这次他想要买一本关于物流方面的书。于是他展开ipaper，打开了一个叫“图书搜索引擎”的软件。\r\n\r\n软件的界面很简单，只有一个像谷歌主页上的搜索框和搜索按钮，不同的是上方还多了醒目的一句话：“请输入您的问题，而不是书的名字。”\r\n\r\n不是输入名字？“这句话到底什么意思？”Sam想。“扎克伯格真是个怪人，为什么每个东西都和我的认知相抵触呢，”Sam心里发着牢骚，“难道我真是来自于过去的人吗？”然后他又再次点击了界面右上角的问号标志，也许这次Lily还能够帮他解决疑问。\r\n\r\n果然，界面上又开始播放一段视频，而画面中出现的正是那个漂亮的Lily。“你好尊敬的ipaper用户。您正在使用的这项功能是苹果公司精心为您研制的超级图书搜索引擎。不同于您以往查找图书的过程，在这里您不需要输入某本书的名字，也不需要按照某本书的分类而逐个的去查看，您需要做的全部就是告诉我们您想要知道些什么，或者您有什么问题。将您的问题输入到界面上的搜索框中，系统就会为您自动的提供一切能够解答您的问题的书籍。没错，一切都是这么简单。谢谢。”Lily又随着视频画面自动消失了。\r\n\r\nSam想，如果这是真的话，那可真是个好东西！读了这么多年的书，一直困扰我的就是怎么找到我所需要的书——我想要学习的知识太多了，但我却不知道那些知识在哪！就打比方说吧，我想知道怎么治疗失眠，那么我应该看什么书呢？搜索书名叫做《治疗失眠》吗？还是到医学分类的几千本书里去一本一本的找呢？上大学的时候，我的数学一直跟不上老师的进度，快到了考试的时候，我总是想着如果能有一本教我在十天之内学会微积分的辅导资料就好啦。可是那本叫《5天自学微积分》的好书，直到我的数学挂科之后才偶然在书店里发现。但那一切都晚了——如果这个图书搜索真的有那么神奇的话，将会解决我多少的问题啊！\r\n\r\n在Sam看完lily的介绍视频之后，闪现在脑海里的就是那些一连串的“找书”之痛。然后他定了定神，在搜索框中输入了一句相当于魔法咒语般的句子：“我想找到关于物流的历史以及物流行业当前的状况。”点击搜索键，不到1秒钟，界面上就显示出了一个图书列表。\r\n\r\n列表上方写着一段话：“根据您的问题，我们为您找到的关于[物流]的历史以及[物流行业]的当前状况的书籍如下。”Sam看到列表里出现了几十本书，每本书的名字旁边都有书籍的封面，名字的下面有描述物流的历史或现状出现在书籍的哪些章节里。比如第一本叫《一个箱子的旅途》，封面上画的是一个放在飞机上的快递盒子，下面简介中说这本书写的是快递行业的现状，包括优点和缺点的分析。第二本叫《我的十八份工作》，讲的是一个人在十八份工作中所经历的事，其中一份工作是快递员，深刻体会到了物流行业的一些状况，并产生了很多的感想。第三本叫《网络购物的发展历史》，其中有一章是专门描述跟随网络购物兴起的物流行业的发展历史。第四本叫《物流学》，系统的介绍了有关物流的发展、现状、运作系统等相关知识。\r\n\r\n看到第四本，Sam的脑海中再一次产生了很多疑问。他在想，ipaper是怎么做到的？明明前三本书里没有一本的名字有“物流”两个字，甚至整本书都不能算在与“物流”相关的分类里。但是书里出现的东西确实是自己希望知道的啊。第四本《物流学》虽然毫无疑问能够解答他的问题，但是那样以“学”结尾的书籍一般都过于严谨而难懂，这对于身为非物流专业的他未免有点吃力了。反倒是第二本小说更能让他快速的了解到这个行业的东西，毕竟讲故事是最容易让人接受的。\r\n\r\n最后，Sam选择了那本《我的十八份工作》，电子书版本的是0.3元，而纸质书版本的是15元。为了再次体验一下网络购物的物流情况，Sam选择了纸质书的购买。像上次一样，购买过程及其简单——点击了确定以后，付费就已经成功了。然后Sam马上在ipaper提供的查询银行账户的功能里，看到银行账户已经减少了15元。\r\n\r\n下班后，Sam回到了自己的公寓。他想到这几天的经历，又想到在做新闻调查过程中的失落，感到有些疲惫。于是他换了身休闲的衣服，从公寓出来走到附近的一个酒吧，喝一杯啤酒轻松一下。\r\n\r\n这时是晚上8点钟，酒吧的门口的风铃铃铃的响了一下，走进来一个身穿联邦快递制服的人，他径直朝Sam走了过来。“您好，Sam　Winchester先生。这是您的快递，请签收。”那个快递员说。Sam这时正在喝一口酒，因为太突然，他把酒都呛了出来，然后很狼狈的看着快递员，说“你确定这是我的快递吗？” “是的，Sam　Winchester先生。我们系统中有您在下午三点二十分的订单，而且还有您的地址和头像信息，不会错的。”快递员说。 \r\n\r\nSam目瞪口呆的看着这个联邦快递公司的快递员，愣了几秒后，他接过对方手中的包裹和笔，在单子上签好名字后，快递拿着单子走出了酒吧。Sam看着手中的这本书，然后闷了一口啤酒，自言自语的说：“好家伙，扎克伯格！你一定是嫌我今天受到的刺激还不够吧！”\r\n\r\n当Sam正在百思不得其解物流公司是怎样操作的时候，手机响了。他从牛仔裤兜里拿出卡片大小的ipaper，看到是那个中国的朋友郭明明打来的电话。\r\n\r\n对方说，“嗨Sam，你之前说的那个事情，我想我得到了一个类似的信息，不知道是不是你所要的那个。” “喔，真的吗？太谢谢你了，郭明明。请赶快给我看吧，我正等得着急呢！”Sam兴奋的说。“那是我的一个出版社的朋友发给我的，是一篇论文。他说那是他在好几年前搜索出版业现状的信息时下载的，因为觉得里面的内容很有趣，就保留下来了。不过那是中文的，所以我想先简单的说一下内容，如果是你需要的东西，我就把它翻译过来再发给你，你看怎么样？”郭明明说。“好的，那太好了！那么请先告诉我这篇论文讲的是什么吧，我有预感它一定是我想要的，嘿嘿！”Sam像个小孩子一样兴奋的说。“哦那好吧，先别高兴的太早。我看了这篇论文，标题是《读书系统的革命》，里面分析了图书相关的一整条产业链的情况，并研究了未来可能的趋势，然后作者设计了一套系统，\r\n打算利用互联网技术，重组整个图书产业的盈利链条，如果真的能付诸实践的话将会是一场大范围的读书运动，这场运动将…” “就是它！”Sam还没有等郭明明说完就打断了她，“就是它，没错！请你尽快的把它翻译好发给我吧，真是太谢谢你了郭明明！” “哈哈好吧，那我翻译好后马上就发到你的邮箱里。”郭明明说。“好的，有机会来美国的话，我一定好好招待你！”Sam高兴的说。“好的没问题，再见！” “再见！”\r\n\r\n挂了电话后，Sam抑制不住内心中的兴奋，又点了一瓶啤酒后猛的干了下去，心里念着：“感谢上帝！”然后想，如果这正是他要的东西，那么扎克伯格所说的受到的启发，不是一场已经发生了的运动，而是中国作者所预示的一个即将发生的运动，而这个运动最终将由扎克伯格付诸实践。想到这里，Sam已经不能自已了——他太高兴了，甚至在走出酒吧的时候撞到了门。\r\n\r\n第二天早上八点半，Sam就在邮箱收到了郭明明发过来的那篇论文，他看到文章已经工工整整的翻译成英文了。他迫不及待的展开ipaper到最大的状态，然后用专用的阅读器打开了这篇论文。Sam还没来得及阅读论文，就看到界面的最下方显示了一排醒目的小字“您好，已经检测到您正在阅读的文章有中国语言版本（如需查看请点击这里）”。\r\nSam被这一排小字吸引了注意——中文版本？不会正是郭明明找到的那论文的原文吧？于是他怀着好奇心下载了那篇中文版本的文章，然后用ipaper的翻译工具将它转换为英文版本。结果令他大为诧异——ipaper翻译的这篇文章与郭明明翻译的文章标题完全一样。内容上略有差别，但是机器翻译的内容非常流畅。\r\n\r\n之前Sam请郭明明帮忙翻译这篇中文论文，正是因为通常机器翻译的长篇文章都羞涩难懂，很难还原文字所要表达的本意。这么多年来，即使相当多的大型企业都努力研发了各种各样的翻译工具，仍然很难使长篇文章翻译到位。而ipaper竟然将一篇专业论文翻译的如此准确，这令Sam再次提高了对扎克伯格的钦佩程度。\r\n\r\n为了再仔细的检查ipaper的翻译程度，Sam先没有看中国朋友翻译的版本，而是打开了机器翻译的这篇论文。\r\n第六节 读书系统的革命\r\n\r\n展现在Sam眼前的论文，首先是那个占据了整个页面的一个大标题——“读书系统的革命”，第二行副标题“针对中国图书产业链的结构重组”，第三行写着“作者：谢小波”。这一页最下方标记着的论文完成时间是2013年3月。Sam立时想到，距离现在已经有六年多了。如果扎克伯格是受到这篇文章的启发的话，那么他也许最早在2013年就已经形成了ipaper的想法。如果是这样的话，那可真是一个非常值得报道的内容。\r\n\r\n于是Sam决定仔细的分析这篇论文，抓住扎克伯格创造的这个划时代的机器的背后的故事，然后将它做成一部报道专题。他相信这无疑是个非常棒的主意——如果能够解析扎克伯格的这部神起机器ipaper是怎么来的，它的运作后台的内在逻辑与运作基础等等秘密都挖掘出来，那么做出来的报道专题一定会深受广大的使用者、行业研究者、业内人士与竞争对手的追捧的。\r\n\r\n光想到这点，Sam就已经兴奋起来了。他集中精神，开始认真的阅读这篇论文。\r\n从目录可以看出，全文分为六章。其中第一章是引论部分，第二章是现状、未来趋势和相应分析，第三章是针对当前主要问题的对策，第四章是读书系统的总设计，第五章是由旧系统向新系统的过渡策略，第六章是核心总结。然后Sam从第一章读起。\r\n\r\n第一章是引论，开篇是这样写的：\r\n在高度竞争的现代化社会中，掌握充足的知识成为了人们竞争的主要砝码，而读书作\r\n\r\n为人们最主要的充实自己的手段，却走进了一个颇为尴尬的境地。\r\n\r\n一方面，由于工业、信息业、交通业的高速发展，图书的产量呈几何级数爆炸式增长，读书的方式也不断的增加。虽极大的方便了读者，但太多的选择反而使人不知所措，在有限的时间里，读者不知道应该怎样读书、也不知道读什么书。另一方面，由于书籍产业的高度竞争，也使相关的出版社、图书商、电购平台面临一个销售窘境。\r\n\r\n实际上，大量的书商销量不佳，并不是因为读书的人少，而是因为没有找到一个满足读者真正需求的方式。换言之，是上层结构拖累了全体的进步。由此我设想，如果能够推翻原有读书系统的结构，按照符合时代发展的新需要重新构建一个更加先进的读书系统，掀起一场知识的改革，将会大大的解决这个的矛盾。\r\n将客户的需求与企业的产品设计统一起来，以最广泛的需求为产品的开发目标，是永恒不变的高盈利模式。因此，本文的中心目的就是寻求一个需求与设计的合理的结合模式。\t“说的好！”Sam想。的确就之前他所知的那些与图书、出版相关的公司，这些年来经营的都很艰难。新闻上不断报道着这样那样的图书销商、出版社在纷纷倒闭。他接着往下看，在引论的其余部分，作者对论文标题的标题做出了解释。Sam想，“是啊，我也很好奇，到底什么才是读书系统呢？从来都没有听说过。”\r\n\r\n 所谓“读书系统”，指的是于读书相关的所有环节，包括出版环节、销售环节、阅读环节、检索环节等等。它既包括了图书的产业链条，也包括了读者的体验过程。\r\n\r\n“原来是这样，读书系统，就是与读书相关的一整条产业链啊，”Sam想，“那么所谓的读书系统的革命，那就意味着要对这个产业链进行重组了。我记得郭明明说过，是利用互联网来进行这场重组。”文中接着写到：\r\n\r\n之所以进行这种设定，是因为在当前这个科技、思想、经济都大发展的时代，读书系统已不是以往那种单纯的“出版社出书-读者买书”的结构了，而又融入了更多元的因素，例如互联网。它使整个链条都复杂了起来，所以为了适应新时代的变化、达到进步，我们有必要对所有这些传统环节、新兴环节重新整理，并构造出一个更合理的、更进步的系统。\r\n\r\n看到这里，Sam不禁想：“这个中国作者到底是要做多大的一个项目啊？别人都只是专注于自己的公司经营的好不好，而他却试图改变所有公司的命运！”还没有进入正文，Sam就不禁佩服起了作者的勇气。\r\n\r\n然后就进入了第二章，即现状、未来趋势和分析。其中有两个小节。\r\n第一个小节是“纸书衰落，电媒崛起”。文中列举了中国近几年来的大量新闻出版行业数据，说明了传统的纸质书以及传统的新闻报业的盈利正在逐年下降，并且速度惊人。而另一发面数字出版业（包括电子书、电子音乐等）正以迅猛的速度逐年增加盈利。文中还列举了大量行业内部专家对未来的趋势分析——几乎所有人都承认纸质书将要衰落，取而代之的将是电子书。\r\n\r\n第二个小节是“纸书将死？”。作者针对这个问题进行了深刻的讨论。他列举了纸质书和电子书的所有优缺点，并把两个放在一起进行比较分析。通过一种不可辩驳的方式最后得出了一个结论——电子书是完全可以替代纸质书的，而且会很快。但是却不会像一些专家说的那样马上被淘汰，作者认为最起码在未来十年内不会。\r\n\r\nSam想了想自己所在的2019年，在这个时候纸质书的确仍然占了很大的份额。虽然电子书已经相当普遍了，但仍然不能完全代替纸质书。\r\n\r\n然后作者说到，既然确定了纸质书和电子书的关系和发展趋势，那么基于这个论点就可以先设计出一套完善的产业盈利结构，然后再探讨如何从传统的产业结构向新结构过渡。Sam想，这个口气听起来并不像是一个图书产业的事情，那更像是一个国家的革命。而作者正是像要掀起这样一场革命似的。\r\n\r\n到了第三章，针对当前主要问题的对策。作者在这章花费了大量的篇幅，从两大方面进行了讨论。一方面是图书产业经营者方面的问题，一方面是读者需求方面的问题。\r\n\r\n经营者方面的问题，文中写到：\r\n\r\n目前得知几乎所有的出版社都花费几百万的资金建立了自己的网站。出版社建设的网站中，交流论坛、在线购买、图书检索等功能应有尽有，但是仍不能达到很好的效果，并且长期面临着亏损的状态，问题出在哪里呢？\r\n\r\n然后作者通过举例分析，说明互联网上已经有了大量像亚马逊一样强大的图书销售、检索商家，出版社再投入资金建设自己的网站只能是浪费资金、重复建设。同时，作者还深刻的写到：\r\n\r\n出版社的目的是盈利，没有利用到自己的长处，而盲目的加入到电子商务的高度竞争中，不但会拼得头破血流，还会导致得不偿失。“内容为王”才是对出版社最大的优势。如何巧妙的利用起自己的“内容优势”，并将之与“数字化”结合，才是出版社最光明的道路。\r\n\r\nSam看到这里才相信，他正在看的是一篇非常棒的文章——作者简短的几句话就道出了出版业的妙义所在。接着，文中对互联网上三种典型的图书平台进行了分析，包括传统书籍销售商，书籍检索商，专业知识文献检索商。他们的问题都集中在不能适应消费者的需求，以及付费方式过于繁琐等问题上面。为了解决这些问题，作者又换到读者需求的角度来分析。\r\n\r\n作者将读者的需求总结为了三大问题，包括图书的检索问题，付费方式问题，以及阅读方式问题。吸引Sam注意的是这个“检索问题”。文中用一个普通读者到图书馆找书举例，描述了他想解决一个问题而想找到一个能解决问题的书是多么的困难，解释在图书馆提供的电脑上搜索也很难达到他的目的——这让Sam想起了自己的那些找书经历，进而联想到了ipaper提供的图书智能搜索是多么的方便，还有那个经典而难忘的标题“请输入您的问题，而不是书名”，每想到它都会让Sam神清气爽，就好像还没有输入问题就已经得到了结果一样。Sam接着往下看，看到作者为了解决找书难的问题，自己发明了一个检索系统。\r\n\r\n作者称之为“问题检索系统”（RQS）。他设计的这个检索系统中，每本书都配有一个“问题数据库”，也就是说每本书所能够解决的问题都列在那个问题数据库中了。例如在一本叫做《自我诊断医疗》的书的问题数据库里，就会包括诸如“怎么解决腰疼”“怎么治疗头疼”“脸上长痘痘是因为什么”等等字样。如果你搜索“我最近脸上长了好多痘痘是因为什么？”这个RQS系统就会为你搜索到这本书。\r\n\r\n看到这里，Sam顿时精神了起来——这不就是我在ipaper提供的图书搜索里面体验到的那样吗！难怪它搜索到的书籍那么符合我的需要，原来就是利用了这个RQS系统的原理啊！Sam感到很有成就感，他刚刚破解了扎克伯格的一个小秘密，就仿佛破解了哥德巴赫猜想一样。同时，他更加确认这篇论文正是他所要找的东西——因为这里一定解释了扎克伯格的很多秘密。于是Sam继续认真的读下去。\r\n\r\n在介绍了RQS的使用原理后，作者详细的讨论了这个检索系统将如何实现。包括怎样与出版社合作，利用出版社对每本书的数据掌控度，提供庞大的“问题数据库”。这样合作起来就能够达到双赢——既增加了销量，又方便了读者。另外，这个“问题数据库”还可以依靠网友在阅读每本书后自发补充相应的“问题”。这样数据就越来越全面，越来越精确。作者写到：\r\n\r\nRQS的实现将会是一个革命性的创举——它不仅可以应用于图书，还可以应用于电影等其他一切信息。\r\n\r\nSam愈发的感到敬佩这篇论文的作者——他不光是想法大胆，而且还有丰富的实践水平，能够将一些新奇的想法轻易的变成现实。\r\n\r\n然后作者又写到了付费问题：\r\n\r\n互联网发达的今天，毫无疑问越来越多的人选择网络付费。从读者角度出发，付费过程的方便与否，将直接影响到销量。那么如何通过简单的付费方式，来增加读者的购买欲呢？——我认为，只要能够将银行、出版社、网络销售商以及读书社区融合起来成为一体\r\n\r\n化的系统，就能完美的解决付费的方便程度问题。销量的大幅增加，无论是对出版社、销售商还是从中抽取手续费的银行来说，都是非常重要的。如果银行同意合作，图书商同意提供接口，那么读者将最少只要一步就完成付费。\r\n\r\n看到这里，Sam立时又发现到了一个秘密——原来我用ipaper购买一本书那么的快捷，也是利用了这里提到的“一体化系统”啊！Sam感到自己就像一个侦探一样，正在一片到处都是痕迹的现场里，逐步的推理出那个“罪犯”的秘密。\r\n\r\n往下看，文中写到读者的第三大问题，即阅读方式问题。作者曾经调查过一些读者发现，很多人不愿意使用电子书多是因为眼睛看着不舒服、做笔记不方便、翻阅不方便等等。对于这个问题，作者言简意赅的做出了回应——只要硬件技术能够达到一定的层次，如报纸一样的电子纸技术，能够像真正的报纸一样使用，那么就不存在习惯纸质书或习惯电子书的区别了。\r\n\r\nSam看了看手中的正巧展开到报纸大小的ipaper，视线一直无法离开那句话——原来这部智能机器的外形设计正是为了解决阅读问题啊！原来扎克伯格的灵感真的是来自这里！Sam就像真的抓住了犯人一样，兴奋的快要跳起来。缓了一缓心情后，他还是认真的继续读后面的内容。\r\n\r\n第四章，读书系统的总设计。这章就到了全文最重要的地方了，Sam更打起了精神，像在大学期间学习知识一样的认真起来，把自己想象成一个专业的研究者，只有从专业的角度去研究这篇论文，才能够发现扎克伯格的核心秘密。\r\n\r\n作者写到：\r\n\r\n简单的说，本文所提出的“读书系统革命”，也可以看做是利用高度发达的互联网来做一次全产业一体化的合作方案，即推翻旧的系统，形成一套崭新的读书系统。而这个方案的核心就在于——合作。而合作的基础就是参与方共赢——只有你我大家都盈利了，才会有人同意合作。所以在本章的系统设计中，我将着重探讨每一个环节的盈利点。只有将每一方的盈利说清楚，才能够在此基础上进行更细致的实施方案设计。\r\n\r\n然后在文中的漫长篇幅中，Sam看到每一个环节的经营者如何从合作中盈利：出版社利用自己的内容优势将每本书籍的相关数据提供给图书销售网站；图书销售网站利用自己的庞大的社区人群优势，为读者提供RQS图书检索系统，并进行推广、销售；银行利用提供给合作图书销售网站以付款接口和安全验证接口，对每一笔交易收取一定的手续费。总之这一切合作都将方便读者找到自己的书，并方便他付款购买，从而引起销量的大大提升。一旦销量提升，这个系统中的所有环节都将得到大量的利益。这样一来就达到了多方共赢的状态。\r\n\r\n作者甚至为每个环节都设计了非常详细的合作方案，Sam此时已经对作者感到无比的钦佩。他想，也不知道这个作者是何方神圣，为什么从来也没有听说过呢？\r\n\r\n然后他又想到，扎克伯格不正是将这个多方共赢的合作系统应用到现实中的人吗？不得不说，他可真是个厉害的角色，发现了这样文章，并且还将它付诸了实践。可是这明明是6年前的文章啊，为什么我到现在才知道呢？\r\n\r\n怀着复杂的心情，Sam继续看下去。\r\n\r\n第五章，由旧系统向新系统的过渡策略。文中先对传统图书结构做出了一些描述，并强调传统的图书盈利链条仍然是占绝大部分的。因此要撼动这么坚固的结构并不是一朝一夕的事情。因此如果要实现新系统，就必须做好长期的准备。\r\n\r\n然后，作者提到，他在研究经济学与社会学的过程中，发现了一个时间模型。如果要做长期“战斗”的准备，就需要知道这个长期到底是多少年。他的这个模型就是一个数学公式，公式非常复杂，用文字来表达就是：\r\n\r\n一个地区人们接受一个新鲜事物的时间，等于这个地区的人数乘以“这个新鲜事物的复杂度”再乘以几个社会基础参数，其中“新鲜事物的复杂度”是由“接受这个新鲜事物所需要的\r\n\r\n教育水平”除以“地区平均的教育水平”得到的。\r\n\r\n简单理解就是：一个东西越复杂，人们就需要用更长的时间才能接受它。历史上无数伟大的科学家，在自己的那个时代被人称作是疯子，就是因为他们所提出的事物超越他们所处的那个时代太多，如果他们能够明白这个道理而晚些年再提出的话，就不是那样的境况了。\r\n\r\n作者利用这个公式算出来，他所设计的这个新的读书系统，让全中国普遍接受的时间在15年左右，而在技术最发达、经济最自由的美国，是6年左右，误差不超过2年。\r\n\r\n读到“6年”时，Sam的眼睛已经瞪得不能再大了——“我知道了，我知道了！原来扎克伯格早就知道了这个结果，所以他才会选择在2019年发布这个产品的！”Sam激动的想。\r\n\r\n作者接着写到，假设以准备过程在15年之内，那么过渡策略就将按照这个进度来进行多进程的推进。文中又花费了大量的篇幅，说明在这几年中，应当做好哪些硬件和软件的准备，应当和哪些企业进行协调、沟通并建立合作关系。作者甚至在文中说明了中国当地的各种企业的“习性”，说明了应当如何与各种企业进行沟通，分别利用哪些利益条件来促使对方同意合作等等。\r\n\r\n到了最后一章，作者重申了合作的重要性，并对系统做出了一个美好的期望。然后写到：\r\n\r\n这篇论文并不是给一般读者看的，而是希望位于读书系统的高层人物，或是有意为新型读书系统进行努力的人，从这里得到一些启发或参考。来一同推进时代的进步。（全文完）\r\n\r\nSam呆呆的倚在自己的座位上，不知道该做些什么，剩下的只是无尽的感叹。他不知道这位神秘的作者是何方神圣，但是他知道，无论是这位作者，还是扎克伯格，都是这个时代的骄傲。Sam想，所有的历史中，都正是他们这样敢于想象、敢于实践的人，正是因为他们的努力，才一步一步的将时代推到了最前线上。Sam还想，时代需要英雄，因为英雄总是有着一般人所不具备的特征，人们都把英雄当为自己的目标而进步着，时代就这样一步一步的被推动着。\r\n\r\n总之，在看完了这篇极具预见性的《读书系统的革命》后，Sam感想良多。他站了起来，再次走到楼梯间的吸烟区——他需要吸根烟，好好的缓一缓，有些东西不是那么快能接受的——就像那个公式所表达的那样。\r\n第七节 北京\r\n\r\nSam似乎想到了些什么，从吸烟区回去，捧起报纸一样大的ipaper，界面上正显示着那篇神奇的文章。他找到了andy，与他交流了一下意见，然后两人一起来到了主编的办公室。\r\n\r\nandy对主编说：“我想Sam这次的收获真不小，你看，他不但解答了扎克伯格希望让人探索的秘密，还抓住了他不想让人知道的秘密。Sam，你对主编说说吧，把你知道的都说出来。”于是Sam将ipaper铺在主编面前，简短的将论文中的每一章主旨和它对应的ipaper实现的功能向主编逐个的讲解了一遍。\r\n\r\n当Sam读完文章的最后一句话后，抬起头看看主编，他发现主编正看着ipaper上显示的文章出神——他的眼睛泛着异样的光芒。“听着，Sam” 主编严肃的看着Sam说，“你知道吗，你发现了一个了不得的事情。这部产品的确不是传统意义的一个智能机，它代表的是打破过去一切传统的产业结构的银色子弹！andy你也听好，抓住这种引领时代的事件，正是我们《时代》从创刊以来核心的宗旨。明白吗？”Sam和andy两人纷纷点头。主编\r\n接着说：“我们不要着急发布，一定要把专题的质量放到第一位。以目前的形势来看，别的媒体所掌握的信息还远不如我们。下一步，andy，你带着Sam一起去一趟中国，”主编指着后背墙上的世界地图说，“你们去会一会那个作者，我想你们还能够从他那里获得更多的信息。明白我的意思吗？” “明白！”两人一起说。“好了，抓紧时间，不管用什么方法，赶快联系到作者。订票和出差费用的事你们直接和行政部沟通，手续我会替你们办好的。快去吧。”两人离开了办公室。\r\n\r\nSam的心情非常激动，在这之前也许只是自己的胡思乱想，而这次主编竟然能认可他的想法，并重视到如此程度。再加上有经验丰富的andy陪同，他感到信心倍增。这个旅途对他而言，对《时代》而言，都是意义非凡的。\r\n\r\nandy联系到了《时代》在中国分部的同事，简单的说明了情况，并表达了主编的意思。那边很快的通过公安系统的朋友查到那个作者的联系方式以及住址。andy又拜托中国当地的行政部联系一下作者，安排好他们的会面。这前前后后仅有不超过十几分钟而已，andy表现出了一个经验丰富的记者应有的姿态，让Sam感到非常敬佩，他想，自己也一定要努力，争取成为像andy一样的专业的记者。\r\n\r\nandy与Sam一起来到了行政部，在填写了一些必要的文件后又来到了财务部，领取了主编签字划拨的差旅费用。然后对Sam说：“我们有两个小时的准备时间，你现在就回家准备东西，两个小时候我们回到这里集合。” “好的！”Sam说。\r\n\r\nSam没想到公司的办事效率这么高，还没来得及反应过来，就已经安排好了行程。这与做记者之前的自己所过的拖拖拉拉的生活完全不同，“的确，我也该打起精神了，别忘了我可是《时代》的记者！”Sam想。\r\n\r\n两个小时后，Sam和andy回到了公司，每个人都拖着一个旅行箱。这时行政部的人走过来，把已经订好的两张机票递给了他们。起飞的时间是当天晚上6:30。时间已经不早，于是andy和Sam就在机场附近简单的吃了一顿快餐，按时登上了去往北京的飞机。\r\n\r\n这一路上，Sam一直都在和andy讨论采访内容，一定要准备充足，才能不枉此行。\r\n\r\n几个小时后，两人就到达了北京。他们住进了北京分公司安排的酒店后，得知与作者的会见时间定在了第二天的早上，地点位于美国大使馆附近繁华地区的雷雨咖啡——在当地有点名气，经常有一些美国人喜欢到那里去。北京的同事还告诉他们，作者说明不需要翻译陪同，因为他自己可以进行一些简单的英文交流。这也给北京分公司减少了不少负担。\r\n\r\n到了第二天，也就是10月19日星期六的早上九点半钟，andy与Sam如约来到了雷雨咖啡。走进了这家具有浓厚美国本土气息的雷雨咖啡，两人很快就找到了作者谢小波——他们的北京同事给他们发送了这个人的照片。他正坐在靠着窗户一个位置，两人走过去很热情的和作者打了招呼。\r\n\r\nSam仔细的打量着眼前的这个人，他不敢想象，这就是一天那个震惊自己的神秘作者，同时他还是在几年前启发扎克伯格创造出ipaper这部机器的人，而现在这个人就在他的眼前。Sam看到，这位作者年龄并不大——至少与他想象的满头白发的历经沧桑的形象要有很大差别——大概也就在三十岁不到的样子。他穿着整洁干净的浅蓝色条纹的衬衫，深蓝色牛仔裤，黑色的短发，和年轻的面容。这个作者使人印象最深刻的是，他的眼神很深邃，仿佛在那双眼睛的后面正藏着极大的智慧。\r\n\r\n作者很有礼貌的叫来了咖啡馆老板，Sam看到这个人正是自己多年前来中国游玩时认识的那位咖啡馆老板成禹。老板很快的认出了Sam，然后热情的说：“真没想到你来中国了，怎么提前没打招呼啊。对了，上次你问我的那个事，我又问了一些朋友，还是没有人知道，真是抱歉！”Sam略微尴尬的说：“没关系，我已经解决了，非常谢谢你！而且我要找的人坐在我的对面。”老板看了看坐在Sam对面的作者，两人互相点了点头，然后说：“既然你们来了中国，而且到了我的咖啡馆，那就是我的客人，你们这桌我请\r\n客了，你们等一下，我去安排。”Sam不好意思拒绝老板的热情，只能连说谢谢。\r\n\r\n在简单的自我介绍后，andy向作者说明了他们来采访他的目的因为看到了他在几年前写的那篇《读书系统的革命》，所以想当面向他请教一些问题。\r\n\r\n“是的，昨天你们的同事已经告诉我了。真没想到，这么多年过去了还有人提起我的那篇东西，”作者说，“而且还是特地从美国过来的时代周刊的作者，我真是受宠若惊了！” “谢先生，您的这篇论文在我们编辑部引起了非常大的重视。不得不说，我在仔细阅读您的文章后，被您的想象力和分析能力震惊了。”Sam说。“不会吧？那只是我当年在大学期间无聊时写着玩的。”作者说。“写着玩的？”Sam惊讶的看着作者。“对啊，那个时候我成天都在胡思乱想，每时每刻都会产生无数的灵感，”作者说，“我有把灵感随时随地记录下来的习惯。那时我列出了二十多个感兴趣的论题，读书系统的革命只是我动手写的第一篇。” “我想问一下，你大学期间学的是什么专业？”andy问道。“学的是金融专业，不过我还自学过几年软件编程，业余的时候喜欢研究社会学，总之我的爱好很广泛。”作者答道。“那么，你怎么会想起写关于图书业的文章呢？”andy问到。“是这样的，我一开始想自己做一个读书检索的网站，但是因为那太费时间，所以就想把这个主意写出来给一些已经存在的读书论坛看，”作者喝了一口老板端过来的咖啡说，“可是呢，越写越有灵感，就索性把图书购买问题也写了进去，然后又加上了阅读方式的问题，到了最后不得不重新写一遍——因为我觉得把整个产业都写进去才有意思。嘿嘿，当时我的经济学导师夸我的思维很活跃，还建议我把一些想象的东西写成专业性质的论文，这样有利于提高我的研究水平。我觉得整个研究过程有趣极了！”\r\nSam听着作者在说自己当年的想法时，感到坐在对面的就像一个活蹦乱跳的小孩子正在说着自己玩的各种玩具一样——这与他最初看到那篇论文的时候所想象的完全不一样，他不敢相信那种思维缜密、逻辑清晰、颇有预见性的文章，是出于这个喜欢幻想的年轻人之手。\r\n\r\n“那么谢先生，你在2013年写的这篇文章，后来被中国的企业采纳了吗？”Sam问。“唉，很遗憾，”作者摇摇头说，“我给很多企业都发了邮件，甚至还给一些媒体也发了。但是得到的回应很少，即使有回应，也只是说我的想法太难实现。”他露出很失望的表情，接着说：“直到现在，还没有人采纳这篇文章，它就像石沉大海一样，”然后他又小声的说，“后来我知道了为什么——我的想法并没有错，问题是在中国的经营环境里，不是企业之间勾心斗角，就是政府管制太多。所以现在我自己也觉得那几乎是不可能的事！”然后他抬起头来看着Sam和andy，眼中泛着光芒，说：“但是美国就不一样了，你们是个自由的国家，如果这个东西在你们那里实行起来效果就不一样，”作者微笑着继续说道，“你们这次来，是不是就是想推广一下我的想法呢？嘿嘿！”\r\n\r\nSam看着眼前的这个滔滔不绝的人，不知不觉从内心中升起了一种同情的心，他想，如果这个人是生在美国就好了，否则的话也不会这样被埋没掉。\r\n\r\nandy示意了一下Sam，然后Sam从口袋里拿出了扑克牌大小的ipaper。递给了作者。“这是ipaper吗？”作者问道。“你知道吗？”Sam问道。“当然啦，我可是非常关注最新消息的！而且ipaper在网络上被人们议论的热火朝天，怎么可能不知道呢。”然后他拿在手里把玩了一会儿，把ipaper展开到报纸大小，左点点右划划，脸上露出兴奋的表情。就好像一个小孩子刚拿到一个新鲜的玩具一样。他还时不时的自言自语到：“唉，如果中国能够发售就好了！唉！”\r\n\r\nSam问到：“怎么，中国不会发售吗？”作者摇摇头，说：“这和别的产品不一样。比如说你们的iphone系列，一般在美国发售以后过了一阵子就会在中国发售，但是这个ipaper是不可能的。” “为什么呢？”Sam问。“我在网上看到，ipaper是基于超高速的互联网运作的，而且很多数据是和政府部门连通的，”作者说到，“这在中国几乎是不可能的。无论是全国范围的超速互联网，还是政府公开数据库接口，几乎是不可想象的。”Sam看着失望的作者，想：“唉，如果不是这样的话，也许ipaper就要在中国诞生了。难道这也算一种\r\n幸运吗？”\r\n\r\n作者没有搭理两个记者，而是自顾自的玩着ipaper的种种功能。Sam主动的拿出ipaper的补充硬件iwatch递给作者，然后详细的讲解iwatch的功能，对作者说如果没有iwatch，这部ipaper在中国是没法运行的。有了它，就可以通过中国的网络自动连通美国的互联网来使ipaper可以正常运作。作者的眼中泛着羡慕的眼光看着手中的这两部神奇的机器。\r\n\r\n然后他又把玩了一会儿，突然站了起来，瞪着大眼睛看着Sam，说：“这！” “怎么了？”Sam好奇的问。“这不是我设计的图书搜索引擎吗？除了界面以外，操作方式完全一样！它是怎么做到的？！”作者惊讶的问道。\r\n\r\nandy对Sam说：“是时候告诉他了。”于是Sam说：“不好意思，谢先生，你先不要激动。我们刚刚本来想跟你说的，但是看你正玩的高兴，就想等一下再说，没想到你自己发现了，嘿嘿，你的反应真的很快嘛！”Sam以为作者要发火，毕竟有人“盗用”了他的想法，一般人都很难接受的。\r\n\r\n但是这个作者不是“一般人”，他突然大声的笑了起来，引来咖啡厅老板以及周围人们的关注。“哈哈哈，真的实现啦！竟然实现了！”作者捧着ipaper猛亲了一口，满脸都洋溢着高兴的表情。\r\n\r\n然后他对Sam说：“快说说吧，怎么回事？就只有这个检索引擎被实现了吗？其他的功能呢，我设计的其他功能实现了吗？”\r\n\r\nSam看了看andy，andy点了点头，示意他没关系，可以向作者说。\r\n\r\n于是Sam给作者、andy和自己点上了烟，又喝了口咖啡，开始从头讲起他从新品发布以来的这一路探索。又讲到怎么机缘巧合的发现扎克伯格的创意来源。作者聚精会神的听着Sam讲述这一路的故事，就好像听着一个刚刚航海归来的探险者讲述着一段奇妙的探险一样。\r\n\r\n很快就到了中午，雷雨咖啡的老板端上来很多盘精心准备的菜，并热情的招呼在座的三个人品尝。andy掏出钱包要付钱，但是老板用很有力的手把他按了回去。“这点东西算什么，Sam是我的朋友，我也很喜欢结交你们这样的美国朋友。朋友请朋友吃饭怎么能让人掏钱呢。”andy不好再拒绝，只好接受了。\r\n\r\nSam接着给作者“讲故事”，讲到怎样通过阅读作者的文章，惊讶的发现扎克伯格的“秘密”后，对作者说：“所以你应该明白了。我们这次特意到中国来，就是希望能对启发扎克伯格的你做一次专访，我想，你的出现，将会引起很大的关注。”作者微笑着说：“真的吗？哈哈，我从来都没有接受过采访，从来都是自娱自乐，即使从来没有人喜欢我的文章，也坚持去写，没想到我也要有扬眉吐气的这一天！哈哈”Sam和andy感到有些不解，作者说的扬眉吐气是什么意思？是指的接受采访吗？\r\n\r\n然后作者问到：“那么，我想问个问题。扎克伯格是怎么发现的我的这篇文章？还有，为什么他用了我的创意，而没有告诉我呢？” “没错，其实我们也想问这个问题，我们以为是你主动提供给扎克伯格的。”Sam回答说。“没有，我不可能联系到他的。”作者说。\r\n\r\n三个人沉默了一会儿，然后作者先开口说：“哈哈，算了不管它。我本来写这篇文章的目的就是为了能有人实现，而不是要得到些什么。既然扎克伯格能把这么复杂的系统实现，我已经非常的高兴了！”\r\n然后作者接着说：“难得你们来了中国，这样吧，我再告诉你们一些有趣的事情，让你们写报道的时候可以用得上。”\r\n\r\n“有趣的事情？”Sam问。“当然了，而且是和苹果公司相关的。”作者得意的说到。Sam好奇的问：“快说吧，是什么？”\r\n\r\n“你们相信命运吗？”作者说到，“我想说的是，乔布斯和扎克伯格，他们两个人的命运。”\r\n\r\n第八节 乔布斯与扎克伯格\r\n\r\n“乔布斯和扎克伯格的命运？”这下连andy也按耐不住心中的好奇了，抢先问道。“没错，”作者刻意装出神秘的表情，“虽然我不是美国人，但是我发现如果把乔布斯的一些事情和扎克伯格的事情联系起来，就会看到一些惊人的重合！”\r\n\r\n“快说吧，别卖关子了！”说这句话的是咖啡店老板，他正巧走过作者的旁边，听说到有好玩的故事，就忍不住用中文催着这位中国作者赶紧讲。\r\n\r\n“好吧好吧，我说！”作者笑着说。\r\n\r\n“你们看，乔布斯在每年的新品发布会上，是不是都穿的一样的衣服？”作者问。“是啊，每年都一样，休闲旅游鞋，浅蓝色牛仔裤，加上黑色的高领T恤。”Sam回答到。\r\n\r\n“没错。像他这种地位的人，每次召开发布会都是穿得像逛商场一样，”作者说，“然后我发现，扎克伯格也和他一样，不管什么场合，都穿那么一条牛仔裤，旅游鞋，和一件浅色T恤。” “那又怎么了，没什么奇怪的啊。”Sam说。\r\n\r\n“对，重点在后面呢，”作者接着说，“发现他们两个穿着很像以后，我就分别查了下他们各自的简历，发现不但穿着很像，而且性格和经历也很像！他们有很多共同点。”Sam和andy好奇的看着作者。\r\n\r\n“比如说他们都是20岁就开始创业；乔布斯在车库里创办了苹果公司，扎克伯格在大学宿舍里创办了Facebook；他们都是玩技术的怪才，乔布斯玩电子，扎克伯格玩编程。他们在高中时期对技术的狂热爱好远远超出了同龄人，很早就开始发明东西；他们都从大学辍学；他们的性格都很古怪，等等等等，”作者看到Sam和andy听得正出身，很得意的接着说，“最重要的是，他们的理念都一样：为了创造伟大的发明，引领时代的进步，而不是为了赚钱！”\r\n\r\nSam点点头。作者接着说，“这些你们可能都知道，但有趣的来了。我查了他们两人的一些经历，惊讶的发现了一些好玩的事情，如果把它们联系起来，就可以讲出一个完整的故事，哈哈！” “快说吧！”咖啡店老板说。\r\n\r\n作者说：“这样吧，以下的故事是我的原创，除了时间和事件是真实的以外，其他都是我幻想的，你们就姑且听着吧。”\r\n\r\n然后他装作很严肃的说：“1946年，世界上第一台计算机出现在了美国；经过了将近十年，它还是几十吨重，上帝嫌它太大了，于是1955年，乔布斯诞生了；上帝等了二十年，乔布斯终于长大了，上帝等不及，于是还没等上完大学就让乔布斯退学了——赶快做正事；四年后，也就是1976年，乔布斯成立了传奇的苹果公司，并正式卖出了苹果第一代小型个人电脑——上帝看着顺眼多了，于是苹果公司依靠这个电脑迅速的壮大了起来；到了1984年1月，乔布斯的苹果公司发布了第一款Mac个人计算机，这部被后来人称为是划时代的机器，在当年的销量并不好，乔布斯在苹果公司的事业也正在走下坡路。这个时候上帝想，只靠乔布斯一个人可不行，我还得找一个兄弟，于是到了5月份，扎克伯格出生了！1985年乔布斯无奈的离开了苹果公司，而扎克伯格一岁了，嘿嘿！1994年，乔布斯开始制作历史上第一部完全电脑制作的3D动画《玩具总动员》，开创了3D动画片的历史，而这一年扎克伯格十岁了，上帝给了他第一台电脑！于是俩个人都开始了自己的‘新事业’；后来的几年里，乔布斯大绽光彩，而扎克伯格也正在初中学校里展现他惊人的编程天赋；上帝很欣慰，到了2000年，乔布斯重新登上苹果CEO的宝座，扎克伯格也在高中学校里编出一些新鲜的软件；2003年，上帝想乔布斯年龄也不小了，该给年轻人让让路了，于是10月份，乔布斯在医院检查到了自己身上的胰脏肿瘤，同一个月，扎克伯格受到了感情的刺激，突然一个灵感启发他在大学宿舍里创建了Facebook的前身Facemash；2004年，乔布 \r\n斯被确诊为胰腺癌，几乎面临死亡，他一心只想着培养苹果的接班人，怎样才能找到替代他继续引领苹果、引领科技进步的人，这时扎克伯格闪亮登场了——Facebook正式上线了！（难道这不是上帝的巧妙安排吗？！）”\r\n\r\n说到这里，作者看到Sam和andy都听得正出神，很难说挂在他们脸上的表情是相信还是怀疑，也许各占一半吧。\r\n\r\n作者接着说下去：“这个时候，Facebook顺利运行后，上帝放心多了，于是就看着这两个人怎样为时代进步而努力。2005年，乔布斯重返到第一线工作，重点开发当时的高度机密项目——iphone一代，那个开天辟地的智能手机，此时扎克伯格的facebook也如日中天的侵占着各个国家的网络；2007年，乔布斯发布了那部划时代的尖端手机iphone一代，同时扎克伯格的Facebook成为世界上最大的社交网络，乔布斯已经关注到了扎克伯格这个人，并且直觉上就很喜欢这个小伙子，扎克伯格也说自己是乔布斯的信徒，《乔布斯传》的作者说，他们两个人之间似乎存在着一种‘奇怪的亲密关系’；2010年，上帝想，时机差不多了，也该新老交替了，乔布斯的身体到达了极限，癌症在全身快速扩散，而扎克伯格却走上了巅峰，他获得《时代》的年度人物称号，Facebook在这一年超越谷歌成为了全世界点击率第一的网站。”\r\n\r\n这时作者停顿了一下，看到Sam和andy的表情已经僵住了，仿佛他们是在听一个恐怖的鬼故事一样。作者慢慢悠悠的喝了口水，咖啡厅老板再次提示他快讲下去。\r\n\r\n作者继续说：“这里才是关键。2011年，9月份扎克伯格召开了当时大型的Facebook第一届开发者大会，并在会上做了著名的演讲，提出了划时代的‘开放平台’概念，乔布斯得知以后非常满意，他知道自己后继有人了，同时他也知道自己再也扛不住癌症的痛苦了。然后，你们知道的，乔布斯在第二个月发布了iphone4s，完成了他人生最后的一个引领时代的任务，第二天就去世了。”作者低头闭目，双手合十默哀了几秒钟，两个记者也跟着一起默哀——毕竟，那个时代过来的人，没有人不为乔布斯的去世而感到遗憾。\r\n\r\n作者接着说：“故事就到这里了，你们看，怎么样？”\r\n\r\nSam还没有从那奇妙的命运故事中愣过神来，缓了一会儿，然后说：“棒，太棒了！真的是这样吗？如果命运真的这么有趣，放在我们的报道专题里，肯定会有很大的反响！”andy也表示同意。\r\n\r\n作者笑了笑，说：“好吧，这个故事是你们的了。反正从我嘴巴里说出去，也没有什么影响力。既然觉得有趣，你们就拿去写吧！”\r\n\r\n然后双方又简单的聊了几句，这次的会面就结束了。回到酒店的路上，Sam向andy提议将乔布斯与扎克伯格之间的奇妙命运也写进专题，andy表示同意，如果可以的话再进行一些调查，润色一下再发表。"},{"url":"https://api.github.com/repos/solomonxie/solomonxie.github.io/issues/comments/383297874","html_url":"https://github.com/solomonxie/solomonxie.github.io/issues/17#issuecomment-383297874","issue_url":"https://api.github.com/repos/solomonxie/solomonxie.github.io/issues/17","id":383297874,"user":{"login":"solomonxie","id":14041622,"avatar_url":"https://avatars2.githubusercontent.com/u/14041622?v=4","gravatar_id":"","url":"https://api.github.com/users/solomonxie","html_url":"https://github.com/solomonxie","followers_url":"https://api.github.com/users/solomonxie/followers","following_url":"https://api.github.com/users/solomonxie/following{/other_user}","gists_url":"https://api.github.com/users/solomonxie/gists{/gist_id}","starred_url":"https://api.github.com/users/solomonxie/starred{/owner}{/repo}","subscriptions_url":"https://api.github.com/users/solomonxie/subscriptions","organizations_url":"https://api.github.com/users/solomonxie/orgs","repos_url":"https://api.github.com/users/solomonxie/repos","events_url":"https://api.github.com/users/solomonxie/events{/privacy}","received_events_url":"https://api.github.com/users/solomonxie/received_events","type":"User","site_admin":false},"created_at":"2018-04-21T14:04:39Z","updated_at":"2018-04-21T14:04:57Z","author_association":"OWNER","body":"#  《读书系统的革命: 第一版 ～ 第四版》\r\n\r\n\r\n（正文部分 第四版）\r\n\r\n目录\r\n\r\n未来幻想\r\n\r\n现状实况\r\n\r\n切入分析\r\n\r\n系统实现\r\n\r\n过渡策略\r\n\r\n（正文部分 第三版）\r\n\r\n目录\r\n\r\n引论\r\n\r\n现状 – 趋势 – 分析\r\n\r\n当前主要及对策\r\n\r\n案例应用\r\n\r\n系统总设计\r\n\r\n尾言\r\n\r\n引论\r\n\r\n在高度竞争的现代化社会中，掌握充足的知识成为了人们竞争的主要砝码，而读书作为人们最主要的充实自己的手段，却走进了一个颇为尴尬的境地。\r\n\r\n一方面，由于工业、信息业、交通业的高速发展，图书的产量呈几何级数爆炸式增长，读书的方式也不断的增加。虽极大的方便了读者，但太多的选择反而使人不知所措，在有限的时间里，读者不知道应该怎样读书、也不知道读什么书。另一方面，由于书籍产业的高度竞争，也使相关的出版社、图书商、电购平台面临一个销售窘境。\r\n\r\n实际上，大量的书商销量不佳，并不是因为读书的人少，而是因为没有找到一个满足读者真正需求的方式。换言之，是上层结构拖累了全体的进步。由此我设想，如果能够推翻原有读书系统的结构，按照符合时代发展的新需要重新构建一个更加先进的读书系统，掀起一场知识的改革，将会大大的解决这个的矛盾。\r\n将客户的需求与企业的产品设计统一起来，以最广泛的需求为产品的开发目标，是永恒不变的高盈利模式。因此，本文的中心目的就是寻求一个需求与设计的合理的结合模式。\r\n\r\n在正式进入讨论之前，我想先在此说明几个问题：\r\n\r\n首先，标题中的“读书系统”不是单纯的图书产业系统或是针对读者开发的网络读书平台等概念，而是包含了所有与读书相关的环节——包括图书的出版、销售和购买等传统环节，还包括网络平台、移动平台等新兴环节。\r\n\r\n之所以进行这种设定，是因为在当前这个科技、思想、经济都大发展的时代，读书系统已不是以往那种单纯的“出版社出书-读者买书”的结构了，而又融入了更多元的因素，使整个链条都复杂了起来。所以为了适应新时代的变化、达到进步，我们有必要对所有这些传统环节、新兴环节重新整理，并构造出一个更合理的、更进步的系统。\r\n\r\n由此可以看出，这篇文章的受众既可以是谋求新发展之路的传统出版社，也可以是构建网络-移动的读书平台的开发者，还可以是所有探索读书系统新出路的志同道合者。希望它可以多少给予读者们一定的思考。\r\n\r\n下面，我们将先了解一下图书也的现状以及未来的趋势，由此出发来探讨相应的对策，并尝试对几个具体案例进行探讨，最后设计出一套完整的新读书系统，并讨论从旧式系统向新式系统过渡的合理步骤。希望通过这种方式，得出一个更加科学合理的解决方案。\r\n一、现状 – 趋势 – 分析\r\n\r\n1.纸书衰落，电媒崛起\r\n\r\n近年来，随着互联网等新媒体的迅猛发展，以纸媒为代表的传统媒体受到了严重冲 \r\n击。2010年8月，美国的《新闻周刊》因连年亏损而以象征性的1美元被转售。这一事件，再次引发全球传媒行业对纸媒未来命运的广泛讨论。一篇名为《新媒体冲击下的行业报发展之路》的文章说到，“事实上，美国《新闻周刊》的生存困境不仅标志着美国报业的衰落，也是全球纸媒急需破解 的难题。”\r\n\r\n从新闻出版总署发布的2009年至2011年的年度报告中，我们可以看出，全行业每年呈20%左右的稳定增长，并有增速减缓的趋势。其中，图书的营业收入的增速逐年减少，从20%以上快速减至18%以下，数据再一步证实了我们的担忧——图书产业的危机正逐渐的呈现在我们面前；而与之形成鲜明对比的是，数字出版的营业收入逐年增加，持续保持30%以上的增速，呈现出一个远高于整体增速的迅猛发展形势。\r\n\r\n与此同时，新闻出版总署发布的另一系列报告《中国数字出版产业年度报告》中说到：“伴随着经济的高速发展，以及互联网技术和移动通信技术的提高和应用普及，国民阅读习惯和环境的明显变化，我国的数字出版产业在短短几年内产值突飞猛进，实现了跨越式发展，呈现出以产值屡创新高，手机出版异军突起，电子阅读器风生水起，数字出版赢利模式不断创新等的发展特点。”\r\n2.纸书将死？\r\n\r\n无论是从官方的数据中或是以我们自身对生活变化的感知，都可以了解到一个不争的事实——传统的纸质书籍的营业状况正逐渐衰颓，一日不如一日。\r\n然而纸书真的将消失吗？也许数据还不足以揭示这么严峻的未来，如果要更加深刻的研究纸书的命运，就必须分析纸书与电子书双方的优缺点。如果纸书的优点全部都可以被替代，那么毫无疑问的它将在滚滚的洪流中被淘汰。\r\n\r\n首先，纸质书的优点在于：1.易使用（不用任何设备，只需要有光就能看）2.广泛的使用群体 3.阅读质量高（整体结构性清晰、易做笔记、来回翻查方便） 4.有装饰作用。而其缺点在于：1.携带不便 2.储存不便 3.不能适应当今快速的生活节奏 4.数据量的增加会使书的体积大幅增加 5.不易传阅共享\r\n\r\n再来看电子书的优点：1.易携带 2.易操作 3.数据量庞大 4.购书成本及低 5.书籍容易获取 6.方便传阅共享。而其缺点是：1.电子设备成本相对较高 2.维护成本高（易坏、常充电） 3.适合阅读小说新闻类读物，不适合进行深度阅读 4.做笔记相对不方便\r\n\r\n第一，纸质书虽然主要依托于传统因素造成的庞大使用群体，但可以看到，已经越来越多的办公单位采取无纸化办公，越来越多的教学机构把复习资料都电子化，除了基础课本外尽量给学生发送电子资料。所以可以预见的是，使用群体上电子书的拥护者将会很快赶超纸质书。\r\n\r\n第二，也是最难解决的，就是纸质书的阅读质量优势——很多人都已经习惯了在纸书上到处画线、做笔记，有不懂的问题就来回翻阅，效率很高。现在的电子设备还很难达到这点。但是从技术角度来讲，要达到高质量的电子阅读，对现在快速革新的技术来说已经不是难事了。在不久的将来，新式的“电子纸”阅读器就会普及到每个人手中，它可以让你同样用笔在上面写字、画线，并很好的储存下来，也许还会提供很多类似于翻译、解释、刻度尺等辅助工具，可以说可以做到比传统纸质书更出色。\r\n\r\n第三，现在看来虽然没有电就不能看电子书，但是很快电子设备利用光能等方式“自充电”就会普及开来，所以这个问题也不成立\r\n\r\n第四，要论书柜的装饰性的话，这个也许不是我们所讨论的范畴。\r\n\r\n由以上的对比分析，我们可以看出纸质书籍一些最重要的优势全都可以快速被电子书替代，这使人不难得出一个悲观的结论——纸质书真的会被淘汰！\r\n\r\n然而，虽然已经确定了纸质书难逃的厄运，却可以预见其在短时间内仍不会被取缔。毕竟人们接受新概念、新方式是需要一定的时间积累的。关于在这段时期之间应该如何\r\n\r\n采取相应的措施，我们将在最后“过渡策略”一节中进行探讨。\r\n\r\n而在下一节，我们将挖掘当前图书行业的难题，并分别找出相应的对策。需要说明的是，为了简化研究的重点，后面我们将统一以电子书为主题进行研究。而纸质书的问题只会在部分需要的地方以及在“过渡策略”中会涉及到。\r\n\r\n二、当前行业的主要问题及对策\r\n\r\n（正文部分 第二版）\r\n\r\n目录\r\n\r\n零、\t引论\r\n\r\n一、\t现状\r\n\r\n二、\t对策\r\n\r\n三、\t汇总系统设计\r\n\r\n四、\t稳中求进的过渡策略\r\n\r\n五、\t尾言\r\n\r\n引论\r\n\r\n在高度竞争的现代化社会中，掌握充足的知识成为了人们竞争的主要砝码，而读书作为人们最主要的充实自己的手段，却走进了一个颇为尴尬的境地。\r\n\r\n一方面，由于工业、信息业、交通业的高速发展，图书的产量呈几何级数爆炸式增长，读书的方式也不断的增加。虽极大的方便了读者，但太多的选择反而使人不知所措，在有限的时间里，读者不知道应该怎样读书、也不知道读什么书。另一方面，由于书籍产业的高度竞争，也使相关的出版社、图书商、电购平台面临一个销售窘境。\r\n\r\n实际上，大量的书商销量不佳，并不是因为读书的人少，而是因为没有找到一个满足读者真正需求的方式。换言之，是上层结构拖累了全体的进步。由此我设想，如果能够推翻原有读书系统的结构，按照符合时代发展的新需要重新构建一个更加先进的读书系统，掀起一场知识的改革，将会大大的解决这个的矛盾。\r\n将客户的需求与企业的产品设计统一起来，以最广泛的需求为产品的开发目标，是永恒不变的高盈利模式。因此，本文的中心目的就是寻求一个需求与设计的合理的结合模式。\r\n\r\n在正式进入讨论之前，我想先在此说明几个问题：\r\n\r\n首先，标题中的“读书系统”不是单纯的图书产业系统或是针对读者开发的网络读书平台等概念，而是包含了所有与读书相关的环节——包括图书的出版、销售和购买等传统环节，还包括网络平台、移动平台等新兴环节。\r\n\r\n之所以进行这种设定，是因为在当前这个科技、思想、经济都大发展的时代，读书系统已不是以往那种单纯的“出版社出书-读者买书”的结构了，而又融入了更多元的因素，使整个链条都复杂了起来。所以为了适应新时代的变化、达到进步，我们有必要对所有这些传统环节、新兴环节重新整理，并构造出一个更合理的、更进步的系统。\r\n\r\n由此可以看出，这篇文章的受众既可以是谋求新发展之路的传统出版社，也可以是构建网络-移动的读书平台的开发者，还可以是所有探索读书系统新出路的志同道合者。希望它可以多少给予读者们一定的思考。\r\n\r\n下面，我们将先了解一下现状，再由问题出发探讨相应的对策，然后设计出一套完整的新系统，最后研究如何从旧式系统向新式系统过渡。希望利用这种方式，得出一个更加科学的解决方案。\r\n现状\r\n\r\n近年来，随着互联网等新媒体的迅猛发展，以纸媒为代表的传统媒体受到了严重冲击。2010年8月，美国的《新闻周刊》因连年亏损而以象征性的1美元被转售。这一事件， \r\n再次引发全球传媒行业对纸媒未来命运的广泛讨论。一篇名为《新媒体冲击下的行业报发展之路》的文章说到，“事实上，美国《新闻周刊》的生存困境不仅标志着美国报业的衰落，也是全球纸媒急需破解 的难题。”\r\n\r\n从新闻出版总署发布的2009年至2011年的年度报告中，我们可以看出，全行业每年呈20%左右的稳定增长，并有增速减缓的趋势。其中，图书的营业收入的增速逐年减少，从20%以上快速减至18%以下，数据再一步证实了我们的担忧——图书产业的危机正逐渐的呈现在我们面前；而与之形成鲜明对比的是，数字出版的营业收入逐年增加，持续保持30%以上的增速，呈现出一个远高于整体增速的迅猛发展形势。\r\n\r\n与此同时，新闻出版总署发布的另一系列报告《中国数字出版产业年度报告》中说到：“伴随着经济的高速发展，以及互联网技术和移动通信技术的提高和应用普及，国民阅读习惯和环境的明显变化，我国的数字出版产业在短短几年内产值突飞猛进，实现了跨越式发展，呈现出以产值屡创新高，手机出版异军突起，电子阅读器风生水起，数字出版赢利模式不断创新等的发展特点。”\r\n\r\n因此，无论是传统图书产业的衰落，还是数字出版业的飞速发展，都给我们敲响了一个警钟：新的时代已经到来，正所谓适者生存——改变自身以适应当前新的产业结构，将是我们的首要任务。\r\n另一方面，让我们从读者的角度来观察一下：\r\n\r\n我们的阅读是从什么时候开始的呢？自幼儿园起，我们会开始阅读一些纸质的漫画书；到了小学、初中、高中，阅读的绝大多数是学校发放的教科书，而其余时间很少会选择课外阅读；上了大学以后，除了教课书以外，逐渐才开始主动的阅读。这个时候，我们会选择到书店买书，或者在网上下载书，然后捧着几本纸质的书或一部ipad在图书馆里阅读。大学的时间段，阅读方式还是靠借书或买书为主。\r\n\r\n到了大学毕业后，生活开始忙碌起来，无论是在家还是在工作单位，留给我们阅读的时间少之又少。毕竟现代化的生活节奏越来越快，传统的阅读方式已经颇显拖拉了。而快捷的新式阅读为我们节省了不少时间——在家，轻松的点几下鼠标就可以找出各种各样的读物，在单位工作的空余时间里，我们仍可以再电脑上轻松的找到同一本书继续阅读。甚至在外出的路途中，还可以掏出口袋中的手机阅读同样的东西——可以说，目前读书的方式已经相当丰富了，这让我们可以在紧张的空余时间里灵活的进行阅读。\r\n\r\n这种方便的特性，是纸书所欠缺的。所以为了适应这个特性，绝大多数的传统出版社都在考虑“数字化转型”。\r\n\r\n然而，单纯的数字化就够了吗？\r\n\r\n自上世纪90年代起，出版社就已经开始投入了不菲的资金进行各自的网站建设。直到近年，几乎每个出版社都有了各自的网站。可实际上，效果并非最初设想的那般成功——出版社网站虽然加入了众多当前流行功能，如交流互动平台、图书检索功能、网上支付功能、数字出版功能等，但这些并没有为出版社的效益做出有力的贡献，反而在一些层面上造成了困扰。\r\n\r\n2008年在北京召开的出版业网站建设与创新年会上，中国出版科学研究所发布了《全国出版社网站现状调查主报告》。报告中对出版社数字化转型的情况进行了深入的探讨。从中我们看到，虽然很多出版社都想尽办法要适应网络，建设了各种流行平台，但从盈利情况上来看并不乐观。其中39%的网站亏损，其余的网站均呈未盈利状态。正如报告中所说——“网站对他们来说似乎成了鸡肋——食之无味，弃之可惜。”\r\n\r\n这就引发了我们的思考——问题到底出在了哪里？\r\n\r\n在下一章节，我们将对此进行分析。\r\n\r\n对策\r\n\r\n出版社建设的网站中，交流论坛、在线购买、图书检索等功能应有尽有，但是仍不能达到很好的效果，问题出在哪里呢？\r\n\r\n考虑这个问题，就必须先从读者出发——首先要研究读者的需求。\r\n\r\n现在设想我是一位普通的读者，想找一本名叫《C语言》的书。那么一般情况下我会怎么做呢？——我会直接到淘宝网、当当网或者卓越网，搜索这个书名，然后在这本书的页面上浏览简介和评价后，决定是不是要付费购买。这就让我们想问一个问题——普通读者会关心这本书是哪个出版社的吗？很明显，大多数的读者都只关心这本书是不是足够满足自己的需要，而很少去考虑它是哪里出版的，更不会专门到哪个出版社网站去搜索一本书，并在一个不怎么熟悉的付费平台上支付费用。\r\n\r\n现在的淘宝、当当等网站建设的图书购买平台，以及豆瓣网的图书评价平台都已经相完善了，并且拥有了相当大的用户量和信任度。因此我的观点是，各出版社再将资金投入到各自的网站功能建设中，只能是构成一些不必要的重复建设。\r\n\r\n出版社的目的是盈利，没有利用到自己的长处，而盲目的加入到电子商务的高度竞争中，不但会拼得头破血流，还会导致得不偿失。《全国出版社网站现状调查主报告》中对此亦有相当深刻的认识，文章在“出版社网站建设发展趋势”一章节里说到：“随着数字出版产业的进一步发展，出版社深刻认识到“内容为王”的重要意义，谁的内容资源具有更强大 的市场整合力，谁就拥有更大的市场控制力。于是，不少出版社纷纷开始迈出了产品和内容资源数字化的脚步，出版社网站不再是简单的图书宣传，建立一个强大的专业数据库才是出版社及其网站得以长期生存的基础。”\r\n\r\n不错，“内容为王”对出版社有非常重要的意义，并且如何巧妙的利用起自己的“内容优势”，并将之与“数字化”结合，是一条前途光明的道路。\r\n\r\n笔者认为，以当当网为代表的纸书销售平台、以知网为代表的电子出版物销售平台和以豆瓣网为代表的评论平台为例，出版社如何与这三大平台合作，将成为“数字化”的关键所在。\r\n\r\n目前，三大网络平台虽然在互联网上已经占有相当大的份额，但是仍然不能有效的与读者的需求结合。\r\n\r\n当当网，虽然各类的纸书应有尽有，售价相当低廉，但从其业绩中可以看到，纸书的销售已经遇到一定的瓶颈；知网，以专业著称，拥有相当大量的专业数字出版物资源，但其目前的资源定位仍有一定的局限性，同时付费系统也远不如当当网成熟；豆瓣网，一直处于技术和设计的高端位置，其读书频道已经做到了国内的读书社区的顶尖水平，但可以看出如何将其与销售挂钩是这个社区的重大难题。\r\n\r\n笔者由此想到，如果以满足读者需求为核心，将出版社的内容优势与这三大平台结合，将得到一个多赢的局面。\r\n\r\n为了研究这个多赢的读书系统，让我们再回到读者需求这个问题上——读者有哪些最主要的需求？换言之，如果我是读者的话我最关心什么？一般来讲，读者的关心的问题很简单，我将之概括为以下三个问题：\r\n\r\n读什么书才能满足我在学业、职业和研究等领域上的需要？\r\n\r\n买纸质书好还是下载电子书好？\r\n\r\n去哪买书既方便又可靠？\r\n\r\n第一个问题，“读什么书”是关于读者的目的问题，就是说哪本书是可以解决读者问题的呢？目前为止，市场上还都没有很好的解决这个问题——纸书的重镇图书馆和书店，最多只做到了书籍的一级分类，即其所属的行业分类，如社科、经济、电子、教育等；而刚刚形成的电子新军如当当网和豆瓣网，最多也只是在其基础上加细了分类，并利用网民的\r\n\r\n力量创造了“书评”和“书单”机制，但这仍然距离读者的目的有一段距离，而且它也并没有很好的解决盈利的问题。\r\n\r\n值得一提的是，作为读书社区代表的豆瓣网对书籍采用了“标签法”，这个看似简单的给每本书贴上若干词语标签的方法，实质上是针对目标搜索技术的一个革命性创新。我们知道，此前我们的所有分类方法都是树状的结构，例如我想在书店找到高三年级的数学模拟考试复习题，那么首先我会走到教育类书籍区域，然后找到教辅类，接着依次找到高中年级→高三→数学，最后再翻找出来模拟考试题。现实证明，这种树状分类是相当低效的，也就是说如果我记不清楚其中的某一个节点，将很难找到你需要的书。\r\n\r\n而类似人脑神经元结构的网状分类，却是搜索引擎的绝佳搭档。——我们无需知道这本书的每一层分类，只需要它的部分内容或关键字，搜索引擎就会告诉我这本书的具体位置。因此我们可以得出一个结论——即树状分类适合少量书籍，而网状分类适合大量书籍。\r\n\r\n实际上部分的书店和网站已经实现了网状分类的功能，但是这还远远不够——如果我并不知道这本书的内容，甚至不知道它的名字，那么怎么能知道它的标签呢？比如你想找一本怎样治疗脚气的书，那么当你在书商的搜索网络里输入“治疗脚气”时，你会发现你很难达到目的，因为很少会有书名或者标签叫做“治疗脚气”。再比如，我希望在期末考试前的一周内想快速的突击学习一下微积分，而搜索出来的结果也许就只有名称叫做“快速学习微积分”的书，那么类似《微积分之屠龙宝刀》这种高效的速学手册也许永远无缘与你见面。\r\n\r\n通过逆向推理，从正常人的思维顺序出发，笔者想到了一个更合理的解决方案——为每本书建立一个“问题数据库”（以下称为Q-DB），这里面列出了可以为你解决的每一个问题。例如《微积分之屠龙宝刀》这本书，它在Q-DB中会储存例如“快速学习微积分”、“什么是微分”、“什么是积分”、“如何画函数图象”、“微积分常犯的错误”等等一系列的标签。这时当我想知道如何快速学习微积分时，只需要在搜索引擎输入“如何快速学习微积分”就可以快速的找到相关的书籍。再比如，《本草纲目》在Q-DB中可能会包含诸如“如何治疗头痛”、“如何治疗脚气”、“吃乌鸡有什么用”等等一类的标签，这时我也可以非常方便的通过输入你的问题而迅速找到这本书。\r\n\r\nQ-DB的实现将会是一个革命性的创举，而且它是极易实现的。它的唯一难度就在于工作量巨大，而实现每本书的详细Q-DB数据，可以想到的是三种方式，它们可以同时进行：\r\n工作人员有选择地录入\r\n\r\n仿照维基百科模式，通过网友的力量自发补充\r\n\r\n出版社的通过自身的内容优势，从源头上提供Q-DB数据\r\n\r\n这样一来，如果Q-DB能够得到实现，第一个问题——即读者的目的问题将得到完美的解决。\r\n\r\n第二问题，“买纸质书还是下载电子书”是关于读书的方式问题。随着电脑的普及，以及智能手机、亚马逊Kinddle和Ipad等电子阅读器的面世，人们越来越多的选择了在电子设备上读书看报，而不是捧着厚重的纸质书阅读，一是方便，二是便宜。这样一来，图书商的利润被连年地无情地剥夺，在不断有人高喊“纸质媒体”已死的同时，图书商却始终找不到一条有效的突破口。而我认为，关于纸质书和电子书的问题应该客观来看待：\r\n\r\n电子书虽然方便、便宜，可以随时随地阅读，可以在网络上随处下载，但是它也有自身的局限性。例如做笔记的操作和导出不方便；做不到灵活翻阅和快速阅读，毕竟屏幕大小有限，只是一张屏幕而不像纸质书可以灵活翻读；依赖电力支撑等等，总而言之无法做到优质阅读，只能针对小说和新闻类阅读。纸质书虽然携带不便，但是无论做笔记、快速翻阅、来回对比还是整体阅读效果，都相对优越。因此纸质书仍然保有大量的忠实客\r\n户，在未来数十年内还无法完全被电子书取缔。\r\n\r\n对于出版社来说，应该电子书、纸质书两手抓：在网络上，针对电子书提供部分的免费阅读，同时又提供相应纸质书的尽量多的有用信息。结合企业利益，让我们分别来看看它们的情况：\r\n电子书\r\n\r\n首先，电子书的普遍化是必然的。如果商家固执于纸质书的销售，就等同于放弃极大的市场。所以企业应当迅速转型，减少纸质书的产量，将精力和研究费用投入到电子书的系统中，从电子书市场上寻求盈利模式。其中可供参考的主流的作法是收费阅读和投入广告。其中收费阅读可以是收取模拟货币，而投入广告也可以是采用书籍的背景嵌入或“片头广告”的方式。\r\n\r\n其次，推行付费的电子书是势在必行的，也是未来的趋势。因为如果电子书全部免费，那么将使图书上和作者都无法盈利，反过来也就减少图书的产量，这是违背发展规律的，所以电子信息的免费时代终将被付费系统取缔。也就是说，尽快的研发容易让读者接受的付费系统，是图书商家都需要做的主要工作。\r\n\r\n纸质书\r\n\r\n是去新华书店买本书呢，还是干脆在网上下载一个到电脑上看呢？——这个问题困扰着很多的读者。由于纸质书的购买和携带不便，往往会使现代人产生犹豫。所以我的观点是，这个问题不应该让读者去承担，而应当由图书商家来发挥作用。因为只要读者还在犹豫是不是要买纸质书等问题时，就意味着商家有相当的几率会失去这些客户。\r\n\r\n那么，问题就在于，书商怎么给读者提供既清晰又可靠，同时又能增加其购买欲的建议呢？需要声明的是，我们不考虑书籍内容本身的宣传和畅销与否的问题，而是要讨论怎么使纸质书的整体销量得到一个提高。所以如果需要宣传，将是一场较大的“国民再教育运动”——其中牵涉到了读者的认识问题。我们需要通过各种途径教育读者，如果想更有效、更高质量的读一本非小说书籍，电子书是不能满足他的。而读者为什么要高质量的去读一本书呢？我们又要教育他，要想用有效的时间学比别人更多的东西、增加自己的社会竞争力，就必须首先学会怎样高质量阅读一本书。所以说，我们要做的不是一个简单的宣传，而是一种范围广大的“再教育运动”。\r\n\r\n当然，考虑到实际运行的问题，我们可以先以小成本入手，例如在每本售出的书中就夹一些阅读提示等，潜移默化地给读者们灌输正确思想。当条件成熟时，再联合书商媒体等，以“增加中国人阅读质量”为旗帜大规模宣传。\r\n\r\n第三个问题，“去哪买书”是付费方式的问题。互联网发达的今天，毫无疑问越来越多的人选择网络付费。那么如何通过简单的付费方式，来增加读者的购买欲呢？——如果能够将出版社、网络销售平台以及读书社区的购买平台融合起来成为一体化的付费系统，将达到这个目的。\r\n\r\n这个一体化方案，涉及了网络系统的集成方案、销售业务的提成方案以及物流方式等问题。如果出版社能够把重心投入到多方合作上面，将极大的推动一体化的形成。而促进出版社重心转移的催化剂正是——利益。从出版社过往的自身网站建设状况来说，以自己的力量并不能有效的增加效益。但讲求互助互动的今天，如果出版社认识到借助互联网上已经成熟的平台将达到自己的盈利目标，则他们将会欣然去促成这个合作方案。\r\n\r\n简而言之，本文所提出的“读书系统改革”，也可以看做是一次全行业一体化的合作方案，即形成一套崭新的读书系统。这个系统的设计结构，我们将在下一章节中对此系统进行一个更清晰的描述。\r\n\r\n系统设计"},{"url":"https://api.github.com/repos/solomonxie/solomonxie.github.io/issues/comments/383297927","html_url":"https://github.com/solomonxie/solomonxie.github.io/issues/17#issuecomment-383297927","issue_url":"https://api.github.com/repos/solomonxie/solomonxie.github.io/issues/17","id":383297927,"user":{"login":"solomonxie","id":14041622,"avatar_url":"https://avatars2.githubusercontent.com/u/14041622?v=4","gravatar_id":"","url":"https://api.github.com/users/solomonxie","html_url":"https://github.com/solomonxie","followers_url":"https://api.github.com/users/solomonxie/followers","following_url":"https://api.github.com/users/solomonxie/following{/other_user}","gists_url":"https://api.github.com/users/solomonxie/gists{/gist_id}","starred_url":"https://api.github.com/users/solomonxie/starred{/owner}{/repo}","subscriptions_url":"https://api.github.com/users/solomonxie/subscriptions","organizations_url":"https://api.github.com/users/solomonxie/orgs","repos_url":"https://api.github.com/users/solomonxie/repos","events_url":"https://api.github.com/users/solomonxie/events{/privacy}","received_events_url":"https://api.github.com/users/solomonxie/received_events","type":"User","site_admin":false},"created_at":"2018-04-21T14:05:26Z","updated_at":"2018-04-21T14:05:37Z","author_association":"OWNER","body":"# idea: KOTONES计划\r\n\r\nKOTONES即Keep on top of new economic system.意思为在新经济体系保持领先优势。\r\n在计划团队里，为了方便交流，有些人就喜欢称它为KO Tones，“击败对手的语调”。\r\n大革命分为两步，\r\n第一步是发布产品，引起全行业结构调整大革命（通过创新技术引发各个产业结构调整），即LERORS计划\r\n第二步是保持优势，方法是以不断创新、通过利用自己核心理念领先于别人开发创新产品，\r\n发布一系列配套新产品，更详细的通过各个行业的相关配套创新产品，即“领先计划”\r\n\r\nleorors的口号是“划时代的产品”\r\n领先计划的口号是“回归用户的需要，让操作更单纯”\r\n含义是，所有复杂的操作都在后台完成，不让用户去选择系统，不让用户去选择看书软件\r\n一切都可以在后台完成，而界面上并没有什么差别。"},{"url":"https://api.github.com/repos/solomonxie/solomonxie.github.io/issues/comments/383298011","html_url":"https://github.com/solomonxie/solomonxie.github.io/issues/17#issuecomment-383298011","issue_url":"https://api.github.com/repos/solomonxie/solomonxie.github.io/issues/17","id":383298011,"user":{"login":"solomonxie","id":14041622,"avatar_url":"https://avatars2.githubusercontent.com/u/14041622?v=4","gravatar_id":"","url":"https://api.github.com/users/solomonxie","html_url":"https://github.com/solomonxie","followers_url":"https://api.github.com/users/solomonxie/followers","following_url":"https://api.github.com/users/solomonxie/following{/other_user}","gists_url":"https://api.github.com/users/solomonxie/gists{/gist_id}","starred_url":"https://api.github.com/users/solomonxie/starred{/owner}{/repo}","subscriptions_url":"https://api.github.com/users/solomonxie/subscriptions","organizations_url":"https://api.github.com/users/solomonxie/orgs","repos_url":"https://api.github.com/users/solomonxie/repos","events_url":"https://api.github.com/users/solomonxie/events{/privacy}","received_events_url":"https://api.github.com/users/solomonxie/received_events","type":"User","site_admin":false},"created_at":"2018-04-21T14:06:02Z","updated_at":"2018-04-21T14:06:02Z","author_association":"OWNER","body":"# idea: LERORS计划中的合作方\r\n\r\n扎克伯格为一体化合作进行了五年的暗中行动，花了十几亿资金，然后等待机会，苹果连续12个月低迷才决定辞职进军苹果\r\n\r\n1.与银联、移动合作 ，可以直接支付，不用SIM卡内置芯片直接确认个人身份，最后的安全确认可以通过统一客服打电话确认。\r\n还有实现银行间的转账、划账、购买理财产品、定期存入保险金和理财金、活期死期存款都互联。\r\n\r\n2.电子纸与无数隐形针头摄像头结合，利用合成成像技术实现拍摄需要\r\n\r\n\r\n3.与出版社合作，出版社负责电子书数据和出厂QDB数据以及名人+职业书评人+相关业内人士的书评及介绍及相关延伸和解读等，自己不销售，从经销商处赚钱。\r\n\r\n4.与当当卓越网合作，电商负责推广图书，并利用自己影响力大小决定网友自发填充QDB数据及书评及读书笔记等数据的多少。\r\n当然数据都是收费并保密的，出了阅读短评是免费观看外，书评和QDB都是收费的，\r\n书评每次被阅读收0.1元钱，其中一部分是给书评作者的，另一部分是给出版社的，鼓励填充，量越大赚得越多。QDB收搜索费，或者贵宾订制，客服直接打电话沟通，并把所有找到的结果提供给客户。咨询服务时代拼的就是服务和专业度，把传统赚钱方式看轻\r\n\r\n5.与知网合作，可以智能分析相关学术论文和文献，并提供给客户。分析也可以有文字自动初级分析，\r\n还可以电话交流、留言等方式高级分析，收入也是自己一部分作者一部分。内容与服务为王的时代反而看轻了广告收入，回归正常。\r\n\r\n6.与广告商传媒公司合作，智能分析客户需要的产品，利用客户的使用记录提供类似淘宝猜的列表。不用让产品商按月收钱，\r\n所有产品都只需要一次注册，全部可以包括在数据库里提供给客户，客户买了才分利润提成。更多的产品数据与减少商家广告支出对双方都有利。\r\n\r\n7.与视频网合作，上同。教育科普专业类收费，娱乐类免费\r\n\r\n8.与物流合作，提供超高速超灵活运输网。城市内，物流通过与公交集团合作，每个地铁或公交枢纽或总站都租用一个区域放置物流货物，\r\n并安排一定运输车辆，成为一个交通点，并网状向各分点辐射，层层传递。或采用大胆点的思路，借用所有居民的力量，\r\n每个人在移动时都将一部分货物带到另一个区域。设置货物保额和时间限制，有一套奖惩规则。物流增强约会机制，不用非得固定地址，\r\n两人约在合适地点和时间交货，如果爽约则再约，先补缴二次运费就好了。\r\n\r\n9.与猎头公司合作，\r\n\r\n10.与咨询公司合作，提供各职业、行业的智能分析建议"},{"url":"https://api.github.com/repos/solomonxie/solomonxie.github.io/issues/comments/383298059","html_url":"https://github.com/solomonxie/solomonxie.github.io/issues/17#issuecomment-383298059","issue_url":"https://api.github.com/repos/solomonxie/solomonxie.github.io/issues/17","id":383298059,"user":{"login":"solomonxie","id":14041622,"avatar_url":"https://avatars2.githubusercontent.com/u/14041622?v=4","gravatar_id":"","url":"https://api.github.com/users/solomonxie","html_url":"https://github.com/solomonxie","followers_url":"https://api.github.com/users/solomonxie/followers","following_url":"https://api.github.com/users/solomonxie/following{/other_user}","gists_url":"https://api.github.com/users/solomonxie/gists{/gist_id}","starred_url":"https://api.github.com/users/solomonxie/starred{/owner}{/repo}","subscriptions_url":"https://api.github.com/users/solomonxie/subscriptions","organizations_url":"https://api.github.com/users/solomonxie/orgs","repos_url":"https://api.github.com/users/solomonxie/repos","events_url":"https://api.github.com/users/solomonxie/events{/privacy}","received_events_url":"https://api.github.com/users/solomonxie/received_events","type":"User","site_admin":false},"created_at":"2018-04-21T14:06:20Z","updated_at":"2018-04-21T14:06:20Z","author_association":"OWNER","body":"# idea: LERORS计划中的团队\r\n\r\nLERORS指Leonard Elric's Revolution of System，或者LEROS水晶.\r\n在团队里，为了方便，人们称它为“水晶计划”\r\n租了几层楼，位于偏远地区，保密级别是绝密。\r\n封闭式开发，而且是长时间。\r\n当然不止是初创阶段，后续维护阶段仍然维持这些小组运作。慢慢就发展成了固定的公司维护团队，而且是核心竞争力。\r\n\r\n包括如下团队：\r\n\r\n1.识别引擎团队（由fb自主研发，不利用谷歌。）\r\n包括语义分析小组，搜索引擎小组，其中最重要的就是语义分析小组，重金请来了众多语义分析顶尖专家。\r\n语义分析小组分为正语义分析组（将电子数据或外国语言翻译成能理解的东西）和反语义分析组（将人的语言翻译成计算机指令），\r\n搜索引擎小组，主要研发新式的搜索引擎，替代传统的关键词搜索，结合语义搜索（可以轻松声控）来达到目的\r\n\r\n\r\n2.安全团队\r\n包括银行接口小组，安全验证小组。其中最重要的就是安全验证小组。\r\n\r\n3.用户需求团队\r\n包括行为心理分析小组，数据分析小组，软件实现小组。\r\n\r\n4.物流运输小组\r\n包括物流公司小组，公共交通集团小组，物流专家小组等。\r\n\r\n5.美化团队\r\n包括VI设计小组，界面制作小组\r\n\r\n6.统筹策划团队\r\n包括ceo，战略设计小组，公关小组，商业分析小组，技术顾问小组，商务执行小组，\r\n\r\n7.职业帮助团队\r\n职业调研小组，软件实现小组\r\n\r\n8.兼容化团队\r\n消除三大差异小组（3个），系统兼容小组，软件兼容小组，游戏兼容小组，技术移植小组，\r\n\r\n9.娱乐团队\r\n游戏小组，音乐小组，电影小组，\r\n\r\n10.核心系统平台团队（最大最重要的技术团队）\r\n彻底换掉ios旧系统，为了高融合性的平台，开发了一套新ios系统。\r\n新系统巨牛逼，各每个个人文件打上标签和问题数据库，不用老式的层层文件夹或树形结构了，\r\n有了网状结构，可以用任何途径找到想要的。和大脑一样。"},{"url":"https://api.github.com/repos/solomonxie/solomonxie.github.io/issues/comments/383298203","html_url":"https://github.com/solomonxie/solomonxie.github.io/issues/17#issuecomment-383298203","issue_url":"https://api.github.com/repos/solomonxie/solomonxie.github.io/issues/17","id":383298203,"user":{"login":"solomonxie","id":14041622,"avatar_url":"https://avatars2.githubusercontent.com/u/14041622?v=4","gravatar_id":"","url":"https://api.github.com/users/solomonxie","html_url":"https://github.com/solomonxie","followers_url":"https://api.github.com/users/solomonxie/followers","following_url":"https://api.github.com/users/solomonxie/following{/other_user}","gists_url":"https://api.github.com/users/solomonxie/gists{/gist_id}","starred_url":"https://api.github.com/users/solomonxie/starred{/owner}{/repo}","subscriptions_url":"https://api.github.com/users/solomonxie/subscriptions","organizations_url":"https://api.github.com/users/solomonxie/orgs","repos_url":"https://api.github.com/users/solomonxie/repos","events_url":"https://api.github.com/users/solomonxie/events{/privacy}","received_events_url":"https://api.github.com/users/solomonxie/received_events","type":"User","site_admin":false},"created_at":"2018-04-21T14:07:33Z","updated_at":"2018-04-21T14:07:33Z","author_association":"OWNER","body":"# idea: 叙述构思\r\n\r\n叙述方法\r\n写sam去了北京，然后直接跳转到与扎克伯格对话，在描述扎克伯格故事的过程中穿插论文的片段或作者的话。\r\n前面情节都要改一下了，不让sam获得原文，去北京后才拿到文章。\r\n作者当初的论文也没有发表，只是当做毕业论文或业余写作给了自己的导师看，没什么反响也就弃了。\r\n然后偶然机会在扎克伯格召开fb开发大会时提出大家踊跃献策，谁能提出最有创意的计划就给谁大奖。\r\n其中一个人到处想办法，然后在偶然机会里和作者的导师聊到了这里，导师想起了把这篇文章发给他。\r\n由于学生早就毕业也失去联系了，所以没征求意见就贡献出去了，只是提供参考没觉得会拿奖。结果被采纳了，且用尽方法让他们保密，连作者都不让知道。"},{"url":"https://api.github.com/repos/solomonxie/solomonxie.github.io/issues/comments/383298238","html_url":"https://github.com/solomonxie/solomonxie.github.io/issues/17#issuecomment-383298238","issue_url":"https://api.github.com/repos/solomonxie/solomonxie.github.io/issues/17","id":383298238,"user":{"login":"solomonxie","id":14041622,"avatar_url":"https://avatars2.githubusercontent.com/u/14041622?v=4","gravatar_id":"","url":"https://api.github.com/users/solomonxie","html_url":"https://github.com/solomonxie","followers_url":"https://api.github.com/users/solomonxie/followers","following_url":"https://api.github.com/users/solomonxie/following{/other_user}","gists_url":"https://api.github.com/users/solomonxie/gists{/gist_id}","starred_url":"https://api.github.com/users/solomonxie/starred{/owner}{/repo}","subscriptions_url":"https://api.github.com/users/solomonxie/subscriptions","organizations_url":"https://api.github.com/users/solomonxie/orgs","repos_url":"https://api.github.com/users/solomonxie/repos","events_url":"https://api.github.com/users/solomonxie/events{/privacy}","received_events_url":"https://api.github.com/users/solomonxie/received_events","type":"User","site_admin":false},"created_at":"2018-04-21T14:07:47Z","updated_at":"2018-04-21T14:07:47Z","author_association":"OWNER","body":"# idea: 大构思\r\n\r\n神秘礼品是一块特制手表，专门用来和IPAPER连接。其实它是一个超大额移动电源，用一根绳子样酸绳就可以连接充电。同时还是一个额外硬件适配器。它具有独立CPU，显卡，USB，接收器，投影机，等功能，IPAPER只是一个超级浏览器而已，利用云计算来达到一切功能，云计算器将完成一切处理，终端只是显示而已和发送指令而已，连数据都是存储在云上的，那时对客户已经不存在下载了，因为一切都在网上，从别人那到自己这也只是一瞬间，数据相同，只是使用者增加了而已，当然这一切都基于网速高度发达。而手表弥补了没有网络时的缺憾。它自备好额硬盘存储，在没有网络时可独立运行简单和必要程序，如看电影和编辑办公软件。\r\n\r\n从神秘极品记者SAM和他会面开始进主线。记者得到礼品时还被允许和扎克伯格进餐，他问扎克伯格怎么想起做这个，他说受到灵感启发，问什么灵感，答受到中国图书产业改革的启发，所以想到将概念延伸到全行业。问他这是什么时候的事，答秘密（作为下次会面的伏笔）\r\nSAM回去以后查中国图书产业改革，但并无此事，很好奇，联系中国朋友帮忙调查。也说没有此事，从来没听说过。他感到万分疑惑。然后再问了许多中国朋友，终于有一个中国出版社的朋友说偶然在网络上下载过一篇文章，因为搜索出版社相关内容的时候发现的这个标题，很感兴趣就下载了，看了以后发现作品写于很多年前，2013年。翻译后给了SAM，\r\n\r\n然后他决定深度研究，挖掘这个独家大新闻，毕竟其他媒体只是表面的报道大家都知道的，如果SAM能把这个产品怎么来的，内在逻辑和基础什么的秘密通通挖掘出来，那么一定会受到广大消费者，研究者，业内分析师，竞争对手的追捧的。\r\n\r\n此时主编又在追稿，询问采访进度，他模模糊糊的写了一篇记叙文，但没写扎克伯格获得灵感的那个事。ANDY说他做的还不够，他坦白还想挖掘些大文章，主编同意了。他专心攻读这篇论文，仔细研究了每一项内容，并随手搜索。\r\n\r\n留下一些疑问，然后申请去中国采访作者。本来打算研究透了就去发表专题文章，以此结束。\r\n\r\n\r\n\r\n\r\n\r\n但是惊奇的从作者那得知还有一些后续的章节没有发表，是后来自己续写的，是针对这套系统未来继续发展的要点。于是想到联合作者，利用这一点来换去扎克伯格如何实现这个系统的后台故事，作者也很感兴趣，毕竟当初只是一个构思，没想到有人实现了。他也想知道一些具体内容，为自己的理论研究当做实践参考材料。所以给sam文章和建议的条件是告诉他故事。\r\nSAM回国后就找到了扎克伯格，进行交涉。一开始不同意，认为sam的信息也许没有价值，不值得告诉他那么多商业机密。但是几天后，有人提醒他三星要模仿苹果在两个月后发布一样的东西，而且合作商更加强大，客户群更庞大，价格更低。\r\n他召集公司内部开会，没有得出满意答案，于是叫来了SAM，答应交换条件。于是开始谈自己的实现历程。\r\n他透露了自己早就计划好了一切，包括辞职和来苹果等，这些在来苹果公司后都和大家说明了所以没必要刻意隐瞒。SAM越听越感兴趣 ，故事太戏剧性了。\r\n扎克伯格谈到当初获得灵感文章，然后请来了麦肯锡策划，建立了一套策略，包括如何让对方同意合作，共同盈利点在哪等等。\r\n和谁合作这个都是扎克伯格自己想出来的，但商业问题他不懂所以请的麦肯锡。\r\n他告诉了SAM分别和哪些企业合作，什么内容，最终目的是什么，自己信阳的也是做成这么一套完全用户体验系统，谢为他奠定了理论基础。\r\n他还讲了如何在十个月内完成硬件基础，其实也很简单，他在那些年间探访了很多很多新型技术公司，全是创新尖端技术，而他要做的就是做梦，把这些零件有选择的拼成一个梦。设计好了后就把这些企业找来，或是收购技术，或是外包出去，在联合苹果的软件团队，租了一栋大楼，所有人在一起集中研发，核心研发人员都在一起住，即使有的公司不在这里工作也必须派人在这里当联络员进行协调沟通。大多数技术都是现成的，只需要组装，所以很快。包括……公司。（所有技术都要提到介绍到）\r\n还讲怎么挨家挨户去联系系统合作商，为什么选择那些不是最大的行业成员。\r\n再讲他的梦是什么样的，即让所有人都联系起来，作者也说过，用户的高度满足状态也是企业间高度合作的时候。扎克伯格深信这句话，想实现它，哪怕一次。这次的联系远比最早FACEBOOK的联系人与人更上了一层楼，高了一个深度。\r\n\r\nSAM很满意，然后告诉他自己知道的对付三星的办法。\r\n谈到了作者的时间理论，还谈到了不能降价竞争，谈到中小企业的合作优势，谈到销售机器的回扣给合作商，还有最核心的就是合作多赢理念，只要坚持做下去尽量满足客户别人达不到的体验，把人性感性智能帮助做好，别人是不会勉强使用低价不好用的产品的，因为如果有价的产品能够带来自己无价的提升的话，睡都不会觉得吃亏的。\r\n\r\n扎克伯格很满意，原来内部会议不能满足他就是因为都没有作者理解核心理念，竞争对手也一样，只是从外部模仿样子，莫非类似的程序，但没法像IPP一样那么完美的融合在一起（正好fb也是利用平台的理念公开接口接受各种各样的程序），就像FB基于一个简单理念才做到校内不能比，苹果基于完美用户体验也是各种山寨不能比一样，大家只是山寨流行起来的外表和一些软件，大家都安装了这些特软件，但是软件之间有没有接口呢？如果不是像扎克伯格这样做，将所有软件硬件系统合作商之间全部联络，建立接口，（软件间建立共同数据库，合作商之间利用IPP平台智能获取分析用户数据，而IPP作为中间商像淘宝平台一样拥有睡也不能代替的收集了庞大的不可估价的用户数据，一样也是不能替代的）\r\n这一切都使苹果不了替代，除非有人了解的原理后再争先恐后的去做，但是历史证明不是所有地方都能这样无间合作的，大家都做不好，十几年还差不多。而扎克伯格正是利用中小企业做到了这一点，换做垄断行大企业就不可能了。\r\n\r\n扎克伯格想通了以后，加强了合作协议的年限，并且对一些公司进行注资入股，重新签订协议，将长期稳定合作放在首位，并不允许和别人做相同合作。\r\nSAM还给他带来了另一篇文章[探讨开源思想与应用] 的升级未发表版本，核心理念就是不怕被人抄袭，并强调了盈利模式。\r\n扎克伯格把故事都讲给SAM听了，高兴的还把一些合同与构造图给他看，前提是一 关键数字保密 二 尽量写好\r\n其实他知道 这就是开源的秘密 无论怎么公开内部 也不会被超越 所以借此机会把自己和公司的影响力都抬上去 未尝不可！\r\n\r\n对了 其实他并没有抛弃FB，而且还融合了新功能，通讯录族谱。联网民政局数据，计算出每个人的族谱与朋友网状模型，还添加了社交分析模型，利于增加个人的社交能力。将社交理论融合进来，如果一个人想社交好需要哪几样素质，给每项自动评分，根据变动的评分得知自己哪里应该改进。评分类似于最初FB哈佛美女打分模型，利用好友打分来知道自己怎么样情况。\r\n\r\n\r\n\r\n未来虽然大大增加了懒人，但是可以靠出卖体力（运动发电）和出卖智力（填充QDB和写书评和辅助针对性列书单和提供经验指导等）\r\n\r\n\r\n\r\n记者到北京回来以后，开始两段重点。第一个是实行LERORS计划，第二个是实行KOPIS计划。结局留下悬念，即机器的智能取代了人类的很多作用，造成了失业。这个问题也藏在作者未发表的文章中。"},{"url":"https://api.github.com/repos/solomonxie/solomonxie.github.io/issues/comments/383298277","html_url":"https://github.com/solomonxie/solomonxie.github.io/issues/17#issuecomment-383298277","issue_url":"https://api.github.com/repos/solomonxie/solomonxie.github.io/issues/17","id":383298277,"user":{"login":"solomonxie","id":14041622,"avatar_url":"https://avatars2.githubusercontent.com/u/14041622?v=4","gravatar_id":"","url":"https://api.github.com/users/solomonxie","html_url":"https://github.com/solomonxie","followers_url":"https://api.github.com/users/solomonxie/followers","following_url":"https://api.github.com/users/solomonxie/following{/other_user}","gists_url":"https://api.github.com/users/solomonxie/gists{/gist_id}","starred_url":"https://api.github.com/users/solomonxie/starred{/owner}{/repo}","subscriptions_url":"https://api.github.com/users/solomonxie/subscriptions","organizations_url":"https://api.github.com/users/solomonxie/orgs","repos_url":"https://api.github.com/users/solomonxie/repos","events_url":"https://api.github.com/users/solomonxie/events{/privacy}","received_events_url":"https://api.github.com/users/solomonxie/received_events","type":"User","site_admin":false},"created_at":"2018-04-21T14:08:04Z","updated_at":"2018-04-21T14:08:04Z","author_association":"OWNER","body":"# idea: 序言（自序、推荐序、尾言）\r\n\r\n序言\r\n（有自序，也有推荐序，全是未来的情节。只有文章最后出现的尾言才是真实的作者言。）\r\n像凡尔纳一样，执着于幻想，尽量合理但又不要被现实束缚，就像师父说的一样，就大胆去想！"},{"url":"https://api.github.com/repos/solomonxie/solomonxie.github.io/issues/comments/383298345","html_url":"https://github.com/solomonxie/solomonxie.github.io/issues/17#issuecomment-383298345","issue_url":"https://api.github.com/repos/solomonxie/solomonxie.github.io/issues/17","id":383298345,"user":{"login":"solomonxie","id":14041622,"avatar_url":"https://avatars2.githubusercontent.com/u/14041622?v=4","gravatar_id":"","url":"https://api.github.com/users/solomonxie","html_url":"https://github.com/solomonxie","followers_url":"https://api.github.com/users/solomonxie/followers","following_url":"https://api.github.com/users/solomonxie/following{/other_user}","gists_url":"https://api.github.com/users/solomonxie/gists{/gist_id}","starred_url":"https://api.github.com/users/solomonxie/starred{/owner}{/repo}","subscriptions_url":"https://api.github.com/users/solomonxie/subscriptions","organizations_url":"https://api.github.com/users/solomonxie/orgs","repos_url":"https://api.github.com/users/solomonxie/repos","events_url":"https://api.github.com/users/solomonxie/events{/privacy}","received_events_url":"https://api.github.com/users/solomonxie/received_events","type":"User","site_admin":false},"created_at":"2018-04-21T14:08:35Z","updated_at":"2018-04-21T14:08:35Z","author_association":"OWNER","body":"# idea: 扎克伯格与乔布斯\r\n\r\nSAM与作者聊天，作者半开玩笑的谈到，他觉得很有趣，\r\n\r\n扎克伯格2004年创业，2010年达到巅峰 扎克伯格成为时代年度风云人物，\r\n第二年乔布斯就死了 可能认为有接班人了，即2011年9月FB开发者大会 乔布斯看到成绩很满意，自己在10月发布IPGONE 4S后也没有遗憾了第二天就去世了，\r\n2012年扎克伯格失去方向开始上市，收益不好，竞争对手太多而且移动领域还做不好，遇到了门槛，2013年上天赐予了他这篇文章，后面就是一系列的命运之旅了，扎克伯格与乔布斯千缠百绕的关系令人嗔目结舌。\r\n查乔布斯与疾病八年抗战史，结合扎克伯格的从大学到创业的旅途，很难不说这种接班真奇妙。\r\n2003年10月查出胰腺癌，而扎克伯格同月创办了FB。到2004年乔布斯就考虑培养自己接班人了，而扎克伯格FB正式上线。\r\n\r\n\r\n\r\n第八节 乔布斯与扎克伯格 \r\n\t\"乔布斯和扎克伯格的命运？\"这下连andy也按耐不住心中的好奇了，抢先问道。\"没错，\"作者刻意装出神秘的表情，\"虽然我不是美国人，但是我发现如果把乔布斯的一些事情和扎克伯格的事情联系起来，就会看到一些惊人的重合！\"\r\n\t\"快说吧，别卖关子了！\"说这句话的是咖啡店老板，他正巧走过作者的旁边，听说到有好玩的故事，就忍不住用中文催着这位中国作者赶紧讲。\r\n\t\"好吧好吧，我说！\"作者笑着说。\r\n\t\"你们看，乔布斯在每年的新品发布会上，是不是都穿的一样的衣服？\"作者问。\"是啊，每年都一样，休闲旅游鞋，浅蓝色牛仔裤，加上黑色的高领T恤。\"Sam回答到。\r\n\t\"没错。像他这种地位的人，每次召开发布会都是穿得像逛商场一样，\"作者说，\"然后我发现，扎克伯格也和他一样，不管什么场合，都穿那么一条牛仔裤，旅游鞋，和一件浅色T恤。\" \"那又怎么了，没什么奇怪的啊。\"Sam说。\r\n\t\"对，重点在后面呢，\"作者接着说，\"发现他们两个穿着很像以后，我就分别查了下他们各自的简历，发现不但穿着很像，而且性格和经历也很像！他们有很多共同点。\"Sam和andy好奇的看着作者。\r\n\t\"比如说他们都是20岁就开始创业；乔布斯在车库里创办了苹果公司，扎克伯格在大学宿舍里创办了Facebook；他们都是玩技术的怪才，乔布斯玩电子，扎克伯格玩编程。他们在高中时期对技术的狂热爱好远远超出了同龄人，很早就开始发明东西；他们都从大学辍学；他们的性格都很古怪，等等等等，\"作者看到Sam和andy听得正出身，很得意的接着说，\"最重要的是，他们的理念都一样：为了创造伟大的发明，引领时代的进步，而不是为了赚钱！\"\r\n\tSam点点头。作者接着说，\"这些你们可能都知道，但有趣的来了。我查了他们两人的一些经历，惊讶的发现了一些好玩的事情，如果把它们联系起来，就可以讲出一个完整的故事，哈哈！\" \"快说吧！\"咖啡店老板说。\r\n\t作者说：\"这样吧，以下的故事是我的原创，除了时间和事件是真实的以外，其他都是我幻想的，你们就姑且听着吧。\" \r\n\t然后他装作很严肃的说：\"1946年，世界上第一台计算机出现在了美国；经过了将近十年，它还是几十吨重，上帝嫌它太大了，于是1955年，乔布斯诞生了；上帝等了二十年，乔布斯终于长大了，上帝等不及，于是还没等上完大学就让乔布斯退学了--赶快做正事；四年后，也就是1976年，乔布斯成立了传奇的苹果公司，并正式卖出了苹果第一代小型个人电脑--上帝看着顺眼多了，于是苹果公司依靠这个电脑迅速的壮大了起来；到了1984年1月，乔布斯的苹果公司发布了第一款Mac个人计算机，这部被后来人称为是划时代的机器，在当年的销量并不好，乔布斯在苹果公司的事业也正在走下坡路。这个时候上帝想，只靠乔布斯一个人可不行，我还得找一个兄弟，于是到了5月份，扎克伯格出生了！1985年乔布斯无奈的离开了苹果公司，而扎克伯格一岁了，嘿嘿！1994年，乔布斯开始制作历史上第一部完全电脑制作的3D动画《玩具总动员》，开创了3D动画片的历史，而这一年扎克伯格十岁了，上帝给了他第一台电脑！于是俩个人都开始了自己的'新事业'；后来的几年里，乔布斯大绽光彩，而扎克伯格也正在初中学校里展现他惊人的编程天赋；上帝很欣慰，到了2000年，乔布斯重新登上苹果CEO的宝座，扎克伯格也在高中学校里编出一些新鲜的软件；2003年，上帝想乔布斯年龄也不小了，该给年轻人让让路了，于是10月份，乔布斯在医院检查到了自己身上的胰脏肿瘤，同一个月，扎克伯格受到了感情的刺激，突然一个灵感启发他在大学宿舍里创建了Facebook的前身Facemash；2004年，乔布斯被确诊为胰腺癌，几乎面临死亡，他一心只想着培养苹果的接班人，怎样才能找到替代他继续引领苹果、引领科技进步的人，这时扎克伯格闪亮登场了--Facebook正式上线了！（难道这不是上帝的巧妙安排吗？！）\" \r\n\t说到这里，作者看到Sam和andy都听得正出神，很难说挂在他们脸上的表情是相信还是怀疑，也许各占一半吧。\r\n\t作者接着说下去：\"这个时候，Facebook顺利运行后，上帝放心多了，于是就看着这两个人怎样为时代进步而努力。2005年，乔布斯重返到第一线工作，重点开发当时的高度机密项目--iphone一代，那个开天辟地的智能手机，此时扎克伯格的facebook也如日中天的侵占着各个国家的网络；2007年，乔布斯发布了那部划时代的尖端手机iphone一代，同时扎克伯格的Facebook成为世界上最大的社交网络，乔布斯已经关注到了扎克伯格这个人，并且直觉上就很喜欢这个小伙子，扎克伯格也说自己是乔布斯的信徒，《乔布斯传》的作者说，他们两个人之间似乎存在着一种'奇怪的亲密关系'；2010年，上帝想，时机差不多了，也该新老交替了，乔布斯的身体到达了极限，癌症在全身快速扩散，而扎克伯格却走上了巅峰，他获得《时代》的年度人物称号，Facebook在这一年超越谷歌成为了全世界点击率第一的网站。\"\r\n\t这时作者停顿了一下，看到Sam和andy的表情已经僵住了，仿佛他们是在听一个恐怖的鬼故事一样。作者慢慢悠悠的喝了口水，咖啡厅老板再次提示他快讲下去。\r\n\t作者继续说：\"这里才是关键。2011年，9月份扎克伯格召开了当时大型的Facebook第一届开发者大会，并在会上做了著名的演讲，提出了划时代的'开放平台'概念，乔布斯得知以后非常满意，他知道自己后继有人了，同时他也知道自己再也扛不住癌症的痛苦了。然后，你们知道的，乔布斯在第二个月发布了iphone4s，完成了他人生最后的一个引领时代的任务，第二天就去世了。\"作者低头闭目，双手合十默哀了几秒钟，两个记者也跟着一起默哀--毕竟，那个时代过来的人，没有人不为乔布斯的去世而感到遗憾。\r\n\t作者接着说：\"故事就到这里了，你们看，怎么样？\"\r\n\tSam还没有从那奇妙的命运故事中愣过神来，缓了一会儿，然后说：\"棒，太棒了！真的是这样吗？如果命运真的这么有趣，放在我们的报道专题里，肯定会有很大的反响！\"andy也表示同意。\r\n\t作者笑了笑，说：\"好吧，这个故事是你们的了。反正从我嘴巴里说出去，也没有什么影响力。既然觉得有趣，你们就拿去写吧！\""},{"url":"https://api.github.com/repos/solomonxie/solomonxie.github.io/issues/comments/383298383","html_url":"https://github.com/solomonxie/solomonxie.github.io/issues/17#issuecomment-383298383","issue_url":"https://api.github.com/repos/solomonxie/solomonxie.github.io/issues/17","id":383298383,"user":{"login":"solomonxie","id":14041622,"avatar_url":"https://avatars2.githubusercontent.com/u/14041622?v=4","gravatar_id":"","url":"https://api.github.com/users/solomonxie","html_url":"https://github.com/solomonxie","followers_url":"https://api.github.com/users/solomonxie/followers","following_url":"https://api.github.com/users/solomonxie/following{/other_user}","gists_url":"https://api.github.com/users/solomonxie/gists{/gist_id}","starred_url":"https://api.github.com/users/solomonxie/starred{/owner}{/repo}","subscriptions_url":"https://api.github.com/users/solomonxie/subscriptions","organizations_url":"https://api.github.com/users/solomonxie/orgs","repos_url":"https://api.github.com/users/solomonxie/repos","events_url":"https://api.github.com/users/solomonxie/events{/privacy}","received_events_url":"https://api.github.com/users/solomonxie/received_events","type":"User","site_admin":false},"created_at":"2018-04-21T14:08:49Z","updated_at":"2018-04-21T14:08:49Z","author_association":"OWNER","body":"# idea: 灵感填充\r\n\r\n0.\r\n重修！改变论文全文展现的形式，模仿三体和1984的模式，让原文在情节中穿插！！！！\r\n\r\n1.\r\n作者的利益在于 他想成立一家“未来社”，靠苹果发展壮大。先是给苹果独供，然后时机成熟给别人也供。\r\n未来社集商业咨询 领域研究 未来趋势研究 创意设计于一身。总之就是\r\n\r\n2.\r\n语音操作的要义在于，如果不能全程语音操控就完全没有意义，从用户体验上来说如果一部分要语音一部分要动手去操作，效率太低了。\r\n这也是语音操作这么多年没有发展起来的原因。\r\n\r\n3.\r\n新版ios会对每个软件的流畅度评分，这样就激励了每个软件对自己的改进。同时用户看到流畅不高，每个操作都延缓的软件就不下载了。\r\n\r\n4.\r\n扎克伯格不但利用了云计算，更弥补了缺点，用户付费后可享受定期数据备份功能，即离线存储。如果需要，可以根据数据大小打包到存储卡或移动硬盘邮寄过去。\r\n小成本大作用。不过是作为第二个阶段实施的，加入“反超越计划”中，一起推出。\r\n\r\n5.\r\n扎克伯格谈了对开源的理解，最后实施为系统源代码保密，但是提供开放平台，相当于一半一半。或者公开安全验证源代码。\r\n\r\n6.\r\n给自己写虚拟的推荐语，人名用真实的，时间设定在未来。但是在最前面要 声明所有人物公司只是虚构，借用了他们的身份而已。\r\n可以设定在2014年，推荐人用不知名的人，或是根本不存在的人。这样才能保证它所知人群不多。最好设定在中国。\r\n\r\n7.\r\n序言\r\n（有自序，也有推荐序，全是未来的情节。只有文章最后出现的尾言才是真实的作者言。）\r\n像凡尔纳一样，执着于幻想，尽量合理但又不要被现实束缚，就像师父说的一样，就大胆去想！\r\n\r\n8.\r\n关于麦肯锡献计献策\r\n扎克伯格决定实施LERORS计划是决定让麦肯锡出力。\r\n麦肯锡谈到，这个新品发售一定要高调从小地区做起，起效果再全球发售。\r\n就像fb从一个学校开始一样。\r\n\r\n9.\r\n关于下载\r\n未来就不存在下载的概念，都是在云端，极大减少数据重复。而且人们不用花费时间去长时间下载，同样存在云端的数据只要即时使用就行了。\r\n要是想下载到本地保存，还需要付出额外费用。而实际上你在云端操作是一样的，而且功能更强。\r\n但是有些人就是喜欢离线保存，也没办法，就花钱吧。\r\n看一次电影要付费，看多次可批量付费，无限次也有付费标准。\r\n听音乐也一样。\r\n\r\n10.\r\n数字时代的个人图书馆\r\n苹果下一步ilibrary\r\n个人图书馆，小成本。\r\n结合全息投影仪，将数字书智能投影到指定的房间里，形成真实图书馆的影像\r\n有详细的、合理的、自动的分类，\r\n然后用户可以去挑书看。\r\n方便之极。\r\n可以把这个设定为vip高端功能。\r\n加入到“领先计划”的战略产品中。\r\n\r\n11.\r\n消除三大差别：\r\n消除文字档案之间的区别，pdf和word没什么区别，凡是能看到的都能编辑。\r\n消除在线与离线的差别，都存在网络上。\r\n消除电脑性能的差别，都是统一的运算能力\r\n\r\n12.\r\n添加与证券等金融企业的合作，还有企业咨询管理公司的合作。\r\n查看股票的时候，每日付费就可以得到投资建议，根据付费多少得到的建议也分类。\r\n可以智能分析股票，提供企业新闻，看新闻时提供辅助阅读，解释各种名词。还可以提供辅助炒股，解释股市各种术语。\r\n创业人士可以提供企业管理咨询的广告。\r\n\r\n13.\r\n广告问题\r\n对了 我们中国人现在也更新人朋友推荐的广告了，因此ipaper中出现的广告都是可以互相分享推荐的。每个广告在淘宝中还挂了号，有商品销售。\r\n延伸的话，淘宝可以要求将所有产品都在淘宝中建立链接，所有买卖都有据可循，有评论和销量可查，私密产品可以不公开销量等，但是有一点惩罚或限制。\r\n这是淘宝的发展趋势，当然所有数据权都在淘宝手中肯定有人嫉妒。\r\n即使是线下买卖，也是客户自发到相应链接点击已经购买的，就像豆瓣读书一样的功能。\r\n比如增加“已经线下购买”等按键。或者可以直接构建“线下频道”，由客户自发建立商品链接和信息，只需要上传条码等由淘宝自动分析，\r\n如果没有相应数据就由网友自己填充。\r\n这样的话，系统中所有地方都可以分享广告，而分享中的就有商品链接。\r\nhttp://www.mckinseychina.com/zh/2012/05/15/fighting_a_pr_fire_in_china_with_social_media_2966/\r\n\r\n14.\r\n关于三星产品问题\r\n三星 2018年产品 主要是花高价解决极低成本，1999元相当于2013年1500元，自带软件非常先进，读书做笔记加兼容软件 大量应用等，\r\n都走在前端，把各截图做笔记等软件结合的非常好，但结合不是合作。而且结合只限于软件间，而且多是官方配置的 限制性较多。\r\n\r\n15.\r\n通讯录增加族谱等功能\r\n\r\n16.\r\nSAM毕业于NOTRE DAME，学金融专业，和扎克伯格聊天时说的\r\n扎克伯格资金来源，暗地时期是靠自己的，后来加上了苹果的\r\n多方合作都是绝密的，觉不允许流出消息。合作方出于竞争与抬价与更加吸引合作者态度，在一段时间内也会尽量不流露消息，等别的人加入计划，苹果已经拉开距离了\r\n行动计划叫LERORS计划，LEONARD ELRIC's REVOLUTION OF READING SYSTEM\r\n扎克伯格在SAM分析完读书系统革命后坦言，一开始是朋友在百度文库免费下载然后传给他的，后来联系到了作者，\r\n供其继续留学深造，并要求撤稿，还请公关把网络相关信息全撤，以达到保密。然后把读书方式扩展到全领域，暗中买通各大公司相关人士，同步推进LERE计划。\r\n作者没有写完读书系统革命，后两章只是草稿没有发布，被扎克伯格收录了，是合作协议和过渡策略\r\n\r\n17.代收宝\r\n现在已经存在“代收宝”项目，可以参考\r\n\r\n18.前言\r\niphone4之后，苹果再无重大创新，在敌人的疯狂进攻下节节败退，人们理所当然地怀念起了曾经让苹果公司创造科技辉煌、登上巅峰的ceo乔布斯。认为乔布斯死后苹果再无生命力，就像曾经面临崩溃的罗马帝国一样。\r\n然而，苹果并不如想象般那么脆弱，他正在默默的为即将到来的大变革做准备，乔布斯的灵魂始终留存在这家传奇的企业。\r\n下面就让我们"},{"url":"https://api.github.com/repos/solomonxie/solomonxie.github.io/issues/comments/383298417","html_url":"https://github.com/solomonxie/solomonxie.github.io/issues/17#issuecomment-383298417","issue_url":"https://api.github.com/repos/solomonxie/solomonxie.github.io/issues/17","id":383298417,"user":{"login":"solomonxie","id":14041622,"avatar_url":"https://avatars2.githubusercontent.com/u/14041622?v=4","gravatar_id":"","url":"https://api.github.com/users/solomonxie","html_url":"https://github.com/solomonxie","followers_url":"https://api.github.com/users/solomonxie/followers","following_url":"https://api.github.com/users/solomonxie/following{/other_user}","gists_url":"https://api.github.com/users/solomonxie/gists{/gist_id}","starred_url":"https://api.github.com/users/solomonxie/starred{/owner}{/repo}","subscriptions_url":"https://api.github.com/users/solomonxie/subscriptions","organizations_url":"https://api.github.com/users/solomonxie/orgs","repos_url":"https://api.github.com/users/solomonxie/repos","events_url":"https://api.github.com/users/solomonxie/events{/privacy}","received_events_url":"https://api.github.com/users/solomonxie/received_events","type":"User","site_admin":false},"created_at":"2018-04-21T14:09:04Z","updated_at":"2018-04-21T14:09:04Z","author_association":"OWNER","body":"# idea: 灵感填充2\r\n\r\n1.ipaper与iwatch的分开与连接\r\n由一个DIY爱好者创意想出来。\r\n原始的台式机，由于散热问题，增加了不少占地空间和耗能，而且主机在书桌上太占地方。\r\n当时正值冬天，于是他想到把主机移到屋外解决散热问题（如果放在屋内很容易热到死机），\r\n屋外有电源插销给主机供电，再用超长的数据Hub连到屋内，供键盘鼠标优盘等传输，然后再做一根超长的与显示器连接的线，供显示器运作。\r\n后经过改进，他为屋外的主机安装了遥控开机的小装置，非常简单。\r\n再之后改进，他把键盘、鼠标等改成了无限对接的方式。\r\n再之后改进，是最困难的一步。为了优盘可以与屋外的主机无限连接，他们制作了“无线Hub”，模仿无线鼠标的方式，\r\n他们把一个接口插在主机上，一个可以通过无线路由器传输数据的无线Hub放在屋内，然后编写软件驱动给电脑安装上。\r\n再改进，为了显示器可以无线连接，他们又找来了精通显卡原理的朋友，一起开发显卡无线传输的功能。\r\n他们开发了一个在显卡和主板插槽之间的转换插槽，可以读取显卡发出的数据，然后发送到屋内的无线Hub上，\r\n可以直接将显示器用数据线连接Hub显示出数据。\r\n做到最后一步，全机就只剩下显示器有没有实现完全的无线传输了。这时他们再也找不来精通显示器的朋友了。\r\n\r\n到此为止，他们将方案传到网上，在校园内论坛颇受好评，但因成本过高，稳定性不高等因素，没有受到厂商青睐。\r\n但是扎克伯格通过渠道了解到了这个技术，于是花重金买下了他们的创意，并申请专利。然后聘请他们加入到开发团队，\r\n提供专家，一起研发。\r\n\r\n最后开发出了iwatch与ipaper的结合。iwatch不具备任何插口，但可以与一个特质迷你无线Hub连接，u盘可以插到Hub上。\r\n同时，以前需要通过局域网的无线路由器的设备也不需要了，因为iwatch自带一个迷你无线路由。类似与国内出的mifi。\r\n\r\n这样一来，ipaper作为一个输入输出装备，既可以通过互联网与苹果服务器连接，又可以iwatch通过它创造的局域网连接。\r\n\r\n\r\n2.\r\n处理语义方面，zb委托专家组大量收集语义信息，而由于信息量太大，专家组找到了各个大学帮忙做这项工作，作为学校作业或课堂练习发下去。\r\n多年后，由于ipp面试，有人泄露暴露了这个事，正好三星结合新产品借此攻击苹果，同时正式向市面宣布要公开收集力量完成语义等数据库的完善。\r\n苹果反击，补偿曾参与过活动的人购机券或打折券。"},{"url":"https://api.github.com/repos/solomonxie/solomonxie.github.io/issues/comments/383298442","html_url":"https://github.com/solomonxie/solomonxie.github.io/issues/17#issuecomment-383298442","issue_url":"https://api.github.com/repos/solomonxie/solomonxie.github.io/issues/17","id":383298442,"user":{"login":"solomonxie","id":14041622,"avatar_url":"https://avatars2.githubusercontent.com/u/14041622?v=4","gravatar_id":"","url":"https://api.github.com/users/solomonxie","html_url":"https://github.com/solomonxie","followers_url":"https://api.github.com/users/solomonxie/followers","following_url":"https://api.github.com/users/solomonxie/following{/other_user}","gists_url":"https://api.github.com/users/solomonxie/gists{/gist_id}","starred_url":"https://api.github.com/users/solomonxie/starred{/owner}{/repo}","subscriptions_url":"https://api.github.com/users/solomonxie/subscriptions","organizations_url":"https://api.github.com/users/solomonxie/orgs","repos_url":"https://api.github.com/users/solomonxie/repos","events_url":"https://api.github.com/users/solomonxie/events{/privacy}","received_events_url":"https://api.github.com/users/solomonxie/received_events","type":"User","site_admin":false},"created_at":"2018-04-21T14:09:16Z","updated_at":"2018-04-21T14:09:16Z","author_association":"OWNER","body":"# idea: 第六版 主线构思\r\n\r\n\r\n\r\n1，扎克伯格不满意销售量，虽然卖的火热，但离市场占有目标还很远，远达不到之前投入成本，于是想到宣传，必须揭示最深刻的功能和能给人带来的帮主\r\n2，正好利用sam的穷追不舍，让他做个深刻报道，时代周刊大篇幅揭示\r\n3，但是没那么简单，扎克伯格还想利用他办一件事，扎克伯格一直被一个问题困扰，就是找不到作者。当初论文是创意大赛有人匿名用免费电子邮箱发送的，而且过了好几年才想到用它，这时已经找不到人了。直到大资金投入越来越多，才越来越担心以后做大了的时候作者会找上门来。所以想给他一笔钱算买了这个创意。他很怕重复fb或者王老吉的老路，所以迫切希望找到他。\r\n4，其实当初是作者的论文交给了老师，纸质的，是毕业论文，老师给完分数就把所有学生的毕业论文都扔到学校垃圾桶里，有心人捡了很多回去，发现这篇，然后翻译成英文参加fb创意大赛，匿名的，先看看会不会获奖再说，免得担风险。\r\n5，sam的中国朋友打听到，有人听说过读书运动这个词，是和一个朋友聊天时候说的。sam终于找到作者。\r\n6，作者看着ipp，感叹苹果此前生意不好，然后聊扎克伯格与乔布斯的命运，聊到2013年就没信儿了，正好作为伏笔接上后面的大采访。\r\n7，与作者在北京会谈中，作者自己发现是利用了自己的设计原理，顿时脸白，眉头紧锁，描写要细致，从眼神惊讶到沉默到深思，然后意识到sam来找他没那么单纯，不是为了他的论文本身有趣而是为了论文已经被应用了\r\n8，sam如实告诉作者实情，希望他去美国，作者心情复杂的答应了，一方面有不高兴，一方面有好奇和兴奋，都让他可以去美国当面谈谈，作者把原作给他看\r\n9，sam读了一部分原作，然后跳过，剩下的片段在大采访中穿插。\r\n10，作者要求扎克伯格帮他移民，就同意全权把创意卖断给他，扎克伯格答应了。\r\n11，苹果保持优势计划又用到了作者，作者的条件是给他开一家公司，未来社，作者百分百股份，而未来社第一个生意就是将解决方案提供给苹果。扎克伯格答应了，协议里面写明以上几点，还包括未来社列苹果和fb为第一优先客户，最高服务级别，特殊优惠价格等等。\r\n12，大采访之后，ipp大卖，因为已经因此动员到了美国更多州和县城等政府及企业合作\r\n13，ipp一开始采用的重点集中战略，集中在苹果总部的州，因为与政府合作，当地通讯商合作，当地银行合作等，都不是一蹴而就的，所以苹果总部所在地是最佳的，运行好了再扩展。但是这就给竞争对手留下了机会\r\n14，其实扎克伯格不怕报道他们的产品原理，因为不用公开报道，竞争对手也早就通过各种情报分析部门了解到了，而且可以利用强大资源瞬间模仿。还好三星在美国没有优势，但是在韩国优势太高了，就怕从异国发展壮大反攻美国本土。报道反而有利于苹果，能加快占领市场速度\r\n15，产品一年后，三星模仿出现，快速枪战市场，苹果遇到严重危机，作者又一次解决\r\n16，篇末留一个悬念，即苹果再次胜利几年后，出现大量社会问题，即机器智能取代员工，一个人利用超级机器可以代替好几个人，产生大量失业，就降低了销量。这里涉及的问题很严重，原来，代替人类的不是智能机器人硬件，而是智能分析软件。\r\n17，发布会解密，谜题改为，这部划时代产品最与众不同的地方是什么。sam写信指出它的完美结合其它软件和融合个人信息等，没有谈到企业合作和产业结构调整这一层面。\r\n\r\n18，FB扎克伯格发现论文是这样的，FB向来有收集创意的做法，无论是创意大会还是各种收到来稿，都有专门人士对创意进行分类整理，分类为战略级、战术级、产品级三个级别，并分为发展方向、管理方法、市场定位、竞争策略、产品创意等几个具体分类。每到需要进行新的改变或其他需要时，就按照分类得到灵感和参考。当扎克伯格希望来点大动作时，就从发展方向的战略级创意来找，找到作者论文时，灵光乍现。"},{"url":"https://api.github.com/repos/solomonxie/solomonxie.github.io/issues/comments/383298626","html_url":"https://github.com/solomonxie/solomonxie.github.io/issues/17#issuecomment-383298626","issue_url":"https://api.github.com/repos/solomonxie/solomonxie.github.io/issues/17","id":383298626,"user":{"login":"solomonxie","id":14041622,"avatar_url":"https://avatars2.githubusercontent.com/u/14041622?v=4","gravatar_id":"","url":"https://api.github.com/users/solomonxie","html_url":"https://github.com/solomonxie","followers_url":"https://api.github.com/users/solomonxie/followers","following_url":"https://api.github.com/users/solomonxie/following{/other_user}","gists_url":"https://api.github.com/users/solomonxie/gists{/gist_id}","starred_url":"https://api.github.com/users/solomonxie/starred{/owner}{/repo}","subscriptions_url":"https://api.github.com/users/solomonxie/subscriptions","organizations_url":"https://api.github.com/users/solomonxie/orgs","repos_url":"https://api.github.com/users/solomonxie/repos","events_url":"https://api.github.com/users/solomonxie/events{/privacy}","received_events_url":"https://api.github.com/users/solomonxie/received_events","type":"User","site_admin":false},"created_at":"2018-04-21T14:10:42Z","updated_at":"2018-04-21T14:10:42Z","author_association":"OWNER","body":"# idea: 金融专业有意思知识点\r\n\r\n![image](https://user-images.githubusercontent.com/14041622/39085101-b7c3f86a-45b0-11e8-81cd-ba3ceafc0a1d.png)\r\n\r\n![image](https://user-images.githubusercontent.com/14041622/39085109-be9fc39e-45b0-11e8-9ba5-f04902f5ac62.png)\r\n\r\n![image](https://user-images.githubusercontent.com/14041622/39085112-c2c884ce-45b0-11e8-9f78-3ef449db897f.png)\r\n\r\n![image](https://user-images.githubusercontent.com/14041622/39085114-c60a514e-45b0-11e8-9381-6114b0dfb954.png)\r\n\r\n![image](https://user-images.githubusercontent.com/14041622/39085117-c997a776-45b0-11e8-90c9-2f8e862eb2a6.png)\r\n\r\n![image](https://user-images.githubusercontent.com/14041622/39085119-cc997cc4-45b0-11e8-8424-8267719372ea.png)\r\n\r\n![image](https://user-images.githubusercontent.com/14041622/39085120-cf58548a-45b0-11e8-99f1-04f224b4052f.png)\r\n"},{"url":"https://api.github.com/repos/solomonxie/solomonxie.github.io/issues/comments/383298913","html_url":"https://github.com/solomonxie/solomonxie.github.io/issues/17#issuecomment-383298913","issue_url":"https://api.github.com/repos/solomonxie/solomonxie.github.io/issues/17","id":383298913,"user":{"login":"solomonxie","id":14041622,"avatar_url":"https://avatars2.githubusercontent.com/u/14041622?v=4","gravatar_id":"","url":"https://api.github.com/users/solomonxie","html_url":"https://github.com/solomonxie","followers_url":"https://api.github.com/users/solomonxie/followers","following_url":"https://api.github.com/users/solomonxie/following{/other_user}","gists_url":"https://api.github.com/users/solomonxie/gists{/gist_id}","starred_url":"https://api.github.com/users/solomonxie/starred{/owner}{/repo}","subscriptions_url":"https://api.github.com/users/solomonxie/subscriptions","organizations_url":"https://api.github.com/users/solomonxie/orgs","repos_url":"https://api.github.com/users/solomonxie/repos","events_url":"https://api.github.com/users/solomonxie/events{/privacy}","received_events_url":"https://api.github.com/users/solomonxie/received_events","type":"User","site_admin":false},"created_at":"2018-04-21T14:13:02Z","updated_at":"2018-04-21T14:13:02Z","author_association":"OWNER","body":"# 读书系统的革命 第一版 (李琦审阅)\r\n\r\n![image](https://user-images.githubusercontent.com/14041622/39085138-00e84bf4-45b1-11e8-8539-da6985e34dd4.png)\r\n\r\n![image](https://user-images.githubusercontent.com/14041622/39085144-0d6c1694-45b1-11e8-9690-b6a14f3a66c6.png)\r\n\r\n![image](https://user-images.githubusercontent.com/14041622/39085148-126886f0-45b1-11e8-9933-b121fd6fafa6.png)\r\n\r\n![image](https://user-images.githubusercontent.com/14041622/39085149-17452084-45b1-11e8-9e2d-5fe0936ed085.png)\r\n\r\n![image](https://user-images.githubusercontent.com/14041622/39085150-1b5a5248-45b1-11e8-966a-b18de86b6e13.png)\r\n"},{"url":"https://api.github.com/repos/solomonxie/solomonxie.github.io/issues/comments/383299019","html_url":"https://github.com/solomonxie/solomonxie.github.io/issues/17#issuecomment-383299019","issue_url":"https://api.github.com/repos/solomonxie/solomonxie.github.io/issues/17","id":383299019,"user":{"login":"solomonxie","id":14041622,"avatar_url":"https://avatars2.githubusercontent.com/u/14041622?v=4","gravatar_id":"","url":"https://api.github.com/users/solomonxie","html_url":"https://github.com/solomonxie","followers_url":"https://api.github.com/users/solomonxie/followers","following_url":"https://api.github.com/users/solomonxie/following{/other_user}","gists_url":"https://api.github.com/users/solomonxie/gists{/gist_id}","starred_url":"https://api.github.com/users/solomonxie/starred{/owner}{/repo}","subscriptions_url":"https://api.github.com/users/solomonxie/subscriptions","organizations_url":"https://api.github.com/users/solomonxie/orgs","repos_url":"https://api.github.com/users/solomonxie/repos","events_url":"https://api.github.com/users/solomonxie/events{/privacy}","received_events_url":"https://api.github.com/users/solomonxie/received_events","type":"User","site_admin":false},"created_at":"2018-04-21T14:13:52Z","updated_at":"2018-04-21T14:13:52Z","author_association":"OWNER","body":"# idea: 初想部分\r\n\r\n由于图书量太大，所以需要给每一本书打上若干标签，方便进行搜索。除了方便搜索外，还可以在网站中建立一些专题列表，满足不同的需要。\r\n\r\n未来所有无限增加的东西都是必然会出现一个管理措施的，而实现这个措施最快捷的方式就是标签和搜索引擎的搭配，然后加大社交网络性的工具就是网友列单。 \r\n\r\n实际上豆瓣读书已经可以做到了。只是标签的功能还不够突出，离用户的需求还有相当距离，本质上还是书名搜索的性质，而不具备主题搜索的能力。\r\n\r\n针对人群当然越宽泛越好，学术类是第一的，学生类其次，然后是各种不同需求。\r\n\r\n举例子说，你想找关于国家建设的书，想找带走历史性的武侠小说，想找创业的书，想找关于学习方式的书，关于火箭制造的一系列从基础到高级的书，等等等等。总之这些需要光从书名是无法满足需要的，主题性要突出。造成这个需要大量阅读总结工作，除了工作人员外，可以借力，和图书馆图书商出版社合作，还可以接受用户的阅读总结，这样就比较完善了。\r\n\r\n还有一点就是合作的问题，双方共同利益是关键。出版商不能仅仅因为你在旁边放了一个购买链接就提供这么大工作量的数据。还需要更强烈的理由。我可以想到的是，首先将问题二分，一个是提高其纸质图书销量，一个是提高其电子图书销量。\r\n\r\n纸质书销量问题比较老，能让网络帮上忙的，可以是通过主题打包购买，可以是网络评分（已经较成熟了），可以是提供网购链接（实效甚微），可以较创新的搞需求清晰化（高亮需求列表，里面显示了看后可以解决什么需要，比如1回答国家性质问题 2告诉你怎样学习），可以提供站内购买（重要），可以提供团购优惠等\r\n\r\n电子书问题就有革命性质了，"},{"url":"https://api.github.com/repos/solomonxie/solomonxie.github.io/issues/comments/383299086","html_url":"https://github.com/solomonxie/solomonxie.github.io/issues/17#issuecomment-383299086","issue_url":"https://api.github.com/repos/solomonxie/solomonxie.github.io/issues/17","id":383299086,"user":{"login":"solomonxie","id":14041622,"avatar_url":"https://avatars2.githubusercontent.com/u/14041622?v=4","gravatar_id":"","url":"https://api.github.com/users/solomonxie","html_url":"https://github.com/solomonxie","followers_url":"https://api.github.com/users/solomonxie/followers","following_url":"https://api.github.com/users/solomonxie/following{/other_user}","gists_url":"https://api.github.com/users/solomonxie/gists{/gist_id}","starred_url":"https://api.github.com/users/solomonxie/starred{/owner}{/repo}","subscriptions_url":"https://api.github.com/users/solomonxie/subscriptions","organizations_url":"https://api.github.com/users/solomonxie/orgs","repos_url":"https://api.github.com/users/solomonxie/repos","events_url":"https://api.github.com/users/solomonxie/events{/privacy}","received_events_url":"https://api.github.com/users/solomonxie/received_events","type":"User","site_admin":false},"created_at":"2018-04-21T14:14:27Z","updated_at":"2018-04-21T14:14:27Z","author_association":"OWNER","body":"# idea: 第五版构思\r\n\r\n新品发布会， iphone card, ipad paper，sam还以为是全息式或者二者合为一体了，结果只是升级版，但扎克伯格提出革命在于内部系统而不在外部，刻意追求外观形式是不会引起革命的，他改变的是使用方式，引领发现需求，就像乔布斯做的那样\r\n市场排队疯抢，几个月普及，\r\nsam体验产品，包括看书，付费看资料，做笔记，分享笔记到校内，讨论一本书（类似微信的书信），搜索一本书，做证书考试练习题，给领导做报告\r\n讲讲sam操作的一些细节，然后他和andy双人操作的细节，\r\n然后让两人做专题，深入研究成功原因。sam采访扎克伯格，坦言2013年读过谢的书《读书系统的革命》，深受启发，这些年一直私底下在做准备，里面还谈到新概念的接受时间公式，算好差不多该出手了。还谈到开源共享共赢的概念，sam不懂，建议他去看一篇《探讨开源思想与应用》文章入门。回去后，sam研究《读书系统革命》，解读每一章内容并评论，期间还随手用新设备查询相关信息并做笔记。\r\n读完发现思想路线很正确，而且有很多人都看过，但是一直都没有人正确的运用起来，到底扎克伯格是如何让它变成现实的？SAM决定挖掘这个大新闻，打入内部，最终发现了《过渡策略》与《多方合作协议》以及《系统设计》\r\n"},{"url":"https://api.github.com/repos/solomonxie/solomonxie.github.io/issues/comments/390459880","html_url":"https://github.com/solomonxie/solomonxie.github.io/issues/17#issuecomment-390459880","issue_url":"https://api.github.com/repos/solomonxie/solomonxie.github.io/issues/17","id":390459880,"user":{"login":"solomonxie","id":14041622,"avatar_url":"https://avatars2.githubusercontent.com/u/14041622?v=4","gravatar_id":"","url":"https://api.github.com/users/solomonxie","html_url":"https://github.com/solomonxie","followers_url":"https://api.github.com/users/solomonxie/followers","following_url":"https://api.github.com/users/solomonxie/following{/other_user}","gists_url":"https://api.github.com/users/solomonxie/gists{/gist_id}","starred_url":"https://api.github.com/users/solomonxie/starred{/owner}{/repo}","subscriptions_url":"https://api.github.com/users/solomonxie/subscriptions","organizations_url":"https://api.github.com/users/solomonxie/orgs","repos_url":"https://api.github.com/users/solomonxie/repos","events_url":"https://api.github.com/users/solomonxie/events{/privacy}","received_events_url":"https://api.github.com/users/solomonxie/received_events","type":"User","site_admin":false},"created_at":"2018-05-20T05:56:29Z","updated_at":"2018-05-20T05:56:38Z","author_association":"OWNER","body":"# idea: iPaper充电 @2013-06-18\r\nipaper充电利用太阳能屏幕充电技术，解决电池问题。\r\n屏幕本身就是电池"}]