[{"url":"https://api.github.com/repos/solomonxie/solomonxie.github.io/issues/comments/372445615","html_url":"https://github.com/solomonxie/solomonxie.github.io/issues/45#issuecomment-372445615","issue_url":"https://api.github.com/repos/solomonxie/solomonxie.github.io/issues/45","id":372445615,"user":{"login":"solomonxie","id":14041622,"avatar_url":"https://avatars2.githubusercontent.com/u/14041622?v=4","gravatar_id":"","url":"https://api.github.com/users/solomonxie","html_url":"https://github.com/solomonxie","followers_url":"https://api.github.com/users/solomonxie/followers","following_url":"https://api.github.com/users/solomonxie/following{/other_user}","gists_url":"https://api.github.com/users/solomonxie/gists{/gist_id}","starred_url":"https://api.github.com/users/solomonxie/starred{/owner}{/repo}","subscriptions_url":"https://api.github.com/users/solomonxie/subscriptions","organizations_url":"https://api.github.com/users/solomonxie/orgs","repos_url":"https://api.github.com/users/solomonxie/repos","events_url":"https://api.github.com/users/solomonxie/events{/privacy}","received_events_url":"https://api.github.com/users/solomonxie/received_events","type":"User","site_admin":false},"created_at":"2018-03-12T20:08:07Z","updated_at":"2018-03-14T06:04:45Z","author_association":"OWNER","body":"# Genesis\r\n\r\n## Gen 1\r\nGenesis one is all about how the universe and all creatures were created. \r\n\r\n### Gen 1:21\r\n> Sea creatures first to rest earth creatures .\r\nResponse to the made up idea of Evolution\r\n\r\n### Gen 1:22\r\n> It was amazingly deep in the word blessing.\r\nFirst blessing in the Bible.\r\n“Multiply” to the living creatures is not only a blessing, but root in living creatures’ nature, means sex is a blessing at the first place. Only when the creature abuse it, it becomes a sin. \r\n\r\n> Besides, what’s the meaning of letting bird multiply on earth ?\r\n\r\n### Gen 1:24\r\n> In KJV it’s “in his kind” \r\nNot sure what it means \r\n\r\n> What exactly is the “creeping things” ?\r\n\r\n### Gen 1:27\r\n> Repeated twice : image of God\r\n\r\n### Gen 1:30\r\n> For every creatures He has given green plants as food. \r\nBefore any killing, we are all vegetarians.\r\n\r\n## Gen 2\r\n\r\n### Gen 2:3\r\n> God made the seventh day holy.\r\nHow is it holy? It must be different from other days.\r\n\r\n### Gen 2:5\r\n> No plants had yet sprung up because no rain. \r\nThere’s the idea again evolution: it seems time is frozen for the plants, can’t die or grow. Time is not moving until the rain drop down.\r\nWe could apply the same way about time to: stars, lights, living creatures. \r\n\r\n### Gen 2:7\r\n> The breath of life.\r\nWhat’s so special about that breath, why does it have to be breath than other way?\r\n\r\n### Gen 2:8\r\n> God created man first, after it is the garden.\r\nGarden is in the east. So it’s not always bad in the bible about the east.\r\n\r\n### Gen 2:9\r\n> God made trees in garden that either pleasant to sight or good for food, so which one that tree of life and tree of knowledge belong to ?\r\nTOL good for sight, or TOK good for food?\r\nGen 3:6 answered: tok is both good for food and sight, and brings cleverness .\r\n\r\n> “Tree of knowledge of good and evil”\r\nMeans it only has knowledge about good and evil, not all knowledge?\r\n\r\n### Gen 2:15\r\n> God let man to be steward in the garden to take care of it, like an assistant. Does it depict the original relationship between God and man . \r\n\r\n### Gen 2:17\r\n> God knows what will happen that man will sin but still warm him. What was God thinking then?\r\nI could say , knowing what will happen is not the reason for what He should do.\r\nAnd God must not be trapped by the time theory or butterfly effect, nor force Himself to make the future happen. \r\nIt could be the best way to do so among all other way, or even it could be His favourite way among all other ways.\r\nThink about this question, must have a strong intuition about time theory or related idea. Couldn’t just say that: why should God put tree of knowledge here at first place.\r\n\r\n### Gen 2:18\r\n> God wants Adam to have a helper, notice that, here God did not just made Eva all of sudden, but led all living creatures to Adam and let him choose.\r\nBut he didn’t choose anyone as a helper, after all that, God take the idea to make a woman for him.\r\n\r\n\r\n### Gen 2:21\r\n> God causes a deep sleep upon man and took out his rib:\r\nWorld’s first surgery, with strong anaesthetic. \r\nNot sleep but deep sleep, so he could t feel pain.\r\n\r\n### Gen 2:22\r\n> Sounds like gene clone project: take a part of human and make a copy , with altered DNA.\r\nCan’t say God is not the first and the best doctor and biologist.\r\n\r\n## Gen 3\r\nGenesis three is the start of `Human's Fall`.\r\n\r\n### Gen 3:1\r\n> Now the serpent...\r\n“Now” emphasise the time moving or the nature of a living creature’s changing? \r\n\r\n> It’s more crafty than any other beast: what’s the definition of crafty here? Is it sin, is it impurity or heart of hurting others ? \r\nOr it’s simply just a way to say cleverness?\r\n\r\n> Why didn’t it speak to man first? What would happen if it spoke to man first. \r\nDid it ever talk to the man at all ?\r\n\r\n### Gen 3:3\r\n> Eva was citing God’s command and also add something new to it. That’s a very interesting thing to dig in. \r\nwhat would you say what was happening there? \r\n\r\n### Gen 3:6\r\n> 3 main good effect of tree of knowledge .\r\n"}]